[
    {
        "content": "Mara kbira b'qalb tad-deheb. Barkiet eċċellenza"
    },
    {
        "content": "Well done, I really enjoyed this podcast."
    },
    {
        "content": "Fuq y qass taf xet jigri"
    },
    {
        "content": "Podcast milli informazjoni. Prosit hafna ❤"
    },
    {
        "content": "[NAME] zghir biss qedin tigbdulu widnejh"
    },
    {
        "content": "Grazzi talli qed tahdem biex tghin. Kollox jghin, meta jsir ghal gid komuni. Forsi nista nzid, li tikunsidraw land reclamation. Grazzi"
    },
    {
        "content": "Prosit dawn il podcasts qed jaghmlu hafnu gid"
    },
    {
        "content": "vera l ufficjali ta transport malta ikunu fit triq u jaghmlu xogolom, imma jiddispjecini narahom fi triq u ma ikollomx maskla habba duhhan tal karozzi"
    },
    {
        "content": "Jiena l'bierah kont qieghed nistenna il bus 122 fuq li stage tal Furjana li hemm hdejn il fosos tal 12.47 pero f'ebda hin ma ghaddiet mim hemm"
    },
    {
        "content": "It triq tac cirkewwa haqqek prosit 100%"
    },
    {
        "content": "Fimt hazin... min ma ghandux garrax se tghamel... b 25miljun... 600 karozza se nehhi biss"
    },
    {
        "content": "Biex verament jonqsu il karrozzi darba ghal dejjem sibu sistema tajba ghal l iskrapp tal karozzi li ghadhom fuq it triq u ghandhom il fuq min 20 sena... u ma jixtrux ohra..."
    },
    {
        "content": "Jien din tal flus lura minn iccedi ml karozza/licenzja ilni li semmejta snin u nahseb ghad hemm il comments ta snin ijlu fuq tal podcast ta [NAME]."
    },
    {
        "content": "Introduzzjoni tajba! Infrastruttura nahseb naqa too late U ma tantx hemm ghazla x'taghmel... Dimend ma nibdewx Infejqu l-gheruq U naffetwaw l-ekonomija wkoll. Tad-dahk illum, ufficjal tat-traffiku kien ha jiprova jigbidni fuq naha ta' l istess lane li kont fih stess umbghad Induna li qed nikxef blind spot. Dik hi... IL punt hu... l- Infrastruttura issa hi li hi, naghsru li haw minflok inzidu alternattivi fl-ekonomija u awtomatikament tinbidel il- mentalita' li ma zmien taffetwa is-suggett ukoll!!"
    },
    {
        "content": "[NAME] il mod kif tintervista dawn it tip ta nies tsl politika veru proset. Ihosuwom kondi jitkelmu mijak u veru tkun genwin u ma tigbed lebds habel. Pero nixti li xi darba tpogi bilqeda ma dr [NAME] busutil ax ma nhos li huwa fear pogejt bilqeda ma [SURNAME] u ma dr busitil le. Dr busutil huwa xempju ta ezempju ta bnidem li igiled il korruzjoni b kull mod li seta. Haqu ikolu ic cans li jpogi bilqeda ma bnidem bhslek u isasih il mistoqsijit ibsin izda b modu uman u thalih iwigeb fid detsl. Nerga najdlek proset ax veru edukat bil mod kif tistaqsi mistoqsijit ibsin pero ukol b rispet u edukazjoni itijom il hin kollu tahhom iwigbu."
    },
    {
        "content": "Prosit tal programm u inselli alik [NAME] u al ministru. Nahseb il problema tat traffiku li hawn mux ax hawn hafna karozzi imma qed johorgu hafna licenzji. Dan min andu 10 karozzi wahda haj suq alkemm sar hafna investimenti kbar fit toroq"
    },
    {
        "content": "ROTI BXEJN LILL KULLHAD GHANKI SKOOTERS -ELECTRIC."
    },
    {
        "content": "IL-PROBLEMA TAT TRAFFIKU MHUX SA SOLVITA L-AWSTRALIA ART KBIRA U BHAL MALTA, IT-TRAFIKU, MORRU L-INGLTERRA"
    },
    {
        "content": "Proset lilek u l-ministru, [NAME]"
    },
    {
        "content": "Hoe to pay 4 that"
    },
    {
        "content": "Man ples talk real life pls u are not talkonh reight ples do t talk like this"
    },
    {
        "content": "Ejra bazwija andu dal bnidem!"
    },
    {
        "content": "Ikkonfermajt izjed b'dan il-podcast kemm int bravu ta vera [NAME], kull argument li qal dan li jahseb li jaf jirraguna biex tlett kwarti jekk mhux izjed, gibtomlu fix-xejn. Jekk hu kapaci missu ghamel bhal haddiehor u [NAME] jirnexxi imma hareg biss kemm hu ghajjur ghas success ta min irnexxa"
    },
    {
        "content": "Fl opinjoni tieghi wahda mill aqwa diskursati. Rajt dan il podcast darbtejn u zgur li nerga naraha. 👌"
    },
    {
        "content": "Li tgholli il pagi b'mod mandatorju, li jigri in negozzjant jitfa fuq il konsumatur, u jkun hemm inflazzjoni qawwija, mudell bazwi dak. Li jrid ikun hemm huwa certa skills li in nies jitghalmu biex jiprovdu prodott/servizz ahjar b rizultat li jithalsu aktar. Din ta bil fors ma tahdimx fil free market economy."
    },
    {
        "content": "[NAME] Economics Explains the inequality issue we are facing. The discrepancy between the rich and the poor id growing at an alarming rate. Taxing the super rich and there assets is the key to have a sustainable economy. Taxing the working class less."
    },
    {
        "content": "[NAME] Economics Explains the inequality issue we are facing. [URL]"
    },
    {
        "content": "ezatt pajjizi ohra never ending u Malta daqs naqra. Allura ma tihux il mizuri li jihdu pajjizi never ending imma mizuri li jihdu pajjizi bhalna. Ezempju wiehed - Bermuda. U Bermuda hija izola izghar min taghna u hafna aktar kapaci jzommu populazjoni baxxa il Malti ghalkemm hawn minu hanzir mhux jrid jsir sinjur millum fhal ghada, imma jrid jghix il hajja li kiber fiha mhux jghix bhal ma jghixu l indjani, 20 f appartament, dik mhux il hajja li kiber il Malti fiha, b hekk il Malti jrid jithallas aktar, biex jghix hajja tal kultura tieghu"
    },
    {
        "content": "Well done [NAME]. Spot on. Kemm nixtiequ ghandna partit politiku li jhaddan l'valuri u l'idejal taghkhom."
    },
    {
        "content": "[NAME] is an exemplary maltese man"
    },
    {
        "content": "Graffitti = Radical Left. (WOKE ESTREM) Kontradizjonijiet : Fuq naha iridu isalvaw il-bajd tal-fekruna ghax tigi estinta, fuq in-naha l-ohra iridu l-abbort."
    },
    {
        "content": "Proset [NAME]. Urejt sens kbir ta kif titkelem."
    },
    {
        "content": "tkellimt fuq min ivvinta il-kuncett tad-dejn. u ghedt li western culture ivvintat id dejn. andek zball. [NAME] aktar ricerka"
    },
    {
        "content": "Ara tohrogx ghal politika... sparat titla habib!!"
    },
    {
        "content": "Proset [NAME] u grazzi f isem l Maltin ta dak li taghmel int u graffiti."
    },
    {
        "content": "Ima bli et tajd int fkas ta evident xjigri inxurjati in nies"
    },
    {
        "content": "Tatix aktar licenzji lil baranin!"
    },
    {
        "content": "Dan jaf li l-Maltin ghandhom darhom, taf li huma 82 fil-mija. Ikompara ma paijizi oħra ħalli [NAME]. Min ghandu terraced house qed iwaqqu biex jibni ghal-uliedu."
    },
    {
        "content": "🎉🎉🎉🎉🎉"
    },
    {
        "content": "Iprovdi int mudell ekonomiku ħalli nsraw biex hiereġ."
    },
    {
        "content": "Il bini gholi GonziPn hareg il permessi kien fi zmienu allura ghaliex qed teqirdu issa ghal gholi Tal bini?"
    },
    {
        "content": "Dr. [SURNAME] 25 sena ilu ghenitni publikament kienet ghada gurnalista dak iz-zmien u veru ma' ratx kuluri. Grazzi [NAME]."
    },
    {
        "content": "Fil bidu tat 2000's kien hemm sajf li amilna 3 gimghat bla dawl mill 10am sa 10pm"
    },
    {
        "content": "Possibli ma gietekx f mohhok li issaqsija ghala id distrbuzjoni ma ziduwiex ma l ammont ta nies li kienu qed igibu huma u kemm waqqaw ghac cajt meta il pn hargu b interconnector nahslu il hwejjeg bil lejl fost insulti ohra biex issa ha jmorru ghal interconnector iehor"
    },
    {
        "content": "[NAME] int miz Zurrieq??"
    },
    {
        "content": "Dr [SURNAME] is one of the best I do really like her and she knows what she says"
    },
    {
        "content": "Podcast lucidu ħafna, li spjega sewwa dawk li huma fatti b' oppost ghall-fake News irresponsabbli. Malta mhix xi ġenna ta' l-art, imma lanqas infern. Jgħallmuna li hemm il-Purgatorju. Ejjew insibu kompromess fl--aħjar interess ta' uliedna u uliedhom. Illum jien anzjan, ta' wara t-tieni gwerra dinjija, u nafu kif żviluppa pajjiżna matul is-snin. [NAME], ħaqqek prosit Ministru."
    },
    {
        "content": "Proset ministru your one of the best and onest man❤"
    },
    {
        "content": "u dawk n-numri fil-habs? Qieghdin sewwa nizdiedu ghax qed naqflu il-hmieg tad-dinja!!"
    },
    {
        "content": "Podcast ta vera [NAME]. Inkun nistennieh ghax vera ggib nies ta vera. Il ministru [NAME] wiehed minnom. Proset hafna"
    },
    {
        "content": "Proest [NAME] KEMM Hadd Pjacir Nismakom U Kemm Hadd Pjacir Nisma Lil Ministru Jispjega Fuq IX XOGHOL Kbier LI Jaghmel Proset U Grazzi Hafna Lilkom It Tnejn God Bless"
    },
    {
        "content": "Prosit il Ministru hu Prosit [NAME]"
    },
    {
        "content": "How is this man still a minister?"
    },
    {
        "content": "U Fi Zmien [SURNAME] KIEN Hawn Stajk Tal Furnara. U [SURNAME] Qabbad Lis Suldati JAGHMLU L Hobz U Jqassmuh Huma"
    },
    {
        "content": "Prosit Ministru ta' xogħol kbir li tagħmel mhux ta' b'xejn iriduk tirriżenja. [NAME] grazzi ta' dawn il-podcast."
    },
    {
        "content": "Suggeriment zghir fuq il fence tal airport u kull post li ghandu bzonn sigurta massima. Ghala il fences ma jsirux kollha bhal fence li hemm tal AFM f' haywarf?? Dak zgur fence tajjeb u la hu facli taqbzu u wisq aktar difficli taqtaw b'cutter. Dik is sistema ta fencing li qed nahdmu biha daqt talaq 150 sena, so nahseb hi naqa outdated it teknologija. Is sigurta tal fence tad dawra tal airport litteralment fi ftit sekondi taqta u ssub ruhek gor runway bl ajruplan niezel fuqek."
    },
    {
        "content": "Ministru raġel fuq l-irġiel. Prosit [NAME] ta' podcast bis-sens, responsabbli, u jagħmel ġieħ lill-Ministru intervista u lil min intervista."
    },
    {
        "content": "Onest ir-ragel"
    },
    {
        "content": "Saqsi lil Ministru ghala is suldati b'dak li gara qedin ibghattu kolla kemm huma issa pls u il kbarat relax bhal hassa. Iz zghir dejjem jaqla hemm u hadd ma jaghmel xejn. U barra minn hekk jaf il Ministru l abuzz li qieghed issir fuq iz zghir hemm? Taf kemm hemm nies imdejqin minnhabba certu nies. Grazzi."
    },
    {
        "content": "Bi rispet kolu ma [NAME] u [NAME] bilt tahtek! Vera qadt tqis kif titkelem!"
    },
    {
        "content": "[URL]"
    },
    {
        "content": "L-Onorevoli [SURNAME] rega qieghed iqarraq fuq tal-ID cards... kif iddecieda li l-persuni li ircevew l-ittri fuq dak l-indirizz ghandhom ID card fuq dak l-indirizz? u jibqa jirrepeti ghal izjed min darba, umbad jghid li l-NGO repubblika ma ghandiex x'taqsam mal PN..."
    },
    {
        "content": "Qatt ma smajt membru parlamentari mill pn jitkellem daqshekk genwin. I like e. Kieku tohrog fuq il 5 distrett nivvotalek ghax ogobtni u jien ma nappogjax il partit tieghek u min jafni jafni. Keep going"
    },
    {
        "content": "Il pn ma ghandux bhal [NAME]. Ikollu joqod lura ghax ikissruh. Jekk il pn ma jkeccux lil iskaduti u jmexxu z zaghzagh bhal [NAME] ser jibqaw jiehdu t tkaxkiriet"
    },
    {
        "content": "Hallina sur [SURNAME], Kun onest u ghid min qed jaghmel il hsara fil partit, u INT ma tistax thid xi haga kontrihom ax iqatxtulek rasek"
    },
    {
        "content": "[NAME] [SURNAME], jew ridt tqarraq, jew ma ridtx tghid il-verita kollha fuq il-Prim Ministru, meta kien hemm provi li [NAME] Cauruana zbljat, kien hu li waqqaf il-kuntratt li ghamlet u kellha tirrizenja, u ghall-gihna hi ghawdxija bhalu, suppost jaf, sakemm ma riedx jqarraq jew jigdeb, ghidlu lill [NAME]"
    },
    {
        "content": "I had to re visit this pot cast as I believe that he is a good political person, but ask him back and ask him why he did not stand up and not wallked out of the parliament if he was sorry what happened to the speaker, because for me he is talking bull."
    },
    {
        "content": "Trojan horse if there ever was one..."
    },
    {
        "content": "Toroq spiccaw qieghed taghzaq fin-nuhhala!!"
    },
    {
        "content": "JIEN GA RAJT DAN SHOW JIEN SPORTS BHALU. JIEN MINTOFFJAN JOGHGOBNI JITKELLEM, HAFNA LI TELQGHU HUMA PN TAJBIN BHALU, DAWK LI FADAL HZIENA U MHUX SA JAGHMILHOM TAJBIN."
    },
    {
        "content": "[NAME] [SURNAME] on the books muwix parti mil Pn ima qed jahdem min barra biex sipost emijlu ma jhamig Lil PN. imma il PN qatt ma id distanza ruhu [SURNAME] dak li jamel JA. Din tatika komuni li nies mux membri ma group jamlu id dirty work biex jibenefika dak lis stes group filwaqt dak il group ma jkunx legalment liable al dak li jamel. isir mi zewg nahat. Din bhal ta teamijit tal football fejn ikolom is supporters club ufficjali umbad ikollom l Ultras biex jek isir xi hsara fil ground ma jkunx liable it team."
    },
    {
        "content": "Mhux li tiftah l iskejjel ( b'din ma ha digwadanja kwazi xejn) IMMA TRID TERGA TITFA S-SNAJJIET FIT TOROQ U FIL QALBA TAN NIES DAN JQASSA BIEX IT-TFAL JARAW IX-XOGHOL KIF ISIR U JIEHDU INTERESS BARRA MIN HEKK IN-NIES JKUNU JAFU X QED JIXTRU U L BNIEDEM TAS SENA JFEMHOM GHALFEJN SE JHALSU IZJED GHAL PRODOTTI LI QED JORDNAW U MHUX JSIBHOM LESTI U JBALLAWLHOM MIN JRID JBIEH U JKUN SPECJALIZAT KIF PRODOTT BAZWI JAGHMLU QISU QED JIXTRI QISU QED JIXTRI L AQWA (ix-xoghol ta salesman) JEKK IS SNAJJIET MHUX SE JERGAW JIGU FIL QALBA TAN NIES LI QED JINGHAD KOLLU HANQA TA HMAR U FLUS MITLUFA. JIEN NAF FIC CERT LI STUDENTI LI HRGIN MILL MCAST (barra dawk li jiqfu f nofs (jew fil budu) TA DAWN IL KORSIJIET WARA HAMES SNIN JEW L'AKTAR GHAXRA MA JIBQAWX FUQ IS SETTUR LI GRADWAW FIEH U DAN KOLLU TISTA TIKONFERMAH JEKK TAGHMEL FTIT RICERKA"
    },
    {
        "content": "Carry Capacity study il-ħin kollu jsir u MAlta kienet diġa popolata wisq minn zmien il-kavallieri"
    },
    {
        "content": "Għalkemm li nemmem li għandna nisimgħu u anke nitgħallmu mit-tfal, nikkonferma li hu zball li d-dritt tal-vot u li tiġi elett nizel għal 16 u zball ikbar li n-nisa jiġu eletti fil'parlament bil-kwota!"
    },
    {
        "content": "Fakkarhom iħaslu t-taxxa personali. Fakkarhom ma jiħdux xi €600 min wara dar kullħadd. Fakkarhom jħallsu id-dejn tal-Partit."
    },
    {
        "content": "Mur icekja kif ħadmu l-komisarji that il-PN. Ghandek Bzonn tistudja l-istorja ta'."
    },
    {
        "content": "Jekk tumr ghand Magistrat bla provi, x'se naghmlu? Inti tkisser lil xi ħadd bil-gideb u tispicca hemm? Le ta' mhux sew tkisser lil ħadd. Mela li tiftaħ inkjesta hi loghoba? Mela flus il-poplu jitberqu hekk? Mela min jivinta ghandu jeħel multa talli jkisser nies bla ħtija. Ir-reputazzjoni tal-persuna liema flus jikkumpensaw. Jekk ghandek provi mur ghand il-pulizija, jekk le aħsiba darbtejn."
    },
    {
        "content": "zaghzugha promettenti. Keep it up [NAME]."
    },
    {
        "content": "X'qalet din? il-PN maghqud? daqs il-gelat fis-sajf maghqud"
    },
    {
        "content": "is this [NAME] [SURNAME] Sister"
    },
    {
        "content": "BLOCK OFF ICE"
    },
    {
        "content": "din Hdura biss ixxejer"
    },
    {
        "content": "Lar program li kellek hmerijet ghatu"
    },
    {
        "content": "Meta titilaw intom kollox jamlu"
    },
    {
        "content": "IL pn kollox ha Jamel IL poplu jaf camel mil ghanda memx xejn ghalek qedin f loppozjoni IL gahan dejjem jirbah ghac li kit jamlu"
    },
    {
        "content": "Kollox ha taghmel"
    },
    {
        "content": "Prosit [NAME]. [NAME] ma setghetx titkelem fuq [NAME] [SURNAME] ghax ikissira jekk tghid kelma. Nammirha imma nixtieq il pn mimli b nies bhal [NAME] mhux bhal [NAME] etc."
    },
    {
        "content": "Meta tghid li gvern ghamel pocket gardens biss pero, tkun qieghda tkun unfair hafna. Ghalkemm sar sfregju ambjentali minhabba diversi progetti, tajjeb li nghidu li qatt daqs l-ahhar snin ma gewx investiti flus fuq gonon kbar, ma ghandiex ghalfejn naghmel lista ghax kulhadd jaf liem huma."
    },
    {
        "content": "Proset Rick - qajjimt 4 punti interessanti"
    },
    {
        "content": "Prosit [NAME], kompli gibom lil dawn in nies ghax bil mod l'ipokrezja ta dawn in nies qeda tohrog."
    },
    {
        "content": "Hatt pjacir nismakhom TITKELMU INTERESANTI. PERO LEWWEL IL-MALTIN QED JIGHXU U IX-XOGHOL"
    },
    {
        "content": "Tal 500 kienet fi zmien fejn il poplu kien qed ibghati, b hekk kien hemm backlash kbira, in nies kellhom 800 paga average(il jobs tal-popolin mhux professjonisti.) Barra li kien hawn hafna qaghad u recessjoni."
    },
    {
        "content": "Mind your language brother"
    },
    {
        "content": "I really enjoyed hearing [NAME]'s take on these topics, but I felt [NAME] took over quite a bit, sharing his own views instead of giving her more space to speak."
    },
    {
        "content": "META IKUN RAPE AFFARI TAL MARA. JIEN FAVUR."
    },
    {
        "content": "iktar titkellem int milli l-guest sur. Ipprova naqqas ftit u ghati cans lil guest jitkellem (il-bqija tajjeb hafna hlief li nahseb tiftahar daqxejn izzejjed)"
    },
    {
        "content": "Proset Ta Dan IL Protcast Had HAFNA Pjacir Nismakom Proset [NAME] U Proset LiL DR [NAME] [SURNAME] Kemm Hi Mara Umli Grazzi Hafna"
    },
    {
        "content": "Ma saqsejta xejn fuq [NAME] [SURNAME] Manche!! [NAME] int taf sewwa x ghamillu il PL u din kienet wahda mill percimes basta hafna drama fuq hajjietha"
    },
    {
        "content": "Ragel kbir li dejjem kien umli u li dejjem sema lil ta' madwaru... Qatt ma kibritlu rasu u dejjem zamm l-interess tal-pajjiz l-ewwel u qabel kollox. Rahal twelidu kburi bih ghax bhalu bhala sindku, hadd u qatt u l-istess nistghu nghidu ghall pajjiz ingenerali. Kull fejn kien hlief gid m'ghamilx u ghadhu ghaddej 👏👏"
    },
    {
        "content": "Il-preżentatur jitkellem aktar mill-mistednin!!"
    },
    {
        "content": "Prosit, zewg persuni ammirevoli"
    },
    {
        "content": "Prosit ONEROVOLI IAN [SURNAME] KEEP IT UP WE NEED MORE MATURE PEOPLE LIKE YOU. PROSIT [NAME] BHAL DEJJEM GHAL DAWN L'INTERVISTI. KEEP IT UP YOU TOO."
    },
    {
        "content": "We need real leaders in the EU strong, with a vision. One cannot lead with a bunch of wusses and expect to thrive. Strong countries have true Leaders like China, India and Russia are progressing way faster, Trump was god sent, he [NAME] keep the world in balance."
    },
    {
        "content": "L EU spiccuta, la hemm difiza, la hemm innovazzjoni, AI qas hemm wiehed sura ta nies, quantum computers xejn, kif trid timxi l quddiem bla research and development??"
    },
    {
        "content": "Ian, king. Kull fejn tpogga dejjem hadem ta ragel. Il partit laburista ma ghandux bhalu"
    },
    {
        "content": "[NAME] the best"
    },
    {
        "content": "Ian ragel tajjeb"
    },
    {
        "content": "Il-laqgħa ta' bejn Trump, Zelensky u Vance ddeskriviha tajjeb ferm [NAME] Tardio, eks suldat Amerikan li kien mibgħut iħarreġ lil Ukreni. [URL]"
    },
    {
        "content": "Ejja nwaqqfu l-qtil, imma jrid ikun hemm garanzija li ma jkunx hemm iktar qtil fil-ġejjieni wkoll! L-Ewropa u Biden għaffġuha għax ma tawx l-armi f' waqthom, u b' hekk l-Ukreni spiċċaw ħallsu b' demmhom. Wieħed irid jiftakar ukoll li l-maġġor parti tal-ġens Ukren ma jridx ikun taħt il-madmad Russu. U [NAME] le, sejjer żbaljat l-armata Russa tkissret tattakka l-Ukrajna. Spiċċat biex qed tibgħat nies bil-krozzi biex jiġġieldu!"
    },
    {
        "content": "Meta trid nintaqghu u nhjidlek il problemi kollha li hemm il gagbinismu u l ghira li hawn marsaxlokk inkredibli. Hadd mu jghid xejn ghax kulhadd komdu. Meta tridu naghmlu tahdita [NAME] [SURNAME] halli taraw bghajnejkom fejn irid il priministru jkun jaf li jien cittadin malti tlift ix xoghol l aktar li kelli ghal qalbi minhabba zewgt barranin b komplicita ma zewgt ahwa maltin u l imghallem naqsuli il paga li ma setghux jaghmlu hekk qabduni deeppresion u biex jigi kollox kontra l awtoritajiet tal gvern mux ma jistghux jirangaw imma ma jridux ghax hemm il hmieg iva nibqa najjar lil transportmalta tal koruzjoni shiha li hemm u lil min thalli jahdem u lil min le ma jimpurtax ibqghu ftahru x gid hawn bil barranin u jien malti u kisirtuni. Tal monti il hadd kulhadd jaghmel li jrid u jien ma nistax nahdem. Jigri x jigri issa ir responsabilita fidejkom tkellimt ma kulhadd mal priministru biss baqali l ahhar cans misejtuli il hobza ta kuljum u qed tbatili il familja il limitazjonijiet qedin jipersistu"
    },
    {
        "content": "Jien ghalija fuq marsa xlokk ma rispondejtx"
    },
    {
        "content": "😅😊😊😊😊😊😊😊😊"
    },
    {
        "content": "Proset"
    },
    {
        "content": "😊😊"
    },
    {
        "content": "Prosit tassew Prim ministru diskussjoni eċċellenti veru podcast bis- sens keep it up u very well done"
    },
    {
        "content": "I was really relax listening to Dr [SURNAME] talking with you"
    },
    {
        "content": "umbadt awn min qas jista rabbi qattus gol flat lool. U [NAME] jithaq flok isaqih mistoqsijiet li jmissu il laham il haj. Imma imsomma program populist"
    },
    {
        "content": "aw man laqghi ta. Basta ewwel tparla fuq aljeni u oxxenitajiet li kont tghid fuq il politikanti biex illum isek smurf quddiemhom. saqsi mistoqsijiet bil bajd mhux ijsu gej jitqarben andek"
    },
    {
        "content": "Proset prim"
    },
    {
        "content": "Top❤"
    },
    {
        "content": "Qed niehu pjacir nisimghu lill-Prim Ministru jitkellem hekk fuqna l carers tal-kuntrattur, j'Alla mill-kliem nghaddu ghall-fatti u tiehdu hsiebna, il-ftit li fadal Maltin."
    },
    {
        "content": "The best podcast"
    },
    {
        "content": "Jiena [NAME] [SURNAME] proset it tnejn li imtom ❤❤"
    },
    {
        "content": "Il Prim Ministru hareg tajjeb f dan l podcast imma nippreferi jkun f dibattitu u jkun hemm min jiribattieh. Prova stedinhom [NAME] l kapijiet u ara jaccetawx dibattitu civili."
    },
    {
        "content": "Great talk both of you well done"
    },
    {
        "content": "Proset tal-programm grazzi [NAME] u grazzi lill Dr. [NAME] [SURNAME] intervista interessanti"
    },
    {
        "content": "Thank you"
    },
    {
        "content": "Proset [NAME] Intervista interesanti"
    },
    {
        "content": "Proset u grazzi [NAME] [SURNAME]. Intervista sabieha, bis - sugu."
    },
    {
        "content": "Podcast tassew sabih u interessanti. Grazzi hafna"
    },
    {
        "content": "proset hafna. veru hadt gost nisma u Nara Dan il podcast"
    },
    {
        "content": "Interessanti hafna! Proset fr [NAME]. Hemm bzonn ta iktar kuxjenza u awareness fuq hafna missirijiet u ommijiet li qed isibuwha difficli jrabbu t tfal tahhom fid dinja tall lum!"
    },
    {
        "content": "Wieħed mill-aqwa podcasts! Prosit."
    },
    {
        "content": "Prosit kbira tassew!"
    },
    {
        "content": "Impressjonanti prosit tassew"
    },
    {
        "content": "Dawn it tip ta saċerdoti nemmen li iktar jiġbdu nies lejn il knisja. J alla jkun hawn ħafna minnhom. God bless you fr [NAME]."
    },
    {
        "content": "Proset tassew... bis'sens... harget l umanita taghkom."
    },
    {
        "content": "Dak il bniedem jixraqlu ikun papa. Veru umli u bravisimu."
    },
    {
        "content": "Proset tassew diskusjoni bis sens"
    },
    {
        "content": "Proset hafna well done ❤"
    },
    {
        "content": "How interesting... well done to both of you! :)"
    },
    {
        "content": "Prosit tassew. Konverzazzjoni intelletwali u interesanti hafna"
    },
    {
        "content": "Prosit [NAME] u Prosit Father [NAME] kemm niehu gost bil -priedki tieghek ma nixba qatt nisimek"
    },
    {
        "content": "PROSET TA SEW KEM GHANDNA BZONN NIES BHAL DAWN FSOCJETA TAL LUM Pls niextiqek li terga gibhu lil Fr [NAME] specjalment isa li wasal zmien Randan tghamlu talk dwar tbatijiet li ghaddejin hafna nies u ghala dawn jigu GRAZZI Hafna"
    },
    {
        "content": "Kemm hadd gost nismghakom, lanqas xtaqtkom tispiccaw, brilanti Father, Cillia."
    },
    {
        "content": "Proset hafna [NAME] vera ghandek podcast bis sens u li titghallem hafna minnhom. proset ukoll lil Fr [NAME]."
    },
    {
        "content": "Ghalkemm minix religuz (kont hafna snin ilu) hadt gost nisma lil Fr. [NAME] ghax ghandu knowledge kbir u jirraguna ghalkemm jien madnux nemmen ghax mhemx evidenza ta xejn hlief kif nittrataw lil xulxin f'din id dinja"
    },
    {
        "content": "Brillanti dan il-podcast!! Prosit tassew"
    },
    {
        "content": "Proset 👏"
    },
    {
        "content": "Bravu hafna... Down to earth..."
    },
    {
        "content": "Proset tassew, kemm hadt pjecir nisimghu, x' gherf, x' intelligenza, kemm hu umli, grazzi [NAME] ta dan il podcast."
    },
    {
        "content": "Prosit qassis ta veru ifieghem bis sens b rispett lejn religjonijiet ohrajn"
    },
    {
        "content": "Wow. Prosit."
    },
    {
        "content": "dal bniedem qaddis"
    },
    {
        "content": "Ragel Kbir bidili hajti"
    },
    {
        "content": "Podcast ferm interessanti kemm dan u anke dak li deher fuq ta [NAME] l-istess [NAME]."
    },
    {
        "content": "Iz zmien ta Mini bugz kien zmien sabih, xminnu [NAME] tal [NAME] tajd"
    },
    {
        "content": "Iz zoblu d best🤣🤣"
    },
    {
        "content": "L-aktar karattru li qatt ma ninsa iz zoblu, l instructor."
    },
    {
        "content": "Ir rinella niftakrek sander taghmel il parti ta gahan 😊"
    },
    {
        "content": "Proset lit tnejn li intko! hdit ftit zghira mghakom meta kellkom bzonn xi props u meta kellkom bzonn xi pariri milli stjt! flistess ilma bhalkhom qijad! naqqast u irrid ingawdi iktar il hajja! keep it up!"
    },
    {
        "content": "[NAME] din it tieni darba li smajtek tghid li l PL ilu 13 il sena fil gvern. Il PL ghalaq 12 il sena fil gvern fid 9 ta Marzu. Tela fil gvern fl 2013. Proset ta dawn il podcasts. Niehu pjacir bl imparzjalita li turi fil mod kif isaqsi l mistoqsijiet."
    },
    {
        "content": "Lil [NAME] [SURNAME] ili nafu għexieren tas-snin bħala bniedem integru u dinjituż. Il-kedda li ngħata ntortament u bi ħsieb malinn kienet att krudili. Intilfu ħafna snin ta' servizz bħala ministru minħabba din il-gidba u nemmen li għandu jsib ruħu bħala ministru f'dan it-terminu leġislattiv. Jiena għaddejt minn storja simili meta gidbu, għal vantaġġ politiku, li jiena sraqt trakk kotba ta' librerija ta' kunsill lokali, meta l-uffiċċjali governattivi stess qalu li l-materjal kien ittieħed mal-ewwel fil-maħżen tal-ministeru, bħala rutina ta' xogħol. Minkejja l-kedda kbira li ħadt għalxejn - wisq probabbli għaliex ħawtiel u jiena min jien, qatt ma ħadt apoloġija u min gideb fuqi ma ġralu xejn. Illum imdarras lejn is-sistema ġudizzjarja Maltija."
    },
    {
        "content": "[NAME], grazzi ta din l-intervista. Qed nistenna lis-Sur Az, opardi iss... ha naraw!!"
    },
    {
        "content": "Programm tajjeb ħafna. Dejjem emmint li [NAME] [SURNAME] ma kellu x'jaqsam xejn ma dan il-ħmieġ kollu. Ilni nafu minn meta konna tfal, u jekk hemm persuna li naħlef għaliha għall-integrita tagħha hu [NAME] [SURNAME]. [NAME], ibda ġib u ntervista lil ħafna nies li kienu l-mohh fil-ġurnaliżmu (indipendenti LOL) li ppropagaw din il-gidba u ħafna affarijiet ohra li jinħadmu bizzilla biex ikissru n-nies!!"
    },
    {
        "content": "Korrezzjoni a bazi biss ta' dak li qed jghid l-onorevoli li ghandi rispett lejh: dwar id-direct orders il-kaz ma kienx kontinwazzjoni ghal dak li kien jigri qabel. Milli nista' nifhem qabel kienu impjegati u allura xoghlhom kien parti mill-impjieg taghhom. imbaghad fethu kumpanija privata. La darba fethu kumpanija privata ma baqghux l-istess persuni ghax kumpanija hija entita ghaliha, avolja maghmula mill-istess persuni. Nifhem li Ministru ma jkunx espert u jiddependi mid-dipartimenti ecc imma r-regoli qeghdin hemm biex ikunu rispettati u allura la darba dawn il-persuni ffurmaw kumpanija ma setghux jinghataw direct order. Importanti li kulhadd jifhem li ghalkemm ma jkunx hemm hazen mill-Ministru nnifsu, ir-responsabbilta' politika tibqa' dejjem tieghu, xi haga li donnha llum qed tintesa!"
    },
    {
        "content": "Proset"
    },
    {
        "content": "Proset imens tal programmi tieghek jien niprova ma nitlifx wiehed ghax narhom fair, u ta dan il potcast, jiddipjacini hafna ghal Hon, [NAME] [SURNAME] ghal dak li ghadewh minnu pero jien qatt ma emmint dak li qallu fuqu, jien ma nafux lil [NAME] huwa ragel gentlom j, alla min qalla dan il gideb fuqu jiehu dak li haqqu pero il bniedem jurik, xhinu,"
    },
    {
        "content": "l-ebda ammont ta flus ma jimla il-vojt li jkun halla kas bhal dan, imma nemmen li jekk il-piena ta min jaqla kalunja tkun aktar harxa, nemmen li ghallinqas iservi ta deterrent u ma jergghax jghaddi hadd iehor mill-istess trawma"
    },
    {
        "content": "Prosit li qijjed tajt kollu minu"
    },
    {
        "content": "Dawk l Miljuni kollha ghal Pbs plus ir riklami mid dipartimenti tal Gvern, tajdlix li hekk sewwa, apparti li gibuh propaganda tal Gvern, sorry ikolli najd u b dan il podcast iktar hareg ovju"
    },
    {
        "content": "Proset tal-programm veru kien interessanti. kont impressjonata kemm huwa bniedem umli. J'Alla jerġa ikun Ministru biex tkun saret ftit ġustizzja miegħu u mal-familja tiegħu."
    },
    {
        "content": "Bniedem umli u verament raġel twajjeb."
    },
    {
        "content": "WELL DONE, TO ALL OF YOU."
    },
    {
        "content": "\"Dawn l-arcikiminali kolla jinsabu l-habs taht Gvern Laburista li \"tant hu vicin l-Mafia\". Issa min irid, jifhem\" Never a truer word was uttered by a politician. Nahseb S-Sur [SURNAME] dejjem wera' integrita' ghad-differenza ta' Dr. [SURNAME] li hu maghruf ghal gideb u l-kalunji tieghu. Prosit Dr. [SURNAME]."
    },
    {
        "content": "Grazzi"
    },
    {
        "content": "il-margin of error jikkumpensa ghall min jigdeb apposta?"
    },
    {
        "content": "Interessanti bhal dejjem"
    },
    {
        "content": "Grazzi."
    },
    {
        "content": "Sa sentejn ohra ser ikun hawn iktar min mhux ha jivvota labour. Jekk jidhol [NAME] [SURNAME] biss jivvutaw."
    },
    {
        "content": "Prosit lil Prof [SURNAME] veru jaf ifihem Grazzi ta dal podcast [NAME] Tassew interessanti"
    },
    {
        "content": "Prosit sur [SURNAME]"
    },
    {
        "content": "Labour minn qalbi nivota"
    },
    {
        "content": "Rikki on spot... [SURNAME] sahhalek l-għajta li titkellem f'isem il-Man in the street... Kollox idur mal-familja u l-but."
    },
    {
        "content": "Ahna xjipurtana mil kuruzjoni ta barra ahna min ta malta jimportana ahna pajjiz zghir u kull haga hazina li tigri ihossuwa dopja mux bhal pajjizi kbar u ahna trankwilita iridu fil pajjiz mux il hmieg tad dinja et igibuh aww sar jadi kollox biex jirbu il voti"
    },
    {
        "content": "Indecizi jew ma jridux jivutaw!?"
    },
    {
        "content": "interesanti"
    },
    {
        "content": "NIXTIEQ NARAK U NISIMGHEK FUQ STAZZJON TA AWTORITA TA XANDIR PROSET TAL PROGRAMMI KOLLA LI TAGHMEL"
    },
    {
        "content": "HELLO [NAME] I WISH TO SEE YOUR PROGRAMS ON TV"
    },
    {
        "content": "Kellna bzon Ghana iktar nies bhalek [NAME], Vera the Best ❤"
    },
    {
        "content": "KING [NAME]"
    },
    {
        "content": "Retardjati? Nice."
    },
    {
        "content": "Proset [NAME] - x'diskusjoni interessanti li haqqha 3hrs. Rick part 2 please"
    },
    {
        "content": "Dejjem tghidiha din [NAME], tal kuntentiza jekk Ekonomisti imeexu ikbaru ekonomija, irrid ikollok xi hadd jifem fil kuntetizza biex johloq bilanc u work life balce u mod holistiku kif wiehe djistgha jhares lejn il hajja"
    },
    {
        "content": "Meta ssaqsi mistoqsija twaħħalx fin nies Rick ostja... l bqija keep it up💪"
    },
    {
        "content": "Kemm int hravu [NAME]. Kemm niehu gost nisiemek"
    },
    {
        "content": "Putin kien qal li l-iktar gurnata/sitwazzjoni li affetwatu f'hajtu hija l-waqa tal-Unjoni Sovjetika, Putin dahal fl-Ukraijna ghax ghadu jemmen li dik l-art hija parti tar-Russja u ghanda tkun taht l-Umbrella tar-Russja"
    },
    {
        "content": "Komunikatur bravu u jaf fuqiex qed jitkellem"
    },
    {
        "content": "Ragel umli u onest, jixraqlu jkun fil parlament"
    },
    {
        "content": "you have a lot of [SURNAME] screen when you have adverts."
    },
    {
        "content": "[NAME] [SURNAME] [SURNAME], politikant tajjeb hafna, onest u vizjonarju."
    },
    {
        "content": "Proset [NAME] ta' dan il -programm [NAME] bniedem onest bravu u umli u iħobb jgħin lil kullħadd. Jien naħseb li għana bżonn nies bħalu fil-politika."
    },
    {
        "content": "Proset [NAME]"
    },
    {
        "content": "Prosit [NAME]👍🇲🇹❤️"
    },
    {
        "content": "❤❤❤❤❤❤❤😂❤"
    },
    {
        "content": "[NAME]'t you think that the use of homophobic comments to describe negative situations might upset your gay guest?"
    },
    {
        "content": "Il guest min hu [NAME] jew [NAME]? Prosit ta li taghmel pero fl-opinjoni tieghi trid thalli lil mistiedna jitkelmu iktar u int titkellem inqas..."
    },
    {
        "content": "100% Rick about the EU. Its a scam club and a pact with the devil"
    },
    {
        "content": "anqas flixkun kappar ma konna kapaci naghmlu fuq is-suggett li kieku bqajna barra mill-ewropa."
    },
    {
        "content": "[NAME] bomba. Proset!"
    },
    {
        "content": "Intervista Vera interesanti."
    },
    {
        "content": "[NAME], Indjani u Pakistani gew minn barra, dawn ma gewx ghax dhalna fl Ewropa. It tifel tieghi qed jaghmel Masters l Ingilterra, li kieku ma dhalniex fl ewropa, kieku konna inhallsu €24, 000 ghalih, imma minflok hallasna €12,000."
    },
    {
        "content": "Prosit tassew għad diskussjoni deep. J'all jkun hawn aktar min japprezza din it-tip ta' riflessjoni fuq il-ħajja. Barkiet"
    },
    {
        "content": "Prosit Ġanni. Kellek esperjenza li tmiss ma hafna affarijiet f' hajtek u qed titkellem kif ihossu bniedem tat-triq mill-att politiku."
    },
    {
        "content": "FIL BOXING META TKUN CHAMPION, META IN, NOCKOUT TITLEF IL-GLIEDA TITLEF, ITUK CANS DARBA."
    },
    {
        "content": "[NAME] [SURNAME] is a liar (he's been caught lying many times - e. g. when he couldn't remember when he had last met Yorgen [SURNAME], or when he suggested his minister had produced a 'draft' declaration of assets). At best, he is our most incompetent prime minister (for allowing government to be infiltrated by organised crime); and at worst - he saw what was happening and decided to ignore it."
    },
    {
        "content": "Mezzola, nahseb li over rated. Issa Trump juri minn vera ghandu sahha li jiehu decizjonijiet li jibdlu l perkors tad dinja."
    },
    {
        "content": "Ilaq [NAME]"
    },
    {
        "content": "😊"
    },
    {
        "content": "Prosit [NAME]. Jien niftakrek DJ Euphoria meta konnha għadna studenti ħafna snin ilu, Tispirani li bqajt tevolvi fuq livell akkademiku dejjem bi ħsieb kif spjegajt illum. Tispirani għax naf li għaddejt minn sensiela ta' attakki u sirt aktar empatiku u ħanin. Barkiet"
    },
    {
        "content": "Can we have the podcasts back on spotify?"
    },
    {
        "content": "Int [NAME] tittkellem dak li hu prosit,"
    },
    {
        "content": "Sound i qata"
    },
    {
        "content": "Lil [NAME] ma terbahlux one on one zgur, mela mhux ghallhekk hargu din l-inkjesta ezatt qabel l-elezzjoni,"
    },
    {
        "content": "NAQBEL LI TIGHD MHUX F'KOLLOX PERO MA NAV'DAKHOMX GHAX GHAMILTU 20SENA MA GHHAMILTU XEJN."
    },
    {
        "content": "skorret Rick. [NAME] [SURNAME] la baghat ghal FBI u lanqas ghal Olandizi. FBI kienu Malta fuq affarijiet ohra. L kummisarju ta dak z zmien [NAME] [SURNAME] u [NAME] [SURNAME] kienu qaluha publikament. Jekk joghgbok l fatti nghiduhom sew u naqa ricerka ma taghmilx hazin. jew ghal linqas nikkoregi ruhi u nghid li zbal. Insellimlek."
    },
    {
        "content": "Well done to both... Rick, is - semplicita ta kif issaqsi l mistoqsijiet u il karizma li ghandek, plus l istil ta lingwagg li tuza huwa perfettament li hemm bzonn ghal podcast Malti! Ibqa ghaddej!!"
    },
    {
        "content": "Lanqas li mhux ovja li [NAME] Labourist impatentjat. L Agenda ta [NAME] li jiprova jtaffi mil fama hazin li gabru il labour dawn l ahhar snin."
    },
    {
        "content": "Iz zewg mexxejja tal partiti bil ministri b kollox jemmnu li taxi [SURNAME] malti m ghandux ikun. Harja f wicc il flus li nvestejt biex nixtri karozza u nahdem bija u tigu intom u tobzquli f wicci u ssalbuni bil vat ut taxxa..."
    },
    {
        "content": "Il MALTIN iggergru min Kollox Maltese Gemgem"
    },
    {
        "content": "STAQSIH IL PENZJONI META KIENHU SEJ IZIDUHA 25 years QATT MA TAW ZIEDA LIL LANZJANI U EJDLU JOQOT ATTENT GHAX HEMM MIL MP TIEGHU HODOR U HUMA ISSA"
    },
    {
        "content": "Prosit to both speakers, civilised discussion, informative enjoyed it. The [SURNAME] Dr. [NAME] announced his leadership I commented that he is a God send, I still say he is a God send and [NAME] save our country from this disaster. I am 82 and my only wish before I die is to see Malta return to a normal country. God bless all"
    },
    {
        "content": "Mistoqsijiet tajbin u podcast interessanti, pero tajjeb li tkun aktar informat dwar is suggetti li tkun ha saqsi dwarom biex tkun tista tikkombatti ir risposti li jtuk ghaliex hafna mit twegibiet ma kienux korretti u baqaw ghaddejjin."
    },
    {
        "content": "1hr 13 mins approx. Il bniedem hu c centru tal politka ghalhekk ok ghal kacca. L ambjenatlist? U ija dak. Mela jivvutalek il kaccatur sbejjah. Serie B tibqghu u l pl jibqa ghaddej gas down fejn laqat laqat u fejn habat habat."
    },
    {
        "content": "[NAME] vera kien l aqwa intervista li qatt ghamlulu, vera prosit ghax tghafas fuq l affarijiet importanti u turi l oppinjoni tan nies."
    },
    {
        "content": "illum kelli c-cans nara dan il-podcast, prosit Dr. [SURNAME] ghax iktar ikkonvincejtni li nerga nivvota labour"
    },
    {
        "content": "[NAME] [SURNAME]"
    },
    {
        "content": "Mur Inti"
    },
    {
        "content": "Ghax habbiba tahha"
    },
    {
        "content": "11 il milljun Ghax hallsu ghal xjien ghax qalluhom li mamlu xjien Halsu inthom"
    },
    {
        "content": "Isma Hama Kiem jitfaw Hama Il louber dejjem kien the best ghal poplu"
    },
    {
        "content": "Minn qatella? Dr [SURNAME]"
    },
    {
        "content": "60 elf kielu it tiefel Issa hej"
    },
    {
        "content": "Hu mux hekk bravu Il qahba milli Kollha tieghek"
    },
    {
        "content": "[NAME], haga wahda ma nistax nifem... qed tghid lill [NAME] li dejjem listess mantra w int isaqsi dejjem listess mistoqsijiet. Meta ha nisimaw mistoqsijiet godda bhal, xinhi il pozizzjoni tieghu fuq il work/life balance ta vera w il-4 [SURNAME] work week? li fuq kollox ga qed jiprovaw ceru pajjizi. Ha nibdew nkunu ftit avant-garde jew?"
    },
    {
        "content": "Ek Moho labour Madoff... IVA labour. Labour."
    },
    {
        "content": "fiz zewg nahat hemm politikanti mhux daqsekk tajbin Dr [SURNAME]?"
    },
    {
        "content": "din li wiehed jamel kollox hazin u liehor kollox tajjeb ma tistax tibqa sejra hekk!! ghax il gvern jamel haga u tkun tajba mandux ghalfejn l opposizjjoni jghid li hazina! u jekk l opposizjoni jghid li tajba mhux il gvern jibqa jkaxkar li anke l opposizzjoni qablet! u vice versa! dal pajjiz baqa fil masma ta ifred u saltan!!"
    },
    {
        "content": "Proset [NAME]"
    },
    {
        "content": "Serrah Rasek Poplu Taaht Gvern Nazjonalita Ghax Tispicca L Korrozjoni 😂😅😅😅"
    },
    {
        "content": "Dan Jajat Bil Korrozjoni Tal Perit 5 snin Ma Jmurx Ghax Xoghol U Jiehu L Paga U Jiehu L Fjuil Bxejn Dik Mhix Korrozjoni U Dak Liehor ILu Ma Jidhol Ghax Xoghol U Jidikjara Li Qieghed Over Time U Jkun Imsifer U Jithallas Ta Xejn Dak Mhux SERQ B [SURNAME]"
    },
    {
        "content": "Ricki proset ta xol li qed tamel. Tista jek jogbok tistiden lil [NAME] busutil. Ragel onest ta vera u tohrog hafna verita minu."
    },
    {
        "content": "[NAME] you need to learn to listen and let the guest talk. We came to listen to the guest discuss his opinion and answer the questions you ask him not your lenghty opinion on everything."
    },
    {
        "content": "Parir: [NAME], ghandek bzonn thalli aktar il-mistieden jieħu nifs u jaħseb aktar. Mhux f'dan il-podcast biss, imma dan ninnutah ukoll meta nsegwi podcasts oħra. Taqta' ħafna minn dak li qed jgħid il-mistieden u minn ħsibijiet jew opinjonijiet tiegħu."
    },
    {
        "content": "issa tat taxxa 35% tinzel ghal 25% jghamililek il labour is sena id diehla qabel l elezzjoni!! yuppppp!!"
    },
    {
        "content": "Dan r ragel Genwin. Prosit u grazzi"
    },
    {
        "content": "Ma staqsejtux [NAME] fuq id dejn tal partit?"
    },
    {
        "content": "Imissek tisthi titkellem kif tkellimt dwar [NAME]. Illum nafu li [NAME] kellha ragun. Lill-dawk li ghajret jixraqilhom hafna iktar talli ghanlulna"
    },
    {
        "content": "[NAME] nahseb fin 1996 int 15 kellek Mhux qed niffhem kif ma ivvujtx lil PN biex ma nidhlux f eu u terga qabel kont tivvota l PN meta kont izhar min 15/16"
    },
    {
        "content": "Kemm int zbaljat fuq ir republika li ma jamlux character assassination fuq tal pn! Mela insejt kemm qalawlu lill [SURNAME]! Kisruh u farkuh u gelduh mall familjari tieghu!!"
    },
    {
        "content": "Anqas idea ta podcast politiku, dahna."
    },
    {
        "content": "Riky, I came across by chance a certain Mr [NAME] [SURNAME] who happens to be the director of the Encounter World religious cnetre giving lectures in Toronto, Canada about Daoism. Is he a relative or just a pure coincidence?"
    },
    {
        "content": "Mhux hekk mbad ahna tlabna fabrika u qalulna ma baqax art disponibli u int se tghati 100 tomna ghal 4 tigri. Pajjiz tal-[NAME] mouse."
    },
    {
        "content": "Pero nahseb ma jafx li lispar ilu maluq"
    },
    {
        "content": "Hawn certa bliet fmalta fejn issib hafna stray dogs iduru. U haga ohra; klieb fil kampanja iridu ikunu bic cinga ghax malta zghira. Dik tfisser li dejjem se issib in nies anka fl-aktar post remot"
    },
    {
        "content": "Idea tajba. Imma ma issirx. Art zghira ghaz-zwiemel ma sabux, ahseb u ara din l-art li qieghdin issemmu. Proset [NAME] imma difficli hafna tirrealizza din il holma."
    },
    {
        "content": "se jkunu fuq Spotify dawn?"
    },
    {
        "content": "Mela intqal li :- \"Ghandek kemm ghandek kobor xorta zghir \", u naqblu 100%. Mela ghalfejn ma jithallewx fil-miftuh in the 1st place? Just asking with [SURNAME] heart feelings ghax jien naffixina ruhi narhom u kull meta insifer dejjem fittixt fejn hemm \"Wild [SURNAME]\" u ma nfallix inzurhom. U xi naghjdu ghal dawk is sigar kolla li naraw fil-Wild parks ta barra u [NAME] l-annimali kolla ifittxu il-kenn ta sigra inkluz ghanka il-Hippopotamus li jhobb hafna is-shana."
    },
    {
        "content": "Bravu [NAME]"
    },
    {
        "content": "Naqbel mijak [NAME] proset"
    },
    {
        "content": "Interessanti hafna; It - tnejn tkellimtu b'sens kbir. Kellu bzonn johrog xi haga tajba minn din l - intervista. Biss sorry, kliem haz... ma jaghmilx gid qatt. Skuzi."
    },
    {
        "content": "How is this man qualified to work with exotic animals?"
    },
    {
        "content": "J'alla jsir dan l pjan ghax vera bzonn. Grazzi hafna vera interesting prosit tassew. Keep us updating fuq din l haga, please. Grazzi [NAME] u grazzi [NAME] 😊"
    },
    {
        "content": "lion plus tiger = liger iva tista tghammarhom. Saret kemm il darba imma jkunu sterile."
    },
    {
        "content": "Ma naqbilx ma xi Haga, IL pjan LI ngib pet trid tahseb ghal kollox, jekk ha jimradlek tista tipprovdilu?. Nafu LI l Vets U l expenses ma naqbilx LI bxejn U jidhol IL gvern biex ihallasli ghal pet ukoll"
    },
    {
        "content": "VRD - [URL] -Tal-Veterinarji"
    },
    {
        "content": "Bniedem dedikat u organizzat hafna, jien ghalija l isbah Zoo li ghandna f Malta, Proset [NAME], ([NAME] il Putu )"
    },
    {
        "content": "PROSET😊❤👍"
    },
    {
        "content": "Issa qed sewwa gagga"
    },
    {
        "content": "META TKUNU GEJJIN L-AWSTRALIA, IRRID NILTAQGHU, MAKHOM, GESU GHIX MAL MADELENA PROSTITUTT."
    },
    {
        "content": "[NAME] BIDWI JAF X'INHU XOGHL IMPORTANTI HAFNA FIL HAJJA,"
    },
    {
        "content": "Taqbel ma euthanasia?"
    },
    {
        "content": "Hi [NAME]... I follow you from melbourne... keep up the good work Can't [SURNAME] to hear you talk when you come to melbourne"
    },
    {
        "content": "Well done [NAME], imma l kotba ha tesporthom 😉"
    },
    {
        "content": "Hello from [NAME] [SURNAME], USA."
    },
    {
        "content": "Proset guys. U s sena t tajba"
    },
    {
        "content": "Is Sens komun sens ukoll e rick igifieri sippost normali 6 jkollna ghax issa ed jodduh mas sensi ghax ghaw. min mandux 😂"
    },
    {
        "content": "Hello [NAME], we are watching you from Australia. We can't [SURNAME] until we see you. God bless. 😂😊"
    },
    {
        "content": "Do you believe that before the End of the World takes Place, there [NAME] be 7 days and nights of total darkness, and 7 days and nights of light??"
    },
    {
        "content": "The people that got cremated, how are they can get recarnarated??"
    },
    {
        "content": "How can we access your books??"
    },
    {
        "content": "Looking forward to hopefully meet you in Melbourne Australia one [SURNAME], this is a great podcast."
    },
    {
        "content": "[URL]"
    },
    {
        "content": "When can I watch yesterday podcast pls??"
    },
    {
        "content": "1 at 00.00 on 7_1 24"
    },
    {
        "content": "kemm nixtieqek li vera kont taf kollox, specjalment kif jahdem il mic. taf kif gibtomli widnejja!!"
    },
    {
        "content": "Alla hares titla Metsola u issir prim ministru ta Malta ghax hemm vera nitlaq minn dal pajjiz."
    },
    {
        "content": "Dwar eutanazja, jien bhala bnidem adult ghandi dritt inehhi hajti?? Tahseb li jien nihu gost fili ragel narmi sahha mbghad ikoli accident u nigi iparalizat?"
    },
    {
        "content": "[NAME] keep up the good work."
    },
    {
        "content": "Barra EU"
    },
    {
        "content": "XInti tghid [NAME] hawn!? Spot On kien [NAME] u [NAME] bla argument..."
    },
    {
        "content": "Retain your editorial policy. Well done. [NAME] more structure/ research on the questions needed [NAME]."
    },
    {
        "content": "Dizaztru 25 Sena ima"
    },
    {
        "content": "Prosit [NAME], kont ġust u tajjeb bħal dejjem."
    },
    {
        "content": "☝"
    },
    {
        "content": "Ma Naqbilx Mieghek [NAME] Ma Tafx Bil Firem Foloz Ghaliex Hbew Lil Effinova Ma Gietx Tixet ISSA Dawn Li Serqu 11 IL Miljun Minn Fuq Dar IL POPLU ISSA Ma Jriedux Jigu Jixdu Hekk SEW U Minn Heba IL Laptop Ma Riedux Jinqabat Minn Ried Iwarraba U L Karroza Ghaliex Hallewa Barra U L Klieb Fejn Kienu? U L Monument Tal Poplu Mhux Tahhom"
    },
    {
        "content": "Nice one. Interessanti hafna kien dan."
    },
    {
        "content": "Prosit [NAME]!!"
    },
    {
        "content": "Fejn ta kull Podcast li ghamilt ghidlek prosit dan il podcast iddizappuntani ghax zammejt li issaqsieh hafna domandi bhal fuq Effimova, fuq il bank pilatus u hafna hafna affarijiet ohra."
    },
    {
        "content": "People are declared dead when their brain ceases to function, not their heart."
    },
    {
        "content": "\"il maggoranza tal maltin jaqblu li jaqblinna fl ewropa\"... kemm isir referendum u malajr naraw!!"
    },
    {
        "content": "I INHOB IMMUR ID -DANCING U IKUN ID-DJ BICCIET MINHOM IL-VOLIOM GHOLI NIGHILHOM ' PERO IMMUR NISFEN FEJN HEMM LIFE BANDU KOLLHA IKANTAW. FEJN IMMUR IL-MOONEE VALLY [NAME]"
    },
    {
        "content": "This language is like Arabic"
    },
    {
        "content": "[NAME], DJ huwa dak li kapaci jilabu bil vinyls Jew bi cdj's li anqas tkun taf li qeleb min diska Ghal ohra... Li kapaci juza 4 cd j's Jew bi 3 vinyls fdaqqa. Dak huwa DJ... L ohrajn huma disk jockey's li hija totalment differenti... L Haga... tnejn huma tajbin imma tnejn ma jmorrux flimkien... Nfatti qabel kien ikun hemm MC (jitkellem bil mic waqt l party)"
    },
    {
        "content": "Iggustajta hafna l-DJ [NAME] u vera li tidher kemm hi dedikata. Ghalkemm ma jolqotni xejn in-generu taghha, biss pero laqatni messagg hafna illi qalet, illi biex tiehu gost m'ghandekx bzonn tiehu imbarazz, tisma l-musika ukoll bizzejjed. Personalment jiena li nhobb hafna l-Progressive House, meta nisma l-musika inhossni ahjar dejjem u anke sahansitra b'sahhti iktar. Keep it up [NAME], Keep it up [NAME]. Awguri ghas-sena l-gdida... [NAME]"
    },
    {
        "content": "Hafna energy drinks perikoluzi, ftit jafuwa din, jistaw jikawzaw health issues gravi. Oqodu attenti."
    },
    {
        "content": "Kemm inthom helwin. Easy to say you were connected in previous lifetimes. Brothers, sisters, or husband and wife. Or one of you helped the other in a very bad situation. This is no regular friendship between you two. It goes beyond that. Thank you for such a lovely podcast"
    },
    {
        "content": "Proset tal Program imma dawn il riklami go nofs listampa ma niflahomx..."
    },
    {
        "content": "Prosit [NAME] keep it up"
    },
    {
        "content": "Proset [NAME]. [SURNAME] time no see imma xorta bqajt niffolowjak. Awguri [NAME]. ❤"
    },
    {
        "content": "Prosit kbira lil-[NAME] u lil-[NAME], l-energija u l-umilta taghkhom ammirevoli, ibqu sejrin hekk!! Grazzi ta' kollox!! ❤"
    },
    {
        "content": "Kem hu ragel umli u ta afari tijaw proset"
    },
    {
        "content": "Proset [NAME] laqwa podcast well done 👍"
    },
    {
        "content": "Excellent!!"
    },
    {
        "content": "Wiehed mil-aqwa nies li qatt leqqajtna maghhom [NAME]. Il-podcast tieghek kollha tajbin meta rajt [NAME] [SURNAME] bdejt nghid dan min huwa u nghidlek il veritia bdejt innizel narahx jew le imma nista nghidlek li kien wiehed mil-aqwa podcast li kellek. Kellu bzonn dan il-podcast rah xi hadt from high up ghax li nibdew indahlu mijuni kbar kull xaghar mhux cajta."
    },
    {
        "content": "dan il [NAME] hadem u stinka u sar sinjur bla ma seraq poplu shih!!"
    },
    {
        "content": "Diskussjoni interessanti U bniedem titghallem minnhu... Proset hafna 🤘"
    },
    {
        "content": "L industriji li qed jahdmu bic cheap labour mhux ser jaqblu mieghek li tarma settur u żarma iehor, anzi jekk ser izzid l attivita bhal expo center u lukanda, resort etc ikollok bzonn anke iktar haddiema. Pero naqbel li hemm bzonn li naraw x'setturi hemm haddiema biżżejjed jew izzejjed u nwaqqfu l permessi ta dawk."
    },
    {
        "content": "Il-problema hi meta art publika tingħata bix-xejn lil-miljunarji biex isiru biljunarji."
    },
    {
        "content": "Prosit [NAME] podcast tal gen keep it up"
    },
    {
        "content": "Kemm hawn nies kbar. Bniedem success barra l intelligenza li ghandu u fuq kollox ghandu l aqwa haga qalbu tajba. Minn qalbi nixtieqlek sahha u dak kollu li jgiblek il ferh. God bless you u prosit [NAME]. Dejjem insegwik"
    },
    {
        "content": "Bomba…. nkisru baħar iċ-ċagħaq ukoll"
    },
    {
        "content": "Dan hu l-veru talent Malti li ghandna nesportaw u nuzaw ghall-gid tal-pajjiz"
    },
    {
        "content": "Prosit [NAME]!"
    },
    {
        "content": "What a great [NAME], so down to earth, bless him and his family, all the best for 2025.happy Christmas to you all."
    },
    {
        "content": "Proset [NAME]. I admire [NAME] his ambition is great for Malta new building in Bahar ic-caqq also they should give him the Award too. ❤❤"
    },
    {
        "content": "Proset [NAME]. I admire [NAME] his ambition is great for Malta new building in Bahar ic-caqq also they should give him the Award too. ❤❤"
    },
    {
        "content": "Il haniena x'podcast dan prosit [NAME] u prosit il [NAME] u nawguralu success globali ikbar. Il-bniedem tant jaf xinhu jghamel li kull ma jmiss iggibu deheb."
    },
    {
        "content": "Defo can put up with three days of discomfort, he's a rare breed of a business man, because he shows empathy and humility."
    },
    {
        "content": "Grazzi [NAME] li kont straight u kkonfermat li Gvern Laburista qed jiftaħ widnejh ghas-suggerimenti tiegħek dwar kif l-ekonomija Maltija tista' tkompli tiffjorixxi bil-fieri/proġetti tiegħu. Nifhmuh u napprezzawh. Igawdi hu, u jgawdi pajjiżna miegħu. Għad irrid jinħoloq Ġieħ ġdid biex jagħmel ġustizzja ma' l-ambizzjonijiet ta' [NAME]. Grazzi lil [NAME] għal dawn it-tip ta' podati. Biex ngħid kollox, [NAME] kien fier ukoll ma' [NAME] [SURNAME]. Sur poplu Malti nagħtu palata li l-inizjattivi bħal dawn. Għamilna snin twal servili għal min ħakimha. Ejjew ninkoraggixxu lil wild Malta tagħna."
    },
    {
        "content": "Ragel kbir well done [NAME]"
    },
    {
        "content": "Tal genn. Proset [NAME]"
    },
    {
        "content": "Prosit ta vera!! L-aktar podcast interessanti li kellek Rick!! Kellhu bzonn jibqa sejjer hekk [NAME] u jkollna aktar nies bhalkhom, ghax tajtu hafna ideat biex pajjizna mhux biss iqum fuq saqajh imma jkun centru ta success fuq livell globali!! Grazzi mil-gdid 🙏 ❤"
    },
    {
        "content": "Amazing. Proset."
    },
    {
        "content": "I love this [NAME] he never give up and always believe of the potentials of other people I wish you well"
    },
    {
        "content": "li tinghalaq triq mod imma tehel malta mod ihor u vera mr [SURNAME] maghndux tort imma hemm bzonn jaraw xjaghmlu sew mhux jien stess rajt membri hergin mit taxis quddiem knisja tal marsa u bdew jimxu ghat tinda tal misthija"
    },
    {
        "content": "Grazzi [NAME] [SURNAME] ❤"
    },
    {
        "content": "L-iskop tal-Ħamas kien biex iparti priġunieri. L-iżrael għandhom 5,000 priġuniera ħafna minnhom tfal u qedin il-ħabs bla ma għaddew minn proċess il-qorti."
    },
    {
        "content": "Zbigniew Brzezinski, The Grand Chessboard. Trump u l-bqija tad-dinja kontra d-deep state, imperialista Amerikana qed jiġġieldu."
    },
    {
        "content": "Listess kumpanija americana li tmexxi l [SURNAME] min imniehira u li taghmel larmi u tbihom lin nato hija listess kumpanija li diga ghamlet kuntratt ma lukraina li wara l gwerra ha tirranga l pajjiz bid dejn... tista timmagina kif huma manipulati l affarijiet tal bizgha"
    },
    {
        "content": "Liktar jekk imhallsa mil kumpaniji il kbar ta larmamenti mezzola biex tkompli tkabrillom lincome... kollox jibda min kunpanija americana li tmexxi lil [SURNAME] min imnihira bhal barrin... trump ggalhekk riedu joqtluh ghax jitkellem kontra d deep state... kemm hemm xtispjega u kollox jaqad ma kollox..."
    },
    {
        "content": "Naqbel ma dak kollu li qal [NAME] [SURNAME]... il lum tant qed nikomplikaw laffarijiet li tlifna l common sense... biex nivvota jien bniedem bhal [SURNAME] jew xejn"
    },
    {
        "content": "Israel ghandhom Palantir warajhom, L akbar kumpanija tal AI u logistics mhux ovja massakru jghamlu..."
    },
    {
        "content": "E u issa Trump ha jatqalu iz zejza... mela l Ukraine qatt kellhom chance massakru ghamlu kollu tort ta leader imnejjek."
    },
    {
        "content": "Hija haga tajba hafna u bzonnjuza li gibt lis-Sur Dallibiex jispjega l affarijiet mill-punt di vista tieghu, pero nahseb li issa hemm bzonn ukoll li tistieden nies bhal [NAME] [SURNAME] u nies ohra li ssemmew u tistaqsihom fuq dak li qal [NAME] [SURNAME] halli jkollna n naha l ohra tal-munita u nevitaw li naqghu f'xi forom ta' bias. Mill-bqija, prosit!"
    },
    {
        "content": "Proset [NAME], għandek talent ħabib 🙌"
    },
    {
        "content": "Have been listening to [NAME] [SURNAME] and find it most interesting. He is very convincing, but why not confront him with [NAME] [SURNAME] who is outrightly calling him a crook on [NAME] [SURNAME] podcasts."
    },
    {
        "content": "J'alla ssir ġustizzja. It-[NAME] kollha li ssemmew juru kemm hawn nuqqas ta' ġustizzja. Jekk ma naħdmux biex ikun ġustizzja, nkunu qed inħallu it-tbatija tirrenja. Illum saret inġustizzja mal-Hon [SURNAME] u għada issir miegħi jew ma wliedi. Illum saret inġustizzja mal-Palestina u għada ssir ma Malta."
    },
    {
        "content": "Ghamel wahda ma JohnRizzo [NAME] issa, halli inkunu nistaw nisimaw il verzjoni tijaw ukoll. Grazzi u proset bhal dejjem!"
    },
    {
        "content": "bravu [NAME]"
    },
    {
        "content": "Ħadt gost nisma' u nitghallem. Ma stajtx naqbel f'kollox, imma f'podcasts bħal dawn, [NAME] n-naħa l-oħra tal-munita, minn lenti assolutament differenti mil-Lat partiġġjan kif stajt ħarist lejn kif svolgiet il-pulitika Maltija mit-tieni gwerra 'l hawn. Fehmiet [NAME] lejn dak li joffru ż-żewġ partiti fil-Parlament illum, mhux każ li tgħaġġel u tgħid hu fazul. L-apatija lejn il-pulitika tal-lum miż-żewġ partiti l-kbar tidher li tista' tirrifletti ruħha fl--elezzjonijiet ġenerali li jmiss. Persunalment, diment li l-Mulej jislifni l-għomor, diffiċli niċħad it-twemmin Laburista, imma żgur li nara li bil-vot tiegħi nnaqqi s-sikrana mill--qamħa."
    },
    {
        "content": "Jiena ahbarjiet tal gwerra ma narhomx"
    },
    {
        "content": "funny"
    },
    {
        "content": "Regward it transport dejjem hekk ghedt jien, mdawrin bil bahar u ma nuzawhx, Plus jizdied is xol, Naqbel 100%"
    },
    {
        "content": "Malta"
    },
    {
        "content": "Hasra li tliefnieh, il-media generali tqajjem hafna dubji fuqu, imbaghad [NAME] dan il podcast u terga back to square one jekk hux frame ups kienu jew vera kienx mdahhal f'xi haga..."
    },
    {
        "content": "Thobu jew tobodu da ragel ta fej qijet mijaw jek jejt ha jtik 100 ha jtijilek u jek jajdlek ha johodilek ha johoda"
    },
    {
        "content": "[NAME], diga hemm ligi kontra min jaghmel rapport falz mal pulizija, kontra l kalunja, artiklu 101 tal-kodici kriminali u ghal min jixhed b'mod falz, ghandek il ligi tal 'perjury'. Ahjar flok inzidu l ligijiet naghmlu mezz ansi fejn ikollna izjed liberta' tal-espressjoni. Nimxu 'l quddiem irridu bid-drittijiet mhux pass lura, x'tahseb?"
    },
    {
        "content": "King"
    },
    {
        "content": "Awguri mil Kanada, prosit Rick!"
    },
    {
        "content": "Kellek ilsienek fit toqba ta sormu [NAME]. Kemm stajt taqlalu aktar hara jahasra."
    },
    {
        "content": "Lil Dr [SURNAME] nemmuh imma lil PN Qatt ma nemnuh zgur iz zmien itina parrir [SURNAME] and see."
    },
    {
        "content": "Proset [NAME]."
    },
    {
        "content": "DR [SURNAME] QAT MINSEWK❤"
    },
    {
        "content": "Bis sincerita w l hlewwa ta kliemek irbaghttni mieghek ghal dejjem."
    },
    {
        "content": "Bhalek hadd u qatt [NAME] ❤"
    },
    {
        "content": "Grazzi Rick u grazzi kbira lil [NAME] al dejjem ❤"
    },
    {
        "content": "Opinion"
    },
    {
        "content": "jien bhala laburist u illum inhossni orfni tal politika mit tluq ta JM nixtirq iktar kjarezza fuq li storja ta Jorgen [SURNAME]..."
    },
    {
        "content": "Qal li ma jistax jiehu passi fuq it-tnejn l-ohra ([NAME] u Kieth) ghax lilu kienu qed icapsuhom mieghhom. Jigifieri li dan ghadu jrid jikkonvincina li [NAME] [SURNAME] u [NAME] [SURNAME] ma kellhomx kontijiet fil-Panama, [NAME] ma kienx imcappas fuq tal Vitals, 17 black, tal-Montenegro jew ma kienux imcapsin f'korruzzjoni? Kemm qed jahseb li l-poplu cuc. U jekk kien jaf b'korruzzjoni ghalfejn baqa jzommhom. Lil [NAME] anke il-PL keccuh. U ejja hallina, u mela ghalfejn irrezenja hu jekk ma kellux x'jahbi? Issa jien kont nadurah lil dan, imma issa trid tkun vera imbeccili biex tkompli temnu. Din kollha PR minhabba l-kawsa li ghaddej minnha."
    },
    {
        "content": "[NAME] da ragel ha jkun [NAME] record iehor fil podcast tiek ta kemm rawh nies"
    },
    {
        "content": "Mla. Ejja❤"
    },
    {
        "content": "Ejja Lura irriduk Lura ❤️"
    },
    {
        "content": "Hallejtna ❤"
    },
    {
        "content": "❤❤❤"
    },
    {
        "content": "Il-problema tal bini mhux li tgholli izda il-mod li jibnu bla sens ta' rispett lejn l istorja Maltija, KRUHA ta bini li kerhu lil Malta. Tgholli mela le imma hemm mod u mod ta kif tibni"
    },
    {
        "content": "Bniedem umli u fiz zmien li kien Prim Ministru tibghatlu fuq problema serja u concern tieghek personali u iwiegbek huwwa stess. Dak kien bhala Prim Ministru."
    },
    {
        "content": "Li kieku ma kienx ghal ghaqal tat tmexxija ta Dr [NAME] [SURNAME] kieku fi zmien il Covid batejna il guh."
    },
    {
        "content": "Kont wisq soft mieghu [NAME]. [NAME] ilqa' l isfida ta podcast ma [NAME] [SURNAME]"
    },
    {
        "content": "Kif qed jirnexxilek temmen dan il gideb kollu.!! [USER]"
    },
    {
        "content": "[NAME] il-partit għandu bżonnok. Irriduk, irriduk"
    },
    {
        "content": "Bring him back Malta needs him."
    },
    {
        "content": "The EU set you up, you are a threat to them and too [SURNAME] for them"
    },
    {
        "content": "Bniedem kbir wisq proset Dr [NAME] [SURNAME] u proset [NAME]"
    },
    {
        "content": "[NAME] tidher bic [SURNAME] li iddispjacik li qatt ma vvutajt lil Grande [NAME] u tixtieq opportunita ohra biex tivvutalu!!"
    },
    {
        "content": "Dr. [SURNAME] brings Malta the best country in EU a humble person in the Labour party thank you [NAME] we love you as much as you love Malta"
    },
    {
        "content": "Proset. Dawn it-tip ta intervisti ghandom ikunu xihaga mandatorja ghal KULL politikant."
    },
    {
        "content": "Nofs l appartamenti li hawn huma vojta. Plus li prezzijiet moghla s smewwiet. Il kostruzzjoni li hawn hi bla razen u bla estetika u bla rispett lejn il wirt nazzjonali."
    },
    {
        "content": "❤❤"
    },
    {
        "content": "❤❤"
    },
    {
        "content": "Grazzi [NAME] Tal Gid❤️"
    },
    {
        "content": "Prosit [NAME] the best. Thanks. It tielet darba li qed narah"
    },
    {
        "content": "Grazzi [NAME] ta dan il. programm. [NAME] fqalbna ghal dejjem"
    },
    {
        "content": "My King"
    },
    {
        "content": "Grazzi Dr. [SURNAME] ta dak li ghamilt ghal Malta u l-Maltin God bless you and your familja."
    },
    {
        "content": "Aaahhh ostja xi pjecirrrr kemm ghat iridu jifgaw fdemom dawk lhara... ❤jm❤"
    },
    {
        "content": "Proset both, min ghand wiehed li ma jarax programm imġiddem bil malti imma spiccajt rajt l intervista kollha. Naqbel ma [NAME] f kull kelma specjalment li m hawnx politiku li jibda ma [NAME]…... 2nd chance ghal kulhadd u nahseb [NAME] din id darba jivvota 😂😂. Nsomma podcast bis sens"
    },
    {
        "content": "GHAZIZ [NAME] [SURNAME] KEMM INTI KBIR IL PARTIT LABURISTA GHANDU BZONNOK MALTA GHANDA BZONNOK GOD BLESS YOU AND YOUR FAMILY ALWAYS ❤❤❤"
    },
    {
        "content": "Jien ghalija [NAME] dahhal nazzjonalist u hareg laburist. Kulhadd irrid jammeti li [NAME] politikant kbir."
    },
    {
        "content": "JM the one and only, your seat is still waiting"
    },
    {
        "content": "Bhal dejjem jaf xi jghid [NAME] li ghadu mahbub minn hafna."
    },
    {
        "content": "Lil Dr. [NAME] [SURNAME], dejjem segwejtu fil meetings vera jaf jitkellem u ghamel lgid.. gawdejna bis sahha tieghu fi zmien cv19,u dan kulhadd jafu ma nafx ilala hawn nies li jwegghuh. 🎉😊. Grazzi Dr. [NAME] [SURNAME] jalla lverita tohrog fuq dak kollu li ntqal hazin fuqek. Bravu hafna... ma jlehqukx mieghek dawk li jridulek deni tghatix kashom. Il verita tohrog.?"
    },
    {
        "content": "One of the best interviews ever!"
    },
    {
        "content": "XI GMIEL TA INTERVISTA PROSET"
    },
    {
        "content": "top-notch interview, proset [NAME] u grazzi. Viva [NAME] insomma!, no other words... Iz-zmien itih ragun <3"
    },
    {
        "content": "His leadership wasn't without flaws, but we should all be grateful to the Labour Party, [NAME], and his dedicated team of ministers for putting Malta on the upward trajectory it truly deserves. Their focus on the middle and working class has brought significant progress in areas like the rule of [SURNAME], infrastructure, roads, social rights and benefits, affordable utility bills, education, and public transport. And let's not forget the unprecedented growth of the economy— in just 8 years truly a legacy to remember. ❤"
    },
    {
        "content": "Dak iz zmien ekonomia kienet idur fuq [SURNAME] kwadra bli skossi"
    },
    {
        "content": "A great man and the best prime minister ever always in our hearts ❤"
    },
    {
        "content": "proset [NAME] luniku politikant li nihu gost nisima"
    },
    {
        "content": "Full up xa haga ta. Kemm kienu ahjar l-antiki."
    },
    {
        "content": "Pero tal linja dizastru ta mitluqa telqa. Intejjen seba pesti karozza full up u full up ta. z"
    },
    {
        "content": "Prosit [NAME] u [NAME]"
    },
    {
        "content": "Intervista ma bniedem li fadlinna bix naraw intrliġenti bhalu ❤"
    },
    {
        "content": "Never defeated!"
    },
    {
        "content": "Kbir wisq. M hemm l ebda politiku li jaf jitkellem bhalu, li jaf jispjega, li ghadu sallum jhoss il polz tac citttadin komuni. Dan il pajjiz nies b vizjoni u nies b energija jridt u mhux individwi li jidhlu ghal politika ghax mhux kapaci jinbnew minghajr pompa."
    },
    {
        "content": "Prosit, Great Podcast ♥♥"
    },
    {
        "content": "proset [NAME] bniedem tihu gost tisimek u proset l prezentatur ax mexxa l program tajjeb"
    },
    {
        "content": "❤"
    },
    {
        "content": "Grazzi [NAME], grazzi [NAME] [SURNAME] inti bravu wisq u throbb in nazzjon Malti, u l poplu multi ghandu jkun grad lejk dejjem konna fqar u issa qed nghixu hajja hafna hafna ahjar Grazzi."
    },
    {
        "content": "Proset, Top JM INVICTUS ❤❤"
    },
    {
        "content": "Kummenti possitivi kullimkien, dan iffisser li n-nazzjon qed jerga jsejjahlek"
    },
    {
        "content": "You've made us PROUD THANKYOU [NAME] ❤"
    },
    {
        "content": "Jien nahseb l ahjar itella 10 sulari u l area ma tizdiedx taht l ebda kundizzjoni."
    },
    {
        "content": "[NAME]: your solution regarding reallocation of \"asleep on the job\" govt employees to the private sector is valid! 🎉"
    },
    {
        "content": "Proset tal intervista lir [NAME] u specjalment lil [NAME] li wera li hu l ikbar politiku li kien hawn ghax juri il fatti."
    },
    {
        "content": "❤❤❤"
    },
    {
        "content": "You shot your self in the foot [NAME]. As you [SURNAME], you [NAME] not have a warrant, but that doesn't mean you're not capable of installing electricity perfectly. The mere fact that you do not have a warrant does notmean your installation is bad In the same way the fact that that accountant has no warrant does not mean that she's not capable. the only thing that can test so her capability is had past achievements."
    },
    {
        "content": "Best Maltese podcast channel!"
    },
    {
        "content": "😂😂😂watching and laughing when [NAME] talk you listen 😅👍👍👍"
    },
    {
        "content": "The Best person to talk to Met him in Canada 🇨🇦 at the Malta Band Club Mr And Mrs Joesph [SURNAME] and their Adorable Twins viva Il Labour Viva [NAME] [SURNAME] 🙏❤️"
    },
    {
        "content": "Keep it up the good work [NAME], excellent interview"
    },
    {
        "content": "Fl-intervista li s-Sur [NAME] [SURNAME] ghamel lil [NAME] [SURNAME], nixtieq nikkummenta li wara meta [NAME] [SURNAME] ghamel l-argument tal-impunita, JM qal li l-Imhallef mhux xi Alla! Imma jien nghid li \"normalment\" f'demokrazija, is-sentenza tal-Imhallef tkun irrispettata u esegwita. Mur ghid hekk lil dawk li tressqu l-Qorti b'xi akkuza u issa qieghdin jiskontaw sentenza fil-habs!"
    },
    {
        "content": "The best Kenn inhobbok jiena Dr [NAME] [SURNAME] xxxx"
    },
    {
        "content": "Politiku kbir dejjem f qalbna 🔴🔴🔴🔴❤️"
    },
    {
        "content": "Dr [SURNAME], laburist u Milanist kbir..."
    },
    {
        "content": "The best Prime minister Malta ever had ❤"
    },
    {
        "content": "Dak li qed tghid suppost taf min gab il mibeda f'malta u dan ilu mis nofs is snin 80's min avversarju partikollari illi min ma' jaqbilx mieghu u maghhom koiemu kien salbu etc"
    },
    {
        "content": "The best ❤ Kemm hu ragel humli 🩷 Grazzi [NAME] Podcast ta vera..."
    },
    {
        "content": "Dejjem tibqa f'qalbna!! ❤❤❤"
    },
    {
        "content": "Program fu. [NAME]. Imel dik il Bomba... fu dik milun taxxa?. U dak il gab Droga kweros"
    },
    {
        "content": "Ek mohom nies Fu dak u lihor. ima tahom hadd ma jafom. We'll done. J. m"
    },
    {
        "content": "Keep it up! ghandna bzonn iktar nies bhalek [NAME]! Intervista bellezza!"
    },
    {
        "content": "Vera togħġobni kif titkellem. Fuq tal-over population, imma, ma qbiltx miegħek. Mhux kull min jitwieled ikompli l-iskola post-sekondarja. L-NSO ħarġet statistika li bejn 2022 u 2023, 77% tal istudenti komplew l-edukazzjoni tagħhom post sekondarja. Jiġifieri it-23% l-oħra probabbli qed ifittxu impjieg kwalunkwe mingħajr kwalifiki."
    },
    {
        "content": "Proset vera hadna gost nisimaw lilek u lil Dr [NAME] [SURNAME]. God bless you JM"
    },
    {
        "content": "Prosit [NAME], u prosit kbira l Dr [SURNAME] li tkellem b moghod dirett u skjett."
    },
    {
        "content": "Sammarni [NAME]. Prosit [NAME]... u Grazzi [NAME]!"
    },
    {
        "content": "Proset [NAME] & Dr [NAME] Well done enjoy watching. From Melbourne ❤️🌷"
    },
    {
        "content": "Bravu wisq. Grazzi [NAME] [SURNAME]. ta kull ma ghamilt. ❤️"
    },
    {
        "content": "The One and Only [NAME] [SURNAME] 👍"
    },
    {
        "content": "KBIR WISQ KING INVICTUS JM ❤️"
    },
    {
        "content": "Prosit [NAME] u prosit kbira l [NAME] ❤"
    },
    {
        "content": "Baqa l-istess, inkabbru l-ekonomija akkost ta kollox, nimlew Malta bic-cheap labour"
    },
    {
        "content": "Dr. [SURNAME], ha tibqa mfakkar bħala dak il- bniedem li bdilt lil Malta għal aħjar. L-ammont ta' drittijiet, tiġdid, wegħediet u inizzjat=ttivi li ħadu l- gvernijiet tiegħek se jibqgħu mfakkra. Malta għad għandha bżonnok."
    },
    {
        "content": "Proset [NAME] ta dan il prodcast Grazzi [NAME] tal gid kollu li ghamilt. dejjem fqalbna❤"
    },
    {
        "content": "L King Dak"
    },
    {
        "content": "Dr [NAME] [SURNAME] the one and the only now Dr [NAME] [SURNAME] is our prime minister of malta and we are greatly for his work congratulations 🎊 👏"
    },
    {
        "content": "Proset hafna tassew ghamilt saghtejn u nofs nismakom u na ddejaqtx nismakom kien hemm affarijiet bhal din tat traffiku u tal baranin li qabel dejjem kont ingerger imma llum fuq din lil [NAME] [SURNAME] ntih ragun well done"
    },
    {
        "content": "Tista' ma taqbilx miegħu politikament imma nemmen li kien politiku kbir bit-tajjeb u l-ħażin kollu tiegħu. Naqbel ma' [NAME] li wieħed m'għandux jagħti titli sakemm ma joħroġx il-verdett finali tal-qorti. Interessanti l-lat uman tal-politiku - ħafna drabi wieħed jattakka jew ifaħħar lilċ-politiku mingħajr ma japprezza l-lat uman ta' dik il-persuna. Podkast interessanti bħas-soltu [NAME]."
    },
    {
        "content": "Kbir Wisq <3"
    },
    {
        "content": "- [SURNAME] seems to suggest that [NAME] was assassinated because she was criticising PN filth... NO - [NAME] was murdered after she had exposed the rot and criminal activity within [SURNAME]'s government. She was murdered when she was about to expose a corrupt deal that was designed to make Labour party backers, Cabinet members and advisers very rich. [SURNAME] also used clumsy language (though pretty sure this is deliberate) - when saying that [NAME]'s murder - 'lili taghtni d-daqqa tal-mewt'... this about a woman who was blown up metres away from her home, because she was exposing organised crime that has infiltrated the Labour Party and the government he led. The man has no credibility - he is distorting facts and is lying. Maybe you should have asked: Why precisely did [SURNAME] resign? Maybe he can provide an answer that goes beyond - 'jiena hallast l-ghola prezz politiku',"
    },
    {
        "content": "Prosit ta l intervista [NAME] u prosit Dr [SURNAME]"
    },
    {
        "content": "Great podcast! ❤ It's so refreshing to hear you speak again. I really [NAME] you consider returning to politics—you bring such a sensible and thoughtful perspectives"
    },
    {
        "content": "Prosit hafna dr [SURNAME] ta kif spjegajt is sitwazzjoni tal barranin"
    },
    {
        "content": "Ahna ghaddejna minnha 6 ys ago, tal miss carriage u hekk poggewna go sala fejn kienu jew ha jwelldu jew welldu"
    },
    {
        "content": "Prosit, it tnejn, pero [NAME] Jed Dr [SURNAME],"
    },
    {
        "content": "❤ [NAME] ❤"
    },
    {
        "content": "Prosit [NAME] u prosit [NAME] ❤"
    },
    {
        "content": "Prosit [NAME], ta dawn il podcasts li qed tibghatilna."
    },
    {
        "content": "Top mawx ❤❤❤❤"
    },
    {
        "content": "Wisq kbir mahbub taghna [NAME] [SURNAME] ❤️"
    },
    {
        "content": "Proset tal intervista, ma tixba qatt tisma lil king❤❤bhalu hadd u qatt"
    },
    {
        "content": "Grande"
    },
    {
        "content": "Grazzi [NAME] ta' dan il programm. Grazzi [NAME] għaliex lil familja tagħna qedgha tgawdi id -drittijiet li hadd ieħor injora ❤"
    },
    {
        "content": "Prosit kemm lil [NAME] u wkoll lil [NAME] għal din il-podcast. [NAME] bħala Laburist grazzi li għollejtli l-moral f'dan iż-żmien kritiku ghall-Partit u ntenni miegħek li \"r-rebha tagħna terga' tkun\", vers ta' l_innu tal-Partit."
    },
    {
        "content": "Forever the King! God Bless [NAME] xx"
    },
    {
        "content": "❤❤"
    },
    {
        "content": "Great podcast - well done [NAME]."
    },
    {
        "content": "KBIR WISQ DAN IR RAGEL ❤❤❤"
    },
    {
        "content": "Proset [NAME], ghalkemm ma naqbilx ma [NAME] [SURNAME] din ghalija kienet l'aqwa podcast li rajt. Jider li kien onest fi kliemu. Il verita nispera li tohrog ikun xi ikun ir rizultat."
    },
    {
        "content": "Prosit [NAME]. [NAME] int INVICTUS veru ragel honest."
    },
    {
        "content": "Malta ma tistax taffordja li titlef bniedem bhal dan. Jekk jigi lura u jahdem fuq il land reclamation, il problemi li johloq listess progress - regress, jigu solvuti. Grazzi [NAME] u Dr. [SURNAME]"
    },
    {
        "content": "Helu wisq [NAME]"
    },
    {
        "content": "DR [NAME] [SURNAME] LIL MARA MRS [NAME] [SURNAME] NGHEJDILA SEW TAGHMEL JEKK TAGHMEL LI IKTAR MA JGHAMLULA HI IKTAR TAGHMILLHOM"
    },
    {
        "content": "Well done u thank you"
    },
    {
        "content": "Viva l invictus dejjem f'qalbi grazzi [NAME]"
    },
    {
        "content": "Great Interview and well done [NAME]"
    },
    {
        "content": "Proset [NAME]"
    },
    {
        "content": "Kif sammartni nissimak. Proset."
    },
    {
        "content": "Prosit tassew."
    },
    {
        "content": "Proset"
    },
    {
        "content": "Ma tixba qatt tisimghu, isammrek, titpaxxa, kbir wisq. Prosit [NAME] tal-genwinita tal-podcast."
    },
    {
        "content": "Pjan huwa jigi lura qabel ikun tard wisq"
    },
    {
        "content": "Dejjem f'qalbna"
    },
    {
        "content": "Proset [NAME] [SURNAME]."
    },
    {
        "content": "Kahhaltni mal mob ragel kbir"
    },
    {
        "content": "❤❤❤Il king u grazzy [NAME] ta din l intervista mal Mahbubb [NAME] [SURNAME] u grazzi eks Prim lil gejt ghal dil intervista GOD BLESS you both and your families❤❤❤"
    },
    {
        "content": "AJMA [NAME] KEMM IDDAHAKNI TITHOLLU HELU HELU FUQ JEKK HUX DIEHEL GHAL PULITIKA JEKK JOHROG HIELES!"
    },
    {
        "content": "grazzi ta kull ma ghamilt ghal Malta taghna ♥️🇲🇹♥️"
    },
    {
        "content": "Int ma ghamiltx taxxa [NAME] iva(taxxa bil pulit)"
    },
    {
        "content": "Invictus ❤️❤️❤️❤️"
    },
    {
        "content": "❤❤"
    },
    {
        "content": "❤❤"
    },
    {
        "content": "il king tal podcast ghalija"
    },
    {
        "content": "Dejjem warajk ❤"
    },
    {
        "content": "❤"
    },
    {
        "content": "INVICTUS ❤🎉"
    },
    {
        "content": "waithing for [NAME] to come back ❤❤❤"
    },
    {
        "content": "Il king ta malta [NAME] int"
    },
    {
        "content": "god bless [NAME]"
    },
    {
        "content": "thr king"
    },
    {
        "content": "Ma nixbax nisimghek titkellem Dr. [SURNAME] Grazzi [NAME] li ghamilt dan il Podcast 👏🏻👏🏻👏🏻"
    },
    {
        "content": "❤❤❤"
    },
    {
        "content": "Inbobbu wisq❤❤❤❤❤❤❤❤❤❤ blessed"
    },
    {
        "content": "[NAME] [SURNAME] kien il king, ghadu king u jibqa king. Grazzi [NAME] ta kull ma ghamilt mieghi. jien nibqa warajk sakemm immut."
    },
    {
        "content": "Ghadna u nibqaw inhobbuH ❤"
    },
    {
        "content": "❤"
    },
    {
        "content": "I'll never stop hearing Dr [SURNAME] as he always says the truth. He turn politics to the better but as always you can always find your opponent that tries to break and dismantle you good. Im always behind you at all cost"
    },
    {
        "content": "IAM Watching [NAME] IS Onest Person He Is INVICTUS Thank You For This Program"
    },
    {
        "content": "King of kings"
    },
    {
        "content": "🤩🥰🤩🥰"
    },
    {
        "content": "King of kings"
    },
    {
        "content": "❤"
    },
    {
        "content": "INVICTUS ❤"
    },
    {
        "content": "Simply d best"
    },
    {
        "content": "Watching you king"
    },
    {
        "content": "Popcorn 🍿"
    },
    {
        "content": "King"
    },
    {
        "content": "I'm looking forward for This podcast amazing men"
    },
    {
        "content": "Kif ha nissamar il lejla hi biex nismakhom god bless you both xxx"
    },
    {
        "content": "Proset [NAME] 👍"
    },
    {
        "content": "Kem int bravu meta in mutual fejn ha more, graze"
    },
    {
        "content": "Bravu immens, narakom l Awsralija God willing."
    },
    {
        "content": "Għeluq stupend f'podcast li faqaghli mohhi, imma b'mod bilanċjat wera diversi angoli tal-ħajja, pulitika, u familja gewwa pajjiżna u madwarna. Prosit għal dil-maratona"
    },
    {
        "content": "Prosit [NAME] tal-programm. Prosit u grazzi [NAME] ta' kull m'ghamilt ghal Malta. God bless you."
    },
    {
        "content": "Il king ❤"
    },
    {
        "content": "Kemm hi lucky il familja li anda lilek king inhobuk hafna [NAME]"
    },
    {
        "content": "Punt rigward l isptar… sptar ghandna St Lukes. Issir referbishment go fih u tifthu u tuzah u b hekk innaqsu l waiting list u queues kbar fl emergenza. U nahseb li jekk il policlinics ikollna iktar minnhom 24/7 ahjar ukoll ghax jghin l emergenza ma tkunx iballata bin nies"
    },
    {
        "content": "Prosit [NAME], podcast interessanti hafna"
    },
    {
        "content": "Programm tajjeb, li ma qbiltx hija li kulhadd irid ipengi lir ragel biss il hazin u f kollox u nassigurak li nisa hziena hawn ukoll ghax garrabt u naf x qed nghidlek... il kuntratt li semmejt tat tfal irid jigi ffirmat min 2 nahat ghax it tfal tat tnejn mhux tal missier biss fejn jaqblila s sistema ul ligi, il bqija jigi stmat ta numru biss u kollox jingibed lejn il mara dik mhux sew."
    },
    {
        "content": "Igifiri issa jmiss l era tar robots u ai?"
    },
    {
        "content": "'Jiena bniedem qatt ma ridt nidher u qatt ma ridt il-fama! ' LOL! Imma hawn jien liebes gakketta ma tistax ma tarahiex u naghmel podcasts kull gimgha!"
    },
    {
        "content": "Vera niehu gost nisma lil [NAME]!"
    },
    {
        "content": "❤❤❤"
    },
    {
        "content": "Prosit tassew interessanti mmens 💯"
    },
    {
        "content": "Proset [NAME] vera podcast biss sens u interessanti u kellek interviewer bomba wkoll. Messkom taghmlu aktar podcasts flimkien."
    },
    {
        "content": "Bravu. Hadt gost nisimak. Parir wiehed ipprova irranga naqra id diction u pronunzja tal kliem inglizi bhal nomad, security Pisces etc"
    },
    {
        "content": "Jek taqdu partit kof semejt imma minajr [SURNAME] nivutalkom zgur. Jek jithol dak od dar jibqa"
    },
    {
        "content": "Jiena ghalhekk dejjem nghejd li Alla ma kellu ebda religjon... ir religjonijiet il bniedem holoqhom... ghalhekk jiena ma nemmen f'ebda religion..."
    },
    {
        "content": "Join the club... hawn xi hadd bhali..."
    },
    {
        "content": "Tiftakru meta kellu il \"white line\" ghax [NAME] min hemm beda..."
    },
    {
        "content": "Kelma wahda ghal Biden pupazz u babbu... imma safratant lil ibnu tah pardon..."
    },
    {
        "content": "[NAME] L King ❤"
    },
    {
        "content": "the maltese [NAME] [NAME]"
    },
    {
        "content": "[NAME], persuna qrib tieghi qaltli biex nistaqsik ilala l-[NAME] [SURNAME] ma staqsejtux il-mistoqsijiet li suppost kellek issaqsieh cioe ta skanska. Mill-bqija proset tal-programm, ma nitlifx wiehed."
    },
    {
        "content": "Il bniedem ma gharafx kif izomm bilanc fil produzzjoni ta bniedem. Tort ta certu reigjonijiet li kienu jheggu il familji biex waqt l att sesswali dejjem jippruvaw ghat tfal. Issa wara li l bniedem induna li ir risorsi tad dinja qed jisparixxu, min jikkmanda NWO jinholqu gwerer, u certu mard ikel raffinat u mezzi ohrajn biex jippruvaw inaqqsu l popolazzjoni."
    },
    {
        "content": "[NAME] lol"
    },
    {
        "content": "Prosit [NAME]! kemm titkellem sew"
    },
    {
        "content": "Bis sens man, ibqa sejjer hekk"
    },
    {
        "content": "[NAME] [SURNAME] hemm xi cans narawk bhala kandidat mal-Partit Nazzjonalista?"
    },
    {
        "content": "Prosit [NAME] [NAME], mhux ghal dan il-podcast biss, imma ghal kull ma taghmel ghal pajjizna. Tispira hafna fiducja ghall-futur li se jghixu uliedna u ta' warajhom."
    },
    {
        "content": "[NAME] semmi min jkun kapaci mill-Labour flok il-prim ministru li ghamdna pls."
    },
    {
        "content": "Podcast interessanti iehor. Keep it up [NAME]. J. P."
    },
    {
        "content": "Proset [NAME], niehu gost insegwi l-potcast tieghek, dejjem interessanti jkunu u bis sens. Hasra li kont tant fil qrib biex tistaqsi l [NAME] ir-raguni vera ghaliex gara li gara meta [NAME] [SURNAME] gie imwarrab minn kap. Keep it up king"
    },
    {
        "content": "Ma nafx kif qed tghid li Toroq tal gheliq sarum kollha ta Ahna bdiewa I'mtahleb u trie qiesek qied fil gwerra wara attack 😢😢"
    },
    {
        "content": "Il-PN irid izomm f'mohhu li f-elezzjonijiet tal-MEPs kien hemm l-effett Metsola li immobilitat in-nies"
    },
    {
        "content": "[NAME] vera prosit, hemm bzonn ta podcasts hekk!"
    },
    {
        "content": "[NAME] [NAME] [SURNAME] jghidilna li forsi l-poplu ghandu bzonn iktar zmien biex jassorbi l-kuncett tal-Kap attwali tal-PN, erba snin wara l-hatra tieghu. Li naqas li jghid kien li kien wiehed mil-percimesijiet li gabru petizzjoni kontra [NAME] [SURNAME] sentejn biss wara l-hatra tieghu. Allura nghid jien - Dakinhar ghaliex ma tax cans lill-poplu jassorbi? Ghaliex is-surveys dak iz-zmien kienu vangelu ghalih u llum mhumiex issue li fuqu jinbidel kap ta' partit? Et tu brute..."
    },
    {
        "content": "Prosit [NAME], Zaghzugh Malti ta fibra u onest."
    },
    {
        "content": "[NAME] bniedem honest nafu seww. kemm nixtieq li il politikanti kienu bhalu kiku mohhna ikun mistrih."
    },
    {
        "content": "iva iz zewg partiti L ISTESS it tnejn li intom kellkom skandli u stejjer ta korruzjoni, forsi mhux int personali (s'issa) imma id dinosawri li ghandkom iva!"
    },
    {
        "content": "Ma tistax tqabbel il leaders jew l partiti skont l popolarita ghax il Labour party ghandu iktar vuci b sahhita anki waqt l ahbariet"
    },
    {
        "content": "Correction zaghjra. Fuq x'kien qal [NAME] [SURNAME] fl'intervista ta Times gimgha qabel l'ellezzjoni ghandu ragun [NAME] Anthnoy [SURNAME]. Kif qal [NAME] kien qal [NAME]. Ghandek ragun [NAME]."
    },
    {
        "content": "The number of votes does not devalue what [NAME] is saying however today everything has become an industry vulnerable to likes and votes including democracy. It's a pity because [NAME] has mentioned a few important attributes which are missing from today's educational system although I cannot comment much about the rest. [NAME], on the other hand, is not wrong because unfortunately the number of votes represents credibility for the layman. On a last note [NAME]'s influence was not a cause of the Jewish popular vote but more on value."
    },
    {
        "content": "Conspiracy theories galore!! 😅 dan xi jkun!? Ihobb lill-pajjizu u jghid li Malta mhux pajjiz, malta bicca blata!!"
    },
    {
        "content": "[NAME] PATRIOTT TA VERA"
    },
    {
        "content": "Dan fejn sibtu kif gibtu tintervistah, kemm thossok li hlejt hin [NAME] kun onest??"
    },
    {
        "content": "Mr Salamone jidher li huwa bniedem ta gherf u ghandu punti validi, izda fejn jithlu 'proposti' kwazi ma semma xejn, allura kif ha jigbor voti? Ahna proposti rridu u mhux x'taghmel, ghax tista tghid taghmel hafna affarijiet, izda kif ha timplimenta..."
    },
    {
        "content": "Oil is a finite source. So the world [NAME] stop when (not if) the supply ends? We have the means to move to clean energy and we must. It is our responsibility to future generations."
    },
    {
        "content": "Prosit!!"
    },
    {
        "content": "Verrissimu li qed tghejd ghax it tifla ta binti ta 5 snien tkellhemm bil malti U tirrispondi blinglis... U bil malti kwazi ma tafx..."
    },
    {
        "content": "6 xhur lieva fl armata jew Pulizija jew protezzjoni civili, [NAME] zaghagh kollha u min irid ikompli u min irid jistudja jigi mghejun mill gvern imma [NAME] kif jinbidlu certa traskuragni u zibel!! imma forsi jien ma studjajtx bizzejjed biex l opinjoni tijaj tkun apprezzata!"
    },
    {
        "content": "Prosit [NAME]!"
    },
    {
        "content": "Jidispjacini ma tinkovincini xejn. Biex tinkovincini sa l elezzjoni trid li min ghada tibda twassal il messag [SURNAME] daqs il kristall mhux toqghod id dur mal sugget u tirisspondi b mod lu qisek qed titkellem mieghi fuq il politika. Jekk il messag twaslu tajjeb u sew issa huwa cans li partit iehor forsi jitla fil parlament."
    },
    {
        "content": "Grazzi Sur Salamone ta' kemm inti onest u genwin. A true gentleman. Malta spiccuta u inutili noqghodu nilghabuha tad dojoq. Ahna konna nghafgu fuq xulxin meta konna Maltin biss ahseb u ara issa li d dinja kollha giet hawn."
    },
    {
        "content": "m'hemm xejn differenti bejn dan is-sinjur u l-kap tal-PN, l-istess paroli biss, patpit fil-vojt biss fatti xejn"
    },
    {
        "content": "Jekk jiibat lit tifel [SURNAME] [NAME] kif z zok irrid jitkellem bil malti… another one bites the dust… ma qalx propsta sura f satejn lol ehhhh"
    },
    {
        "content": "The problem with politicians like Mr Salamone is that they believe in conspiracy outdated theories and therefore we cannot take them seriously. In an age where if someone gives a nice (blow) job to an American president and we get to know about it... do you think we would not find out if Malta had a secret agreement not to pump up oil from Naxxar? He is right in many points but when I hear such fantasies I [NAME] clearly not vote for such persons."
    },
    {
        "content": "There is no dept in the subjects taught because the present curriculum is inepth for todays' requirements. Discipline must be reintroduced in all aspects. Thank you Mr Salamone."
    },
    {
        "content": "Id dixxiplina mid dar, jekk ma jkunx hemm bazi soda ghal xejn. Mhux talli hekk talli l genituri jigu ghas sudisfazzjon flok jikkoregu lil uliedhom. Il hajja Malta saret easy hafna b hekk tohloq generazjonijiet bla sinsla."
    },
    {
        "content": "Jaf xinu jajd ha nejdlek dan ir ragel."
    },
    {
        "content": "Proset [NAME]"
    },
    {
        "content": "Wiehed mil fallimenti fis sistema edukattiva kien propju li tfajna kollox go dik l fabbrika Tal Qroqq ta hafna istituzzjonijiet t' Allat Medologi li hassru lil din l gojjel ta art u jerga aghar fil hsieb. Illum qed nghixu fl aghar generazzjoni."
    },
    {
        "content": "Proset [NAME]. Proset [NAME]. Għoġobtni. Igri tasal l-elezzjoni!!"
    },
    {
        "content": "Proset."
    },
    {
        "content": "[NAME] fenek adami mitt vot beda u mieting go pjazza infern 100 min nies"
    },
    {
        "content": "Time for the patriots to save this Country."
    },
    {
        "content": "Il USA ghandhom lil Trump u ahna ghandna lilek. Grazzi [NAME] 👍"
    },
    {
        "content": "Proset"
    },
    {
        "content": "Proset"
    },
    {
        "content": "From what I heard here they are extremists \"in their own World\", however 🤷‍♀️"
    },
    {
        "content": "Sorpriz bil fatt li Granmastru ma jafx minhu Hermes Trismegistus."
    },
    {
        "content": "Interessanti hafna, prosit u grazzi!"
    },
    {
        "content": "Jiena ma nistax nifhem kif hemm bzonn li tkun go xi ghaqda u taghmel certu ritwali u temmen f xi arkitet universali biex itejjeb lilek innifsek. Ghandi kurzita sema barranin u qal li ha jifthu logog f pajjizna, naraha stramba ghala ghandhom joqoghdu jigu hawn meta pajjizhom hu daashekk enormi. Grazzi [NAME] talli gieb persuni li ma tanc jinataw cans biex juru l argumenti taghhom."
    },
    {
        "content": "A very interesting discussion!"
    },
    {
        "content": "Proset kont ser najda din. li kieku kullhadd mazun kieku m hawnx gwerrer... 😊"
    },
    {
        "content": "Hemm bzonn li tkunu f aktar programmi... halli n nies jitalmu. Jien l ewwel wahda kont nahseb li mazun... ghax ma tkun temmen b xejn ect ect. Imma issa hadt opinjoni ohra..."
    },
    {
        "content": "Proset sur cusens... program nteressanti mens 👍"
    },
    {
        "content": "Hadt gost nisma fuq din l ideologija tal Mazuni, li hi differenti hafna milli kont nimmagina, jew ahjar kif kienu jpenguielna, forsi ghax zammew ruhom sigrieta, li m'ghandhomx ghalfejn ikunu. Nifhem li hekk kellhom jaghmlu minhabba l persekuzzjoni."
    },
    {
        "content": "Prosit Rick tal-podcasts interessanti u edukattivi. Kelli interpretazzjoni differenti fuq Mazunerija, izda ma kontx nobsor li huwa kif gie spjegat mill-Granmastru."
    },
    {
        "content": "Hadt gost hafna nisma sinjur jitkellem zgur li taghlimt x haga. Prosit u grazzi [NAME]"
    },
    {
        "content": "Rgiel biss huma masons??. Proset Tal program"
    },
    {
        "content": "Such a wonderful speech. Not a word out of its order. I can easily say this is a very disciplined person. Not carried away easily. Keep it up. You have no idea how far advanced you are. Your voice on its own shows this harmony and discipline in your mind. Thank you also to [NAME]. A golden 1.5 hours - surely no lost time in listening."
    },
    {
        "content": "Prosit."
    },
    {
        "content": "Qatt ma rajt lll-[NAME] sorpriz u kwazi mbellah b'dak li semgha min ghand G'master [NAME] Cusens. Grazzi u proset."
    },
    {
        "content": "jekk trid ittejjeb lilek innifsek alla fejn jidħol?"
    },
    {
        "content": "Il-Mażuni bħal kull reliġjon oħra? jemmnu li biex ittejjeb lilek innifsek trid tkun mażun? la hemm loġġi u organizzazzjoni u kostituzzjoni mela hemm dak il-ħsieb. Jien ateu u ma nħossx li għandi bżonn xi organizzazzjoni jew xi reliġjon biex intejjeb lili nnifsi. kull ma rnexxilu jagmel il-bniedem għamlu bis saħħa, bl-esperjenza bl-iħbalji bl-għaraq bid demm bil ħila tiegħu."
    },
    {
        "content": "A masonic lodge existed in Senglea before the war."
    },
    {
        "content": "[NAME] ghamel intervista ma Lhudi \"malti\""
    },
    {
        "content": "Rigward tipi ta logog nista nghidlek li go L-isla kien hawn sahansita logga ghall bahhara fir Royal Navy li kienet imsejha Naval Lodge. Fl-Ingilterra hemm anki logog ghall bahhara tal [SURNAME] Navy... [NAME], staqsejt jekk jezistux publikazzzjonijiet Masonici. Nissuggerilek taqra \"Freemasonry in Malta\" ta [NAME] [SURNAME]"
    },
    {
        "content": "[NAME] jiena naqbel mighekk ghax jiena bniedma bla religjon..."
    },
    {
        "content": "I very admire Mr. Cusens such a very respected person"
    },
    {
        "content": "Prosit [NAME] titkellem sewwa u z zomm l argument"
    },
    {
        "content": "Mena Nistaqsi xi haga jien!? tilqa u tiggiled ad drittijiet u al gustizzja sociali, dan min ser jilqa!? al min ma andux vuci ax adu ma giex fid dinja??, int u shabek tistew tamlu disskusjoni imma min adu ma twelidx ma jistax jamilha!!, skuzanni imma int kontraddittorja tijak innifsek, mintix tamel sens jidspjacini."
    },
    {
        "content": "L Argument ta xkieku seta sar fetu (jekk hux Einstien jew Putin) huwa wiehed irrelevanti ghal ahhar"
    },
    {
        "content": "Jekk int bnidma ta gustizzja. Sociali. Kif allura taqbilx fuq abort int kontraddittorja tijak innifsek il fatt li int ma [NAME] x. Falla it says it all I'm sorry mandekx principju ta xejn ma naqbel xejn ma li qed tajd jekk int veru Mara ho Nesta. Lanqas. Biss ma ghandu jaddillek il hsieb li tamel. Abbort. Jekk ma tridu li tinqabad. Tqilla. Tamila intercourse il punti tijak huma Bla sens. Hu inhoss li mandekx moralità il fatt li ma ghamiltu abort f hajtek li il kuxjenza ma hallitekx huma prova cara li int kontradittorjatijak innifsek sorry"
    },
    {
        "content": "Jekk int bnidma ta gustizzja. Sociali. Kif allura taqbilx fuq abort int kontraddittorja tijak innifsek il fatt li int ma [NAME] x. Falla it says it all I'm sorry mandekx principju ta xejn ma naqbel xejn ma li qed tajd jekk int veru Mara ho Nesta. Lanqas. Biss ma ghandu jaddillek il hsieb li tamel. Abbort. Jekk ma tridu li tinqabad. Tqilla. Tamila intercourse il punti tijak huma bla sens."
    },
    {
        "content": "Mela jien naqbel ma abort, f rape, severe diformation Jew meta jkunu brain damaged Severu IL bqija, habba l flus u ax gi biz zball u ax ma tridx it tarbija jien ma naqbilx mahha, issa dwar lenergija tana li ed tajd int [NAME] fej qrajt jien scientificly the energy of our body is redistributed into the environment, continuing the natural cycle of energy transfer that sustains ecosystems. Jien ma sissa Adni ma nemminx li johoda haddiehor, ovjament opinjoni tijaj igifieri ta karma u le ma tantx nemmen fija"
    },
    {
        "content": "FL-ahhar smajt argument hsura ta' nies fuq l- abort, minghajr hadt ma jinterompi lil hadd. Proset"
    },
    {
        "content": "Bniedem 'brain dead' nitfghulu IL- magni, mhux ghax ma nikunsidrawhx iktar bniedem imma ghax IL- Hajja tieghew propju ma tkunx viabli minghajr dawn l- istess magni. Ir- raguni hi li IL- mohh jikkontrolla IL- processi kollha fundamentali li jzommuna hajjin. Mela dak l- argument () ma jaghmel l-ebda sens."
    },
    {
        "content": "Prosit tassew. Kemm inti gentlom vera grazzi [NAME]. Vera niehu gost nismgha id-discussions tieghek. Grazzi hafna. Ghadek ma tafx certu kliem kemm jaf ikun ta ghajnuna."
    },
    {
        "content": "give them up for adoption hawn hafna couples jixtiequ u ma jistax ikollhom"
    },
    {
        "content": "Ta l amerikana kollha teatrin falza kienet biex tippromwavu l abort"
    },
    {
        "content": "Diskussjoni tajba hafna"
    },
    {
        "content": "Din tamel parti min ghaqda ta, id drittijiet ta nisa, jew ghaqda narcissimu ta nisa?"
    },
    {
        "content": "L unika haġa li qbilt ma din il mara meta qalet fil bidu Tal Podcast. Meta ikun hemm fetu li huwa bla moh u dan 100% li meta titwieled Ha tmut. Il bqija fxejn ma naqbel magħha. Sory"
    },
    {
        "content": "Sewwa tkellimt [NAME]!"
    },
    {
        "content": "Argumenti baswijin. Jist's jkun ukoll \"the next Hitler\" jew \"the next Stalin"
    },
    {
        "content": "Billi jixtru l pinnoli mhux bilfors ikunu qed jehduwhom ukoll forsi jerga jdurilhom wara li jixtruhom"
    },
    {
        "content": "\"container\"? Really?"
    },
    {
        "content": "Hemm kontroversja kbira dwar meta tibda l-ħajja"
    },
    {
        "content": "L-ispiżjara Maltin jaħsbu li għandhom dritt jiddeċiedu min jista' jieħu l-morning pill u min ma jistax."
    },
    {
        "content": "Hang in there, [NAME]!"
    },
    {
        "content": "Hemm bicciet minom il hdura tider fwicchom adrìan jitkelem ahjar min [NAME]"
    },
    {
        "content": "Sammartni! Dal podkast biddilli kif nhares lejn Dr. [SURNAME]. proset!"
    },
    {
        "content": "Proset tal program DJALAGU semma Dr [NAME] kif qatt nista nemmen meta didjalogaw mal poplu li jaghmel il pn huwa giddeb? ha nsemmi 2 meta wasalna biex nivyutaw biex nithlu fl europa giddeb sfrenat ma tal linja ma kellomx jinkwetaw fuq xoghlom xgara l opposite l kaccaturi tkissru ghax gara l opposite li weghdtu d djalugu sar mil pn u vera rebhu imma ghax tradewna GRAZZI IMMA LE"
    },
    {
        "content": "Prosit, [NAME]. Great podcast."
    },
    {
        "content": "Future prime minister"
    },
    {
        "content": "Always interesting podcasts"
    },
    {
        "content": "Bravu [NAME]"
    },
    {
        "content": "laqas in nies tiejak kecewk"
    },
    {
        "content": "It tnejn hziena"
    },
    {
        "content": "Most of the people want a better life and that means a good wage!! Cause unfortunately money is the key!!"
    },
    {
        "content": "Ghalkem dejjem ivutajt labour, lil Dan ir ragel lest li nipruvah jekk ikun leader,"
    },
    {
        "content": "Hekk ghandu jkun l Intervistatur... Mhux ghax jkellmu politiku qiesom qed ikellmu xi gran alla. Gurnalisti itghallmu minn [NAME]!! Dr [SURNAME] 1 mill vera ftit li baqa sew."
    },
    {
        "content": "Niehu gost insegwik Facebook U nisimghek tikellem Dr [SURNAME], ghax nemmen li inti geniwinament jimpurtak minn nies avolja miniex ta' l-istess fhema politika tieghek."
    },
    {
        "content": "Proset"
    },
    {
        "content": "\"Jien ser nibqa nahdem aktar minn qatt qabel ghall Partit Nazzjonalista - [NAME] [SURNAME]. \" Hekk ghandhom ikunu l-persuni genwini li ghandhom ghall qalbhom il-Partit Nazzjonalista. L-ebda persuna individwali mhu l-partit nazzjonalista imma l-kollettiv ta' fehmiet differenti ghandu jibqa ghaddej. Ejja nharsu 'l quddiem. Dan li qed jinghad hu aqua passata u issa qed inharsu 'l quddiem b'[NAME] [SURNAME] li hu wiehed mill-fore fronts tal-Partit Nazzjonalista taht it-tmexxija ta' [NAME] [SURNAME]. Hemm hafna problemi fuq xhiex nistghu nitkellmu biex il-gvern prezenti jifhem li z-zmien tieghu skada. Fil-verita m'hawn hadd li hu vera indipendenti f'Malta, izda down deep jew tkun ahmar jew blue, izda dawn in-nies f'qalbhom u bil-fatti ghandhom jiddeciedu, 'irrid nibqa nghix taht din l-arroganza u hmieg li hawn fil-prezent jew irrid bidla'. Indipendenti jew le hemm bzonn ta' bidla. [NAME], nammirak ghall-podcast tieghek u dejjem insegwik. Il-pajjiz ghandu bzonnok biex it-tmexxija prezenti tinbidel immedjatament. Inuttli li noqghodu ingergru u nahseb li int zbaljat li tghid li z-zewg partiti l-istess. Le, hemm bahar jaqsam. Min jghid hekk, probabbilment qed jghid hekk biex jintoghgob mit-tnejn. Le, Metsola mhux qed tibbekkja lil Israel, fuq dan il-punt int zbaljat. Le, [NAME] [SURNAME] QATT ma qal li jekk jitlef l-elezzjoni izarma. Dik kienet gidba li ssemmiet fil-One TV. U le, [NAME] [SURNAME] hu bniedem nadif, sincier u onest. Ejja ma nhallux il-character assassination ta' min ghandu agenda biex innaqsu l-mertu ta' persuna minghajr is-sahha ta' prova."
    },
    {
        "content": "Gurnalizmu tal habba gozz f malta. u min ihammegg lil persuna b allegazzjonijiet li imbghad jirrizilta li mhux minnhu imissu jigi imsemmi l isem. Jafu sew [NAME] ghax hadem kontrih"
    },
    {
        "content": "TOP!!"
    },
    {
        "content": "I do not agree with one thing that was stated, that if an indipendent politician or a party are elected with 2% of the votes or more they [NAME] not rule the country, but they [NAME] have the ability to decide to which other party they vote in favour with or the move from one side to an other, so if something seems to be going bad in a deal or a new legislation, they can vote with the opposition to make sure that the [SURNAME] is changed for the better of our country, in my opinion! The government can also be changed without the need to [SURNAME] for another election. The important thing is that we should try to vote for onest and righteous politicians that they could surve the country and it's citizens with dignity in my opinion"
    },
    {
        "content": "GHAX MA STAQSEJTUX TA SKASKA"
    },
    {
        "content": "Litteralment wahhaltni nisimghu dan il Podcast, [NAME]. Proset u Grazzi Dr [SURNAME], a true gentleman!"
    },
    {
        "content": "Thank you Dr [SURNAME]. You are the G. O. A. T 👏 well done"
    },
    {
        "content": "I'd diska tal ftuh ta vera"
    },
    {
        "content": "Grazzi Dr [SURNAME] U proset [NAME]"
    },
    {
        "content": "Proset [NAME] and Dr. [SURNAME]... Podcast bil bajd!"
    },
    {
        "content": "Kemm bzajtu isemmu lil min kien johrog dawk il-qlajjiet..."
    },
    {
        "content": "[NAME] tinsix li hekk ghamlulha lil [NAME] iddemonizjawha."
    },
    {
        "content": "Thank you both, awesome!"
    },
    {
        "content": "Proset [NAME] u proset doctor [SURNAME]. podcast sabih kien u li tihu pjaċir tisimgħu 🙏"
    },
    {
        "content": "Alura il hamas xinu jamel ric"
    },
    {
        "content": "Andi itratt ta meta kien abati hahah tridu [NAME]"
    },
    {
        "content": "Proset [NAME], rajt r-reels fuq Facebook u ma ghandiex dubju li hu top content, il-lejla nintefa narah bil-kwiet :)! Keep up the good work [NAME]... you´re a rising star! :)"
    },
    {
        "content": "Jiena la [NAME] wisq aktar lil metsola ma nafda..."
    },
    {
        "content": "Pero bir rispett kollu lejk [NAME] jekk ser jibqa [NAME] fejn ahna ser nibqaw..."
    },
    {
        "content": "Din il frawta hareg bijha U bdijha l ghasqi ta bummarad U hexxa lil Malta fsorma... U il bobby baqa jghazaq warajh..."
    },
    {
        "content": "Ghejdli int lil min tried tafda??"
    },
    {
        "content": "Mafia galore eeeeeeeeeeeee"
    },
    {
        "content": "Il [NAME] kompanija..."
    },
    {
        "content": "Ghax il gvern li ghana hokli Han hoklokk..."
    },
    {
        "content": "Interview interstanti, imma jekk tassew iridu ikunu fair, taghmel sens ili iggib xi hadd mil kamp apost bhall [NAME] [SURNAME], blue heros jew blue villians, kullhadd ghandu il persptiviva tieghu."
    },
    {
        "content": "Richie naqbel hafna mieghek li tinsisti biex tghaddi ligi kontra min jivvinta fuq haddiehor. Politikamnet manaqbilx ma [NAME] [SURNAME] imma l ewwel haga nikkundanna dak kollu li ghamlu lilu u lil familja tieghu. Ma taqbilx mieghu, imma kont nara persuna addattata biex ikun leader ghax qatt ma harget kelma wahda ta mibgheda minn halqu. Il politka ghadha tkun xi haga biex tghin lil kull persuna ikollu hajja ahjar... dik il hdura ghalfejn?"
    },
    {
        "content": "Grande [SURNAME]. Malta kollha ghanda tirringrazzjak. Lewwel u qabel kollox hemm Malta. Grazzi [SURNAME]."
    },
    {
        "content": "Inkredibli eh con artist top… first 5 min rajta 20 darba ghax ma stajtx nemmen x qed nisma. X jaghmel top con artist li kapci iharbatlek s sens ta verita. Jekk twieled 69 u ta 10 mar l Vatikan so ma kienx qed jigdeb li fil 78/79 kien hemm. Issa kif tista tizbalja fis sena ta meta sparaw l Papa? Hemm taraf minn hu Con artist ghax anka hu ikollu deluzjoni go mohhu li tant irakakunta li giet kredibilita. Sfortunament hi riflesjoni tal politici Maltin"
    },
    {
        "content": "Ipruvajt inbiddel fhemti pero ma l ewwel 5min gejna koppi…. Mil injuranza tieghi 1981 sparaw l Papa…. Mhux forsi kellu x jaqsam ma [NAME] orlandi wkoll hu?? Ehhhh"
    },
    {
        "content": "Crypto fascist, 2 cents Mussolini impersonator…. though credit due for his work on the vitals quagmire"
    },
    {
        "content": "[NAME]'t agree on Metsola and independent parties' views."
    },
    {
        "content": "Whats the garbled sub titles!!"
    },
    {
        "content": "[NAME], ghalfejn ma atlux il punt tieghek stess li isemmi fil lil Dr [NAME] [SURNAME] meta stedintu?"
    },
    {
        "content": "Thanks alot"
    },
    {
        "content": "Smajt żewġ podcasts illum (miskin jien la jien annimal politiku...) barra dak qabel minn [NAME] [SURNAME], fejn ġie jenfasizza li post L-avukat [NAME] [SURNAME] Manchè hu lura mal-Labour. L-Avukat uriena kemm kien imwegga' u għala spiċċa indipendenti. Jidher ċar li m'ghandu ebda ħsieb jerga' jersaq lejn il-Partit. Irraġuna li postu se [NAME] huwa ma' partit ġdid. Jekk jagħmel dan, fil-fehma tiegħi għandu jkun Mexxej. Semma bosta punti validi. Nistennew u naraw. Mhux sorpriża li bl-eluf ta' persuni li mhumiex jivvutaw (109,000) u 33,000 jivvutaw lil kandidati indipendenti u l-Alternattiva qed jikber l-għatx għal partit/I godda. Nittama li sa l-elezzjoni li jmiss fil-proċess elettorali jsir it-tibdil neċessarju biex verament issir ġustizzja mal-partiti ż-żgħar, għax il-partiti l-kbar ma jistgħux iċaħħdu lil madwar 140,000 votant milli jtellgħu lil kandidati tal-partiti ż-żgħar."
    },
    {
        "content": "Prosit [NAME] & [NAME]. Jien kont dubbjuz jekk nivvotax jew le, imma meta nisma dawn il podcasts, tikkonvincuni aktar biex elezzjoni li gejja ma nivvutax. Ghax jekk jien m' ghandiex fiducja fis sistema politika tal pajjiz, x'immur naghmel nivvota. U [NAME], ipprova gibilna il ministru tal gustizzja, ha jghidilna hu fuq is sistema gudikarja tal pajjiz, fosthom fuq il qorti tal familja u s sehem tar ragel fejn tidhol il familja. Grazzi."
    },
    {
        "content": "Prosit [NAME]. Dejjem ammirajt l kuragg tieghek, li fejn [NAME] l hazin titkellem, li tghin lil baghtut. [NAME] napprezza aktar kieku tuza lingwag aktar accettabli, dan jarawh nies ta kul eta', naghtu ezempju imma on the whole prosit ghax dejjem insegwik. Grazzi hafna."
    },
    {
        "content": "Jiena kulltant nahseb li dan pajjiz qatt ma kien haqqu issir indipendenti u nimmagina ghax jien ma ilhaqthomx kemm kien hawn dixxiplina taht Imperu Brittaniku. Hawn xi hadt li forsi jadilu dan hsieb mill kuritur ta mohhu??"
    },
    {
        "content": "diskursata interessanti mmens... naqbel hafna ma kwazi kull ma ntqal b'mod specjali fuq il-kwota tan-nisa... pero meta titkelmu fuq l-onesta' ma nahsibx li x'hin ghamiltu l-argument ta' min huma n-nisa li telghu bis-sistema kontu qed tkunu onesti b'mod specjali minn naha ta' [NAME]. Skuzani hassejtek li ma kontx qed tkun onest meta bdejt tghid li ma tafx min huma... huwa vera li hemm bicciet minnhom qedin hemm ghan numru u biex jider li hemm numru ta' nisa meta jgibu x-shot fuq l-istazzjon tal-parlament, pero fortunatament hemm zewg nisa li ghandhom pozizzjoni u li telghu bis-sistema tal-kwota li nemmen li qed jaghmlu bicca xoghol sewwa u nittama li tistieden ghal fuq dan il-podcast b'mod specjali lil onorevoli [NAME] [SURNAME] [SURNAME]... Mil-bqija keep it up u grazzi tas-servizz ghax sirt nippreferi tieghek mil-podcast ta' [NAME] pero xorta nippreferi lil BuB ;p"
    },
    {
        "content": "Prosit Dr Manche'. J'alla ikolla 3rd partit. ghanda bzonnu, Malta spiccat!! Grazzi [NAME]."
    },
    {
        "content": "Diskussjoni tajba imma żlaqtu fuq l- abort"
    },
    {
        "content": "Proset [NAME] u [NAME] kemm ghandna bzonn rgiel u nies ta vizzjoni u principju, ghax il-hajja go dan il-pajjiz sejra mill-hazin ghal hafna ghar"
    },
    {
        "content": "Dan il bnidem il priministru ta malta andu ikun!! Proset Dr. Manche' namirak kif titkelem."
    },
    {
        "content": "Mhux l ghasqi ta bummarad gaba din is sitwazjoni... kemm ghajjat ghax hemm bzonn ghal pension... U kemm ghajjat ghal Malta kosmopoltana..."
    },
    {
        "content": "Rick suppost hemm il partiet popolari ta [NAME] Salamone..."
    },
    {
        "content": "PROSIT tal program..."
    },
    {
        "content": "L Union ewropeja qeda tmexxi lil Malta... laqwa li ghandhom IL metsola... IL Bobby xghala zobbu mil pajjiz... IL Bobby laqwa l ekonomija..."
    },
    {
        "content": "IL parliament mafia state galore"
    },
    {
        "content": "Proset, naqbel mieghek f kull kelma li ghidt... kemm ghal qorti u kemm ghad domestic violence..."
    },
    {
        "content": "Well done, both of you should consider to join the third party, you already have a lot of followers 🙂"
    },
    {
        "content": "Dik hija s systema tal left wing... ghalhekk hafna nies mhux ha jivvutaw ghax qed jibdunaw li leftis huma n naha ta l evil... pero qed jerga jqum ir right wing fl ewropa... u hemm nergaw niehdu ruh meta nehhu xjaten mis sistema"
    },
    {
        "content": "Keep it up Dr. [NAME]. Hadt pjacir nisiemek. Kellom bzonn il politikanti jifmuha bhalek u jkollna nies jirragunaw kif tirraguna inti."
    },
    {
        "content": "Prosit u grazzi."
    },
    {
        "content": "LE ghal abort! Hadd m'ghandu dritt jittermina hajja ta' tarbija hlief Alla."
    },
    {
        "content": "Għallura Rick, meta tghid il hazin jaghmlu certu bloggers meta jghajru il poltickti \"qahba\"... minn jieħu t-tixħim minn negozjant, ikollu x'jaqsam sesswalment miegħu għal pjaċir politiku. Taqbez ghalih meta taf ezattment x'inhu u x'għamel (qattiel sinjur fuq il coke). Jiġifieri jekk mhux prostituzzjoni tal-politika, dik tigi ezatt (forsi [NAME] il tihu zball, imma zball saret sinjura zghira)?? Jekk inti fil-pubbliku qed tithanzer u qed tammetti li qed tithanzer minn fuq id-dari (taxxi tal poplu), mela jekk [NAME] ħmar, ħmar trid tgħidlu. Imnalla għandna min jitkellem bla kantunieri, u imnalla kien hemm min kixxef iċ-chats. Dik hija freedom of speech. Jekk ma togħġbokx, tidħolx għall-politika bir-rispett kollu, il politika ghan nies serji qeda u ta integirita mhux ghal common [NAME], ili xhin jara sinjurin jiftah saqajh berah."
    },
    {
        "content": "Kanni ta' ilma ghall bdiewa? Ix Xaghra Ghawdex ghaddew il kanni qabel l elezjoni. Issa qed jistennew l elezjoni li jmiss biex jaghtu lil bdiewa l access biex jiehdu l ilma minnhom. Sa frattant nibqghu intellew l ilma mill boreholes u dejjem tizdied l imluha fil water table. Jien iben bidwi lokali u naf x'qed nghid dwar l imluha fil water table."
    },
    {
        "content": "[NAME] jien niehu pjacir nissimaw il-podcast tieghek Ghax ikun bilancjat imma tal-llum out of contest minhabba li bhalissa ghaddejja konsultazzjoni pubblika fuq Il qorti tal-familja. Ikun ahjar tistiden il-parti l-ohra ha nissimaw il-qampiena l-ohra"
    },
    {
        "content": "Jin Bl ADHD u il kanabis Gabitni qisni Iblah Kif ikurajt l ADHD qtajta malewel u Hadt ir ruh. il Kanabis aw Kundizjonijiet li tahdem fuqom u ohrajn tamel il hsara mux gid."
    },
    {
        "content": "[NAME] raġel ġenwin"
    },
    {
        "content": "Proset [NAME] ghax ilqat Il musmar fuq rasu imma iz zewg partitti ma iriedux jirrangaw u jaghmlu Professional Court! Ghax hemm Il flus fin nofs 🧐😡 u Il poplu Gahan 😩"
    },
    {
        "content": "Hawn hafna ingustizzji fuq l-irgiel, u ma jissemewx fuq Il media. Jekk johrog jixtri wara 10 min icempilu, nisthi min flokhom jien! 🥺"
    },
    {
        "content": "Proset bhal dejjem... hemm bzonn in nies ninghaqdu hemm biss hemm is sahha... semmejt L generators... hafna paroli biex nuzaw energija nadifa U tghidx kemm ihammgu, apparti l marinas dejjem ikabbruhum biex jidhlu iktar yauchts u iktar tnigguz fil bahar... basta jhallsu t taxi... dak L importanti mhux l ambjent san... min jahdem il furjana faccata tal port, riha kontinwa ta duhhan li jigi mill [NAME] liners... umbghad iridu energija nadifa... jahasra jitmejlu bil poplu f wiccu"
    },
    {
        "content": "Prosit tassew, ilqattu hafna suggetti jaharqu u naqblu maghkom. Ahna lesti biex nissapportjaw it 3 partit li fil-prezent huwa l Partit Popolari, ghadu zghir wisq bhala partit imma minn xi mkien trid tibda ghax xbajna bl-ikrah mill-Partiti l-kbar."
    },
    {
        "content": "Ghalhekk qedin sew b hafna partiti"
    },
    {
        "content": "problema hi kif nivvotaw ghax jekk tivvota ghal kanditat fuq malta kollha b hekk biss jjista jitla tielet partit fil-parlament"
    },
    {
        "content": "Dak u il punt krucjali. Il flus"
    },
    {
        "content": "Plasse tista tijna ricetta ta 17 ta ottubru ta anti fjammatorja ghax malhaqtix plaseghax mastajg insiba plase ghax ghandi bzona vie naghmila plasse"
    },
    {
        "content": "Prosit [NAME] ❤ dejjem interessanti jkunu d-diskussjonijiet tieghek!"
    },
    {
        "content": "Grazzi [NAME] [SURNAME] ❤️"
    },
    {
        "content": "KEMUNAI MLEWA BIS-SIGAR U FEJN IKOLLOK BZON TA SIGAR IKU LESTI IMKABRIN,"
    },
    {
        "content": "Dawn ISIRU L-AWSTRALIA, JEK TIXTRI IL-PETROL, KOLLA JISTAQSUK JEKK TRIDTX IRCEVUTA, KIF SA TKUN TAF MIN QED IQERREK, CHEATING?"
    },
    {
        "content": "MALTA IN-NIES MA JIVVVUTAWX FLUS FIL HELA, L-AWSTRALIA GHANNA MULTI... MIN MA JIVVUAWX SODISFATI BIL GVERN."
    },
    {
        "content": "Prosit [NAME] u [NAME] għall-mod dinijutuz kif trattajtu l-liberta' ta' l-espressjoni u s-salvagwardji li jridu jittieħdu biex nies b' finijiet malizzjużi ma jkomplux jgħaddu bħal gaffa fuq dawk li ma jaqblux magħhom. Is-sarima mhux mixtieqa, imma kitbiet malizzjuż huma kundanabbli u mistmerra. Appell lil [NAME] komplu aħdmu biex nerġgħu naraw lill-Avukat [NAME] Manchè lura fil-Partit Laburista. Naqbel miegħek [NAME] mija fil-mija dwar il-fehma tiegħek dwar l-abort. Persunalment ma nagħti ebda mandat għal liġi dwar l-abort u nittama li ebda programm elettorali Laburista ma joħloqli kriżi tal-kuxjenza."
    },
    {
        "content": "Prosit"
    },
    {
        "content": "Persuna habiba tieghi rrakkuntatli storja li grat lil zewgha (Malti) ftit gimghat ilu. Sab xoghol gdid wara li kien tilef l-impieg ta' qabel. Meta giet biex taghlaqlu l-'probation' u jiffirma l-kuntratt tax-xoghol, qalulu li se jnaqqsulu l-paga li kienu ftehmu fuqha qabel, b'€5000 fis-sena! Ir-raguni kienet li jrid jithallas daqs kemm qed jihallsu l-barranin! Meta kkompljena mal-Jobsplus u jivverifika jekk jistghux jaghmlulu hekk, dawn qalulu li iva jistghu, anzi hekk kellhom jaghmlu ghax iridu josservaw ir-regola ta' \"equal pay for equal work\" - Hudha ma saqajk xbin. Mhux ovvja li se jnaqqsu l-paga tal-Maltin! Mela jghollu l-paga tal-barranin!! U l-professjonisti jibqghu jevadu t-taxxi billi jithallsu cash u nghidulhom grazzi talli qed tfottu fid-dawl tax-xemx u l-gvern (hu min hu) ihalli kollox ghaddej. U z-zghir jibqa jhallas!"
    },
    {
        "content": "Kulhadd ifarfar. Hawn dejjem is-sinjuri imexxu u il-gvern ikompli jghinhom."
    },
    {
        "content": "Tiraguna [NAME] proset bilanc kollox"
    },
    {
        "content": "Jien ghamilt biċċa xoghol ta' raġel ghax 12 il sena ijlu tlaqt minn Malta and I have 0 regrets. U ghamlu liż-żobb tridu. Grazzi. Proset [NAME] tal podcast insegwiek minn Iceland 🇮🇸"
    },
    {
        "content": "Il-mod ta' kif indawwru l-kliem biex naharbu mill-mistoqsija, impressjonanti!"
    },
    {
        "content": "Qed [NAME] ux [NAME] kif kissirtu pajjiz u nazzjon"
    },
    {
        "content": "Lil Europa il big business imexxu mhux il politicians."
    },
    {
        "content": "I'm just trying trying"
    },
    {
        "content": "I'm"
    },
    {
        "content": "I'm"
    },
    {
        "content": "I'm [NAME] is a a person 🧍‍♂️ of the ☕️ year point guard 💂‍♂️ in a different"
    },
    {
        "content": "Smajtek titkellem u qisni kelli xaqq ta tama li l affarijiet xi darba ha jitrangaw. Zjara s' ghand il-Professur, hlas cash biss u receipt ma nistax intik minghajr l-ebda tip ta raguni ghalfejn. Qisu kulhadd jaf minn fejn andu jibda din l- implimentazzjoni proposta barra min jiehu d-decizjonijiet. Min jaf ghala?"
    },
    {
        "content": "Lahjar li isir hu li PL johrog kuljum jitkellem man nies, biex ikun jaf xirid il poplu. Good [SURNAME]."
    },
    {
        "content": "Bir rispett Kollu!! Ghaliex hadd mhu kapaci li jaddi ligi li min m ghandux provi meta jidhol il qorti jew fuq il gideb li jisparaw wiehed fuq l iehor, ghaliex il multi fuq il libelli ma jkunux kwart ta miljun u jekk ma jhallashomx jehel ghoxrin sena habs?? Halli min jiprova ikkisser lil dak li jkun ghal fini ta politika jew fini personli jahsiba darbtejn meta jiftah halqu!!"
    },
    {
        "content": "Lanqas flaht naraha nofsha! Kollu paroli u mutetti bl-idejn fil-vojt ghax fil-verita meta' jkun il-parlament Ewropew hlief jipprova jhammeg lil [NAME] Metsola ma jaghmilx! Sadattant il-gvern tieghu ikompli jhallas minn butna l-ispejjez ta' kriminali bhal dak li jikri l-karozzi li smajna dil-gimgha..."
    },
    {
        "content": "Persuna genwina"
    },
    {
        "content": "Din il ligi tal paga hija ligi ditatorjali ghal ahhar... meta qed tikmanda l xi hadd xi jrid jaghmel bi flusu hija dittatorjali..."
    },
    {
        "content": "Mla tan nies tridu tkunu tafu kemm qwd idahlu ara takom ma tikfhux km idahlu"
    },
    {
        "content": "Kieku kull politiku ghandu nofs l- passjoni lejn il- politika daqs [NAME], Malta tkun genna. That [SURNAME], xi hadd jista jispjegali kif Metsola qatt ma tkun f'poddati hekk? Poddata li tkun mistoqsa mistoqsijiet li jitfghuha dahra mal- hajt, specjalment fuq il- Kwistjonijiet ta' gwerrer."
    },
    {
        "content": "Issa wara li ghedt fuq l ambjent rridu azzjoni [NAME], f sentejn u nofs kwazi xejn m ghamiltu, nispera li fis sentejn li baqa taghmlu xi haga sura ta nies ghal gid tal poplu"
    },
    {
        "content": "Rigward l-ambjent u s-sigar l-ikbar problema huwa l-ilma biex tiehu hsiebhom"
    },
    {
        "content": "Podcast iehor li jzommok tisma Rick … imma ma niflahx nisma iktar politikanti li quddiemek jitkellmu mod, imbaghad jiffurmaw parti minn Gvern li GHAJNEJH, widnejh u HALQU mghammda!! Taparsi nafu nafu nafu … u ma ncaqalqux difer biex l-possibilment intricci li jkun hemm ghaddejjin, niqfulom u naghtu lura lill-poplu dak li hu tal-POPLU!! Dik ghalija nsejhilha ipokkrezija … u jiena min jipprova jit…ek bija f'wicci ma jiflahiex. PL diga ha tisbita kbira Gunju li ghadda, u ma tantx qed nara li inbidlet l-attitudni f'dan ir-rigward … li jfisser illi ……..."
    },
    {
        "content": "[URL]"
    },
    {
        "content": "Jaf [NAME] [SURNAME] [SURNAME] … li ielna nigru wara Lands Department u Sovrintendemza tal-Patrimonju Kulturali, Onor. [NAME] [SURNAME] u [NAME] Zrinzo [SURNAME], iktar minn sentejn dwar ir-restawr ta' dawn il-gibjuni!? … Cisterna della Quarantena … ta' zmien il-Kavallieri!!"
    },
    {
        "content": "[NAME] qabel ma dak li ielni nhambaq dwaru iktar minn sentejn u nofs … \"ghandna bzonn 4/5 open spaces kbar\" … jaf [NAME] illi jiena ielni nishaq dwar rigenerazzjoni ta' Fort [NAME] bhala [SURNAME] ghall-Familja fost hafna affarijiet ohra … [URL]"
    },
    {
        "content": "Prosit [NAME] li tkellimt lehen il poplu. [NAME] huwa bniedem ta kuxjenza pero ma setghax jitkellem sewwa ghax jghamel parti minn club u jaqbżu fuqhu inkella. Pero jidher li jaf xinhuma l problemi u jhoss il-polz allinqas"
    },
    {
        "content": "Naqbel ma [NAME] mija fil mija fuq din tal pagi taz-zghir vs il professjonisti."
    },
    {
        "content": "ma jridux jafu [NAME], il-vit ma jridux jghalquh dik il-verita"
    },
    {
        "content": "Nice podcast. Next government official, you get from Labour [NAME], can you pose the question why up to now they haven't recognised the state of Palestine. You say it how it is [NAME] well done. Alot of talk from [NAME] hopefully we see solutions and change. The partly created a lot of the issues."
    },
    {
        "content": "Il-problema hija li mhux kulhadd jaffordja jhallas!!"
    },
    {
        "content": "Dr [SURNAME] ghandi mistoqsija jien. Permezz ta studji li saru, llum nafu kemm il meditazzjoni tibdel l istruttura tal mohh. Għalfejn dan ma jiġix mgħallem f session ta terapija? Għalfejn irridu biss nirranġaw l anxiety mingħajr ma nattakkaw il core tal issue? Nafu li core tal anxiety hija heart palpitations, Għalfejn l ebda terapista ma tghallmek xi haga daqshekk sempliċi u terapewtika?"
    },
    {
        "content": "Nkompli mal punt tal emotional literacy. Din ghandha tkun parti fundamentali mil edukazzjoni tat tfal minn ckunithom. Mhux nitghallmu biss is suggetti akkademici. Proset"
    },
    {
        "content": "Podcast interessanti hafna, Grazzi"
    },
    {
        "content": "Real intelligent people like our host know when to speak and when to listen and learn from professionals in their field. Ricki handles each topic with care and its always a pleasure plus learning experience to listen to his podcasts."
    },
    {
        "content": "Grazzi hafna u prosit."
    },
    {
        "content": "Well done... excellent podcast."
    },
    {
        "content": "Interessanti immens. Grazzi 👍"
    },
    {
        "content": "Qed tgħid iċ- ċuċati [NAME]... QATT MA MISSEJT XEJN, xorta t-tifel bl-awtiżmu. Bħal ma kien hawn drug users u uliedhom m'għandhom xejn"
    },
    {
        "content": "Dr [SURNAME] so diplomatic, so professional and so knowledgeable. With statistics pointing to use of drugs as the main culprit of most mental health problems government should take note and move toward educating children, youths and general public on the dark side of addiction"
    },
    {
        "content": "He was fantastic Dr. [SURNAME] so knowledgeable. Malta should use his expertise wherever possible thanks, [NAME]."
    },
    {
        "content": "Proset hafna veru interessanti."
    },
    {
        "content": "Proset"
    },
    {
        "content": "Sorry audio tieghi hazin"
    },
    {
        "content": "Tajjeb immens hasra li hemm partijiet maqtghuha minhabba l audio hazin. 😢"
    },
    {
        "content": "Stennejtu hafna dan l-podcast [NAME] interessanti bhal dejjem"
    },
    {
        "content": "Tajjeb hafna dan il Podcast!"
    },
    {
        "content": "Thanks Steph for sharing. Well done [NAME] looking forward for the Next one. Watching from Australia ❤️🌷🇲🇹🇦🇺"
    },
    {
        "content": "[NAME] never disappoints, avolja ma naqbilx ma nofs l affarijiet li jghid!"
    },
    {
        "content": "Prosit [NAME]. Il bniedem biex jitghallem irid jokkontradixxi ruhu hafna drabi biex jitghallem. Dak li tahseb li taf illum ghada tista tibdel fehemtek u tiskopri dak li ma kontx timmagina. L importanti tibqa tevolvi. Ezempju il White Brothers meta bdew jesperimentaw biex joholqu ajruplan, l aqwa nginiera ta dak iz zmien bdew jirredikolhawhom. Qalulhom Il hadid qatt ma tista taghmlu jtir. Imma dawn baqaw junsistu u rnexxielhom holqu l ewwel ajruplan. U llum saret haga normali u tant evolva li hemm ajruplani llum igirru 20 tank tal gwerra bit truppi u l munizzjon u jtir eluf ta kilometri."
    },
    {
        "content": "To believe this story of the generator, it's impossible... and his brother was involved in everything mela qed jadlu miskien"
    },
    {
        "content": "Ir-recording li ghamel dak l-MEP fil meeting ma tat-tabakk, fejn jinkixef kollox fejn hu please?"
    },
    {
        "content": "Stakkament ta koreani jisparaw fuq n nies??"
    },
    {
        "content": "Prosit hafna u hafna..."
    },
    {
        "content": "Ejja ma ninswx li Midmed Bank inbieh pennies on the dollar..."
    },
    {
        "content": "Sewwa qed jghid tal bank jien ghadhom kif telfuni rigal tal birthday il bov ghax riedu dettalji u koppji tal id u passaport etc m ghand il persuna suppost minhabba dara protection qaluli u li haddiehor irid jaghti dettalji personali tieghu lili biex naghddihom lilhom mhix data protection Telfuni rigal li bhalissa vera ghandi bzonnhom daqs mitqlu deheb Meta dawn kienu jafu min liema bank gejjin Kieku kienu xi mitt elf nghid forsi imma din ic cuccata li qlajt tal birthday. Ma nafx hux il bov biss qed jaghmilhom dawn."
    },
    {
        "content": "Rancorous Callous Cabal xi tifsser ezatt?"
    },
    {
        "content": "Mela [SURNAME] jmur il-Bahamas biex jara generator jahdem bl-ilma. Jew nifthu l-clients account lil nies \"filantropi\". Titfghalniex bzar fuq imnehirna."
    },
    {
        "content": "Il Korea jisparaw fuq in nies fejn rajthom ghax jien qatt ma rajta din il bicca xghol Jien giejt niftakar dak iz zmien [NAME] kif tela l ewwel li wedna [NAME] zwiegna jibqu go xgholhom go Kalaxlokk u ma zamx kelmtu u keccijhom il barra dak li niftakar jien"
    },
    {
        "content": "Well done Rick we want part 3. Uncovering what lies beneath"
    },
    {
        "content": "Hi rick. Kemm ghandek ragun fuq il media. Ara [NAME] [SURNAME] min xhiex ghadda. Il ligi trid tinbidel."
    },
    {
        "content": "Meta ghidlinek fuq il kurruzjoni li kiwn hemm ta qali taf x parir tajtna If you cannot beaat them join tgem. Grazzi tal ghajnuna bazwija li kont taghti ta qali crafts village"
    },
    {
        "content": "Slave traffic gie ntrodot mil EU BLINTENZJONI ghal cheap labour my 2c opinion"
    },
    {
        "content": "Great interview 👍"
    },
    {
        "content": "Tal-Generator jahdem bl-ilma... helwa wisq."
    },
    {
        "content": "l aqwa ftuh proset."
    },
    {
        "content": "Ahna familja laborista min qormi missieri kien bla xoghol mar ant [SURNAME] u dak iz zmin lanqas saqsieh xejn. tah biljett u dahlu Malta rubber, hemmek [NAME] 32 years rabba lilna u hareg penzjoni dak hu [NAME] [SURNAME]"
    },
    {
        "content": "Ahna familja laborista min qormi missieri kien bla xoghol mar ant [SURNAME] u dak iz zmin lanqas saqsieh xejn. tah biljett u dahlu Malta rubber, hemmek [NAME] 32 years rabba lilna u hareg penzjoni dak hu [NAME] [SURNAME]"
    },
    {
        "content": "Ma ghidt xejn fuq tal Gakketta Blu"
    },
    {
        "content": "Nahseb li mhux ghal malta qal li kien hawn stakkament ta suldati mil korea. Jien qatt ma rajthom. Konna nohrog u immorru id discos u il velt bil kwiet kollu"
    },
    {
        "content": "Fil-gvern ta' qabel [NAME] [SURNAME], li l-haddiem Malti ghamel xi sitta jew seba snin bil-wage freeze bi skuza li l-gvern kien qed jghin l-ekonmija, fosthom il-banek, u imbghad marru jbieghu l-Bank bi prezz mizeru lil ditta barranija, ghax ma ibiehx lil xi konsorzju ta' negozjanti Maltin!!"
    },
    {
        "content": "Nies mhux hajjin ma jistawx jiddefendu isimhom."
    },
    {
        "content": "rigward due diligence u hadd ma jafda it tort apparti tal ministru hu ukooll ta gruppi bhall Repubblika u il PN li dejjem jaraw x jaqalaw biex itappnu u jhammgu prova haddem kumpanija medja jew zghira ha [NAME]!! il banek mafia shieha u ta min jiehu azzjoni!! mhux ta bxejn kulhadd jaqleb ghall Revolut u [SURNAME] simili"
    },
    {
        "content": "Taqbel jew ma taqbilx mal-partit li kien iħaddan. [NAME] [SURNAME] huwa wiehed mil-politikanti ta' sinsla li kellhu pajjiżna. Illum miż-żewġ partiti ma tigborx wiehed ta' dan il-livell. U dak iż-żmien ma' kellhomx computers bhal llum ikollok kollox at hand with a click of a button. Kollox kien ikun ġej mil-intelliġenza tal-moħħ. Bhalu kien hemm tajbin fil-Partit Laburista wkoll dak iż-żmien u li veru jhobbu lil Malta u wettqu riformi kbar u dixxiplinati"
    },
    {
        "content": "Prosit lill-[NAME] [SURNAME] ta' din l-istorja!!"
    },
    {
        "content": "Kemm tghallimt min kif tkellmet prosit"
    },
    {
        "content": "Xi gmiel ta diskussjoni, kemm hadt pjacir nismghakom. Proset tassew u grazzi li qed taghti cans lil kullhadd jesprimi ruhu b'mod civili 👍🏻🇲🇹🙏🏻"
    },
    {
        "content": "Niftakara zefina prim kont nafaxina naraha ❤"
    },
    {
        "content": "Beauty with brains! Proset immens Steph! Kieku hawn aktar nies bhalek, kieku nghixu f'dinja hafna isbah."
    },
    {
        "content": "Proset Stef u [NAME] 2 nies bravi u nteligenti u rejali proset ♥️"
    },
    {
        "content": "Prosit ta dal podcast. Bravissima Stef kemm hadt gost nisimghek"
    },
    {
        "content": "Vera klim bis sens prova intervieta xi phycologist please"
    },
    {
        "content": "Prozit Steph hadt pjacir nisimek titkellem u tfiem 👏🏻🙏"
    },
    {
        "content": "Fuq l-abort, jekk nosservaw in-natura, meta jkun hemm livell ta periklu u l-omm tħossha taħt stress enormi toqtol il-frieħ. Issa dan meta nafu li l-ewwel stint l-annimal jipprova jipproteġu l-frieħ. Mara jekk tħossha protetta u taf li hemm il bażiku tagħmel minn kollox biex tipproteġi it-tarbija. Il-każ li semma [NAME], normalment il-missier jew persuni barranin jagħmlu ħafna pressjoni fuq l-omm."
    },
    {
        "content": "[NAME] is always there intertwined with free [NAME]."
    },
    {
        "content": "Trump kontra l gwerrer u kontra l abort, kemm nisimghu fuq hekk? Waqt li kien fil gvern qas beda gwerra wahda plus li naqqas it taxxi!!"
    },
    {
        "content": "Dwar ir regolament tal media ma naqbilx mieghek Rick... ghax li kieku lilek ma jhallukx tghid ZOBB fil podcast. Trid tigi mil persuna. Jekk jien ma togobniex il kelma zobb, ma nismax il podcast tieghek u problema solvuta. Il problema min jaghti kaz dak li jinkiteb min wara il keyboard. Cert li Peppi [SURNAME] mhux ha jamel suwicidju ghax xi hadd qallu raqqad immigrant id dar tieghek. Huwa bniedem intelligenti aktar min hekk. Ma tistax tikontrolla dak kollu ta madwarek, l unika haga li tista tikontrolla huwa lilek innisfek. Bhal dejjem, diskusjoni interessanti. Keep it up!"
    },
    {
        "content": "Episodju tajjeb immens. Rigward l abort bhalek nahsiba [NAME]. Lunika drabi li l abort ghandu jkun acettat hu f kas ta problemi serji ta sahha/dizabilita severa tat tarbijja jew jekk l omm tkun fill periklu li titlef hajjitha sforz ta kumplikazzjonijiet fit tqala. To be able to have kids is a blessing and precious specjalment jekk il familja tibqa maquda."
    },
    {
        "content": "Prosit. Naqbel ma Stef il vot ma tridx tarmih"
    },
    {
        "content": "Hi Stef. Veru amirajtek hafna kif titkellem imma nifmek li tfahhar lin Net ghax bhalissa hemm qed tahdem J'ALLA ma jarmukx ghax kieku ma tiragunx kekk. Ifem x'qed jisjegalek Richy. Prosit hafna [NAME]. Keep it up."
    },
    {
        "content": "Proset... I [NAME] that [NAME] discussions [NAME] come to those people who have the power to change the [SURNAME]... 12 yrs fuq kawza ta separazzjoni!!"
    },
    {
        "content": "Brava u proset Steph ❤"
    },
    {
        "content": "Proset [NAME] and Steph watching from Melbourne 🌷❤️🇲🇹🇦🇺"
    },
    {
        "content": "Naqbel hafna ma dak li qieghed tghid Steph biss però nies evil jezistu ta. Bniedem li jistupra tfal, kif tista tghid li mhux evil, bniedem li jsawwat lil uliedu u lil mara ta kuljum tghid li mhux hazin!?"
    },
    {
        "content": "Prosit"
    },
    {
        "content": "Veru proset"
    },
    {
        "content": "Dwar Peppi jekk xi hadd kelmu mhux xiraq ghamel hazin. Imma min naha l ohra ma tistax tippermetti li tqieghed is sigurta nazjonali f periklu [SURNAME] ghax miskien dan Peppi jifima hekk."
    },
    {
        "content": "Proset [NAME] ta dawn il podcast"
    },
    {
        "content": "Brava steph... Pjacir nismakhom. Semplici u spot on. Kuragg... Awguri u sahhiet!"
    },
    {
        "content": "Prosit hafna Steph, naqbel mieghek mija fil-mija fuq l-abort."
    },
    {
        "content": "Podcast bis-sens u li jiftaħ l-għajnejn. Il-ġustizzja mhux biss issir, imma tidher li qed issir."
    },
    {
        "content": "Dawn l imhallfin mhumiex Allat. Ghaliex m hawnx sistema li tgharbel ghemilhom ukoll?. Imhallef forsi jiehu zball abbazi ta opinjoni imma din l istorja turi li din mhi xejn hlief vendikazzjoni."
    },
    {
        "content": "Prosit [NAME] u Prosit Mr [SURNAME]. Il qrati mafia. Kif ghati int fil kas ta hija [NAME] [SURNAME] ezatt hekk sar mil imhallef Consuelo [SURNAME] Herrera u il liberatom. Ghar u kas. F idej Alla. Ghadd tried taghti kont l Alla ta din il hnizrata din il magistrat"
    },
    {
        "content": "wasalt sa allura ghadni ma rajtux kollu. Sa issa l'argument huwwa naqra imnejjek. Jekk is sinjur [NAME] [SURNAME] ghamel zball kif ametta hu stess mela allura il gustizzja titlob li ghandu ihallas ta dan li zball. L'ingustizzja mhux li [NAME] hallas izda li forsi haddiehor ma hallasx imma dan ma jiskagunax lill [NAME] [SURNAME] li zbalja u ammetta."
    },
    {
        "content": "Prosit tassew. Kuragg j'alla jitla zejt f'wicc l-ilma."
    },
    {
        "content": "Naf x qed tejd, ezatt!! Jin fuq accident ta karozza li l inkjesta tal qorti ma sabitniex hatti. Ax il magistrat kien habib ta missier li akkuzani, jin wehilt 3snin sospizzi. Li spettur kien qali li wehilt iktar min drug dealer"
    },
    {
        "content": "sew ghamlet Herrera - that is true justice."
    },
    {
        "content": "[NAME], jien nafek bhala bniedem genwin u mandix dubju. Pero ntik parir wiehed, iggibx il podcast tieghek riciklagg tal One u n Net! Thallix minn jikkontaminalek podcast u joqod jghid li jrid hu. Ezempji bhal [NAME] [SURNAME] u tal lum mandikx xi tridhom, iktar u iktar inti toqod tisma biss u ma ssaqsix mistoqsijiet addattati ghax bir rispett kollu lejk ma tifhimx f certu topics. Stick to nies bhal DJ [NAME] etc ghax dik il linja tiak. Nies bhad Dallis u l bicca l kbira tal politici tressaqqhomx ghax ha tispicca tingar mal kurrent tal imbarazz politiku."
    },
    {
        "content": "B interess smajt dan il podcast ma sur [SURNAME] u ghamel hafna punti u bla tlaqliq semma b isimhom lil individwi li fost l ohrjan jokuppaw kariga li b degizjoni taghhom jistaw jaffetwaw il hajja ta persuna ghal bqija ta hajtu. Dan ghandu jodd ukoll li issa is sur [SURNAME] gab dubji serji f sentenzi li inataw fil passat li b rizutat taghhom jista ikunn li min gie illiberat u setta kien fil hazin, inata lok li jista jiripetti ghatti kriminali kontra haddiehor bla riperkusjonijjiet u dawn il gudikanti poggew nies inocenti fil periklu ghax helsu nies perikoluzi ghas socjeta. Il mistosijjiet tieghi huma; 1. Dawn l indiviwi inkuzz gudikanti ser jirispondu li sur [SURNAME]? Jekk ghandu ragun is sur [SURNAME] ser jinata rimedju jew jekk li qal is sur [SURNAME] mhux korett ser jiehu passi kontra tieghu? 2. il gvern ser jibqa b halqu maghluq fuq dawn l akkuzi ta natura gravi hafna ghawn dwan in nies qedin fl ghola stizuzjoni tal pajjiz u id decizjonijjiet taghhom jaffetwaw lil kullhadd? 3. Ser issir inkjesta magisterjali min nies appuntati li huma id dikjari imparzjali u fil kas li tintab xi haga ser jitiehdu passi? Hemm izjed mistoqsijjiet x issiru. Jekk wara dan il pod cast ma nisimaw xejn izjed iffiser li is [NAME] [SURNAME] qed jghid il verita u ahna il poplu in genrali ghandna ghal xiex nibzaw ghax ma nafux x inhu jigri fil qorti u dan huwa inkwetanti hafna. Naraw u nistenew."
    },
    {
        "content": "Tisma u titbellah. jaghmlu hekk lil dawn in nies ahseb u ara lilna li ma jafna hadd hlief qabel l elezzjoni"
    },
    {
        "content": "Nixtieq nistaqsi lil min qed jitkellem minn sormu għax INJORANR tal-prima klassi x'għandu x'jaqsam [SURNAME] u l-allegazzjonijiet li qed tagħmlu ta' jekk u kemm gawdew il-familja [SURNAME], x'għandu x'jaqsam li qed tgħidu meta l-każ huwa rakkont xokkanti dwar l-inġustizzja fuq tifel ta' familja għax lauristi! Li kieku kien wild jew ġenitur minn tagħkom titkellmu l-istess ja ipokriti! Possibbli il-mibegħda tant daħlet f'qalb ċertu nies li ma jiddistingwixxux bejn politika u l-ħajja reali? \"Kulhàdd jinsih zmienu! Min jaf x hadu fi zmien [SURNAME]\" \"What happened to the spotify uploads?? \" \"Kemm hawn nies ingrati! Qatt ma jaghmlu intervista u jitkellmu fuq dak li gawdew imma jitkellmu biss fuq it-'tbatija'\", imma possibbli taslu s'hawn!"
    },
    {
        "content": "Nisma u Nintella min Gewa daw mux affarijit ta pajiz demokratiku. Daw attaki Politici min istituzjonijiet li sipost indipendenti mil Gvern. Ima Tistaqsi Vera indipendenti?"
    },
    {
        "content": "Prosit"
    },
    {
        "content": "What happened to the spotify uploads??"
    },
    {
        "content": "Li kellu bzonn hawn nies ta integrita daqs il-familja [SURNAME]. J'alla tkompli tohrog il-verita. Prosit [NAME]!! 👏"
    },
    {
        "content": "Dawn il podcasts veru tal ġenn. Kemm nieħu gost nismagħhom. [NAME] [SURNAME] veru bniedem qalbu tajba u tad-deheb. Darba għamel xogħol fit-triq fejn nogħqod, u il-ħaddiema kisruli katusa tad-drenaġġ. Meta mort ngħidlu, minn dak il-ħin stess ġabli tlett ħaddiema biex isewwu l-ħsara. Bniedem umli. Prosit [NAME]. kompli sejjer b'dawn il podcast. Mhux dejjem naqbel ma ċertu verzjonijiet tiegħek, imma ma insibx diffikulta ta xejn, li naċċetta opinjonijiet tan-nies. Viva il-liberta ta l-espressjoni għal imħuħ miftuħa."
    },
    {
        "content": "Kemm hawn nies ingrati! Qatt ma jaghmlu intervista u jitkellmu fuq dak li gawdew imma jitkellmu biss fuq it-'tbatija'"
    },
    {
        "content": "Proset [NAME] u proset Sur [SURNAME]. Biex tigdeb memorja trid u biex tghid il verita bhall ma qed tghid illum trid par,,,, soledarheta mghakhom! Kuragg u iz zejt jitla f wicc l ilma! L ingustizzji enormi li hawn!"
    },
    {
        "content": "Il qawl jghejd \" il verita toffendi\" PROSIT"
    },
    {
        "content": "Pajjizna spiccut... president bla bajd... u zewg nahhat ma fijhomx xtghazel... korruzzjoni galore eeeeeeeeeeeee"
    },
    {
        "content": "Imbaghad nistaġbu ghax issiru s-suwiċidji. Kemm tkun aghar meta bniedem jghamlulhu hekk u ma jkollhux biex ihallas!"
    },
    {
        "content": "Xorta bniedem billi jiehu medications ma fija xejn hazin. Statistika turi xi 80% tan-nies jghaddu min xi perijodu ta dipressjoni jew ansjeta."
    },
    {
        "content": "Ghandi ragun nghejd li il qorti mafia galore eeeeeeeeeeeee"
    },
    {
        "content": "Grazzi li Sur [NAME] [SURNAME]"
    },
    {
        "content": "Proset tal podcast ghax veru bis sens u tiehu gost bil guests li jkollok."
    },
    {
        "content": "Proset ta dan il podcast. [NAME] ragel intelligenti u ragel fuq l irgiel apparti li ivenven kull fejn ikun qieghed idoqq"
    },
    {
        "content": "[NAME] B legend... Spiċċaw l parties sbieħ li konna nattendu ahna"
    },
    {
        "content": "Id dinja inbidlet [NAME]... Kemm fadal Music lovers? Illum hafna jitilaw party bhala fashion show u jekk tejdilom min qed idoqq ma ikunux jafu... ahna konna inhallsu il flus ghax il music kienet vera fina illum inqerdet ix xena"
    },
    {
        "content": "Tribu... memorji sbieh hafna. Kont hadt dal video fit 2005... Kulhadd jizfen u kulhadd bla mobile :) [URL]"
    },
    {
        "content": "X memorji sbieh Prosit [NAME] RIP [NAME] one of a kind ❤ never forgotten"
    },
    {
        "content": "Well done love the chat about social affairs. 👏"
    },
    {
        "content": "Prosit it-tnejn li intkom. Barkiet"
    },
    {
        "content": "grazzi [NAME], hemm bzon naraw iktar intervisti ta djs lokali."
    },
    {
        "content": "Proset. Keep these comming with maltese djs."
    },
    {
        "content": "Grazzi [NAME] ( [NAME] B ) ta diskussjoni tijghek"
    },
    {
        "content": "F'[NAME], [NAME] sibt kappell jiġik. Bdiltu ħafna fehmiet interessanti u ħriġtu l-ingwanti għal xulxin, iżda b'mod amikevoli. Tbaqbaqt gmielek [NAME], imma finalment Kellkom linja komuni dwar it-tielet partit u l-overpopulation. [NAME] ikkommetta ruħu li jerga' jibda jivvota, la darba jkun hemm partit li joħroġ bi pjan konkret dwar l-over population. Naħseb li għandu raġun dwar kif fil-fatt huwa l-kwadru tal-ġid fil-pajjiż. Għażel is-snin 90 bħala l-aqwa żmien u hawn naħseb inkazza (bir-raġun) lil-Laburisti. Semma kemm hu diffiċli għal single mother li tikri li tgħaddi b'2,000 ewro fix-xahar. Ngħidlu immaġina pensjonant b'1,200 ewro jew b'inqas!"
    },
    {
        "content": "Good [SURNAME] [NAME] Had Hafna Pjacir Nisimek Well Done God Bless You For Ever ❤❤❤❤"
    },
    {
        "content": "Il haga li hawn aktar flus f'idejn fl opinjoni tieghi mhux vera. Kif qal tajjeb [NAME] nofs Malta u anki nazzarda nghid 70% tal Maltin nghixu fil kera, loan jew housing li bil kemm ikollna biex nghaddu sal ahhar tax xahar. Hawn iktar flus fil but ghal xi bazzozlu li immur mass meeting iccapcap u jiffanga bil bini jew b xi kuntratt korrott ghal dawk iva hawn aktar flus f'idejn. Il kelma middle class tistaw taqtawha mid dizzjunarju ghax middle class kwazi spiccat. Iddur fejn iddur hlief indjani u pakistani ma tarax kelma bil Malti qas nistaw nghidu ghax hadd ma jifimna. Il flus f'idejn qieghdin ghal min ghandu l flus u neggozju tal bini. Hares dawra madwarek u tinduna fl liema stat tal biki ninsabu fih u dan kollu grazzi ghal gvernijiet u nies injoranti u pupazzi li hawn mas saqajn ghax jaraw kollox politika u kuluri. It tfal taghna ha jibku biex jahdmu ghax xi indjan joqod ghal €5 is siegha ghax ihallas xi €250 kirja fix xahar imma malti li jrrid ihallas xi €700 jew €800 loan mhux ha jaccetta umbad tigi inti [NAME] u tghid li hawn il flus f'idejn. Prosit lilek [NAME] u [NAME] - episodju tajjeb hafna."
    },
    {
        "content": "Wisq ħadt gost insegwi dan il-podcast"
    },
    {
        "content": "Kienu ma jemmnux imma bagħtuk skola tal- knisja? 😏"
    },
    {
        "content": "To not embrace the child within. Is to have the adult rebel without..."
    },
    {
        "content": "Diskussjoni interessanti mmens, specjalment l-ahhar bicca tal-poddata. Ma naqbilx ma' [NAME] f'hafna affarijiet. Mara ta' kultura b'hafna kapacitajiet. Id:decizzjoni li titlaq minn dan id-dizastru ta' pajjiz nemmen li kienet decizzjoni ghaqlija. Minkaf forsi l'quddiem neegghu narawha maghna u tkompli tikkontribwixxi f'dal- pajjiz meta jirranga ruhu."
    },
    {
        "content": "[NAME] tigi vera complicated!! Cheating is not a joke... It took me years of counselling!! And still waiting for the final judgement!!"
    },
    {
        "content": "Narcissist they control everything and gaslighting manipulate people."
    },
    {
        "content": "Hemm cans li naraw lil [NAME]?"
    },
    {
        "content": "Top!"
    },
    {
        "content": "[NAME] ghadni kemm skoprejtek u permezz ta dan l episodju irrealizajt li lanqas jien ma naf min jien ghax ghaddejt minn wisq fil hajja tieghi u ghadni s issa ta 34 ma skoprejtx min jien. Issa iddecidejt li nibda niskopri lili nnifsi permezz tat terapija u nitghallem nghix ghax ma nafx kif. Grazzi, qed taghmel hafna gid"
    },
    {
        "content": "90% tad diskussjoni mieghak naqbel Rick. Fuq ta ego insiba difficli nemmina il [NAME]..."
    },
    {
        "content": "Sorry [NAME] imma faqatek!! :)"
    },
    {
        "content": "Veru podcast li juri kemm ghandna nies intelligent malta ghalkemm jien noqghod il boghod... melbourne Pero malta baqat go qalbi u xhinu ghaddej bhalissa tal biki Hasra li [NAME] ser titlaq minn malta... gabitli hafna memorji meta tlaqt 42 years ago... ghax ma flahtx izjed ghal injuranza ta certa nies Please keep it up dawn il podcast jifthu l imhuh Grazzi"
    },
    {
        "content": "[NAME] għandha ttiha ghall-psikogija. Narha kapaci."
    },
    {
        "content": "Naqbel hafna ma [NAME], pero ma naqbilx fejn qedq tghid li kull min hu narrcissist ma johrogx minnha. Its all about ir-relazzjoni vera hazina li jkollok mieghek innifsek... li kif qalet hi tkun giet developed early in childhood habba certu trawmi. Jista jaddu hafna snin, pero jekk xi darba jkollok il bajd tiqaf, u tibda tiffacja lilek innifsek u tahdem hafna, dik ir relazzjoni mieghek innifsek tibda tinbidel bil-mod... u iktar ma titjieb u tibda ssib il paci mieghek innifsek, umbad ma jkollokx alfejn tibqa narrsissist. Ma jfissirx li it-traits ma jibqawx hemm, ghax trawma bhall ferita... tista tfejjaqa imma l-iscar hemm tibqa... pero tista tigi f'punt li fl-ahhar tkun in control."
    },
    {
        "content": "Good [SURNAME] [NAME] it's sad your leaving but still wishing you good [SURNAME]"
    },
    {
        "content": "Prosit pero [NAME] tghid li hi connected u tghix il verita pero tmeri,, plus li narrizzmu jista jisvolupa fil bniedem bhal affarijiet ohra. Nawgura lil [NAME]"
    },
    {
        "content": "Prosit [NAME], going from strength to strength"
    },
    {
        "content": "Jiddispjacini imma ghalkemm naqbel mieghek fuq it tielet partit Lammerika stess kull mhemm zewg partiti il bqija individwi hemm"
    },
    {
        "content": "Proset lillhom t Tnejn😊"
    },
    {
        "content": "Proset [NAME]. kemm naqbel mijek. Specjalment fuq din tat 3 partit..."
    },
    {
        "content": "Giex min nies bil 🥚 tafu titkellmu tnejn li intkom proset. Abby tijhom naqa cans in nies ee 🤣"
    },
    {
        "content": "I suggest to [NAME] not to interpret her life wholly from a psychoanalytical point of view. Psychoanalysis is a just a tool. Remain critical or else you risk the process becoming a defence mechanism."
    },
    {
        "content": "[NAME], min hu veru narcissist qadt ma jghid li hu narcissist ghax qadt ma jammetti jew jirrejalizza x'inhu!"
    },
    {
        "content": "Kemm titkellem bis-sens [NAME]"
    },
    {
        "content": "Kemm nammiraha lil [NAME]. Persuna bravissima u taletuza. Kellhi x xorti li nahdem maghha u dejjem helwa maghna. Grazzi [NAME] li stedintha. Jiddispjacini li se titlaq minn Malta. Hija telfa kbira ghalina."
    },
    {
        "content": "My favourite so far!"
    },
    {
        "content": "Grazzi [NAME] vera hadt gost niddiskuti mijak ❤"
    },
    {
        "content": "[NAME] you are an amazing person in/out i beleive you have lots to give this country while i wish you all the best for the future. [NAME] for me she is your top invited person"
    },
    {
        "content": "RITT NAGHMEL KOMMENT GHOGOBNI NARA SHOWS JIEN INHOB. JIEN GHOMRI KOLLU NITRENJA. L-IHOBB ZAQQU, IHOB JIEKOL. L-IKIEL HUWA DROGA, BHAS-SIGARRETTI. SAQSI IT-TABIB TIEGHK. INHOSNI KBURI BIEGHK."
    },
    {
        "content": "Grazzi tal-poddata"
    },
    {
        "content": "Proset [NAME] & [NAME] Thanks for sharing ❤️❤️"
    },
    {
        "content": "Very interesting podcast. IMHO when [NAME] [SURNAME] 'turn the other cheek\" He did not mean physical. protrction against [SURNAME] blows but more protection against the intimidation which this brings about which can. be permanent or traumatic. [NAME] was clearly not intimated by this incident and did not remember the person who sucker punched him which might suggest quite the contrary in that he established a spiritual and hence psychological immunity more than a resistance towards physical violence."
    },
    {
        "content": "Kemm hadt pjacir b dan il podcast. [NAME] [SURNAME] bniedem tan nies, umli u bqalb kbira. Il Mulej ibierkek [NAME] [SURNAME]. Grazzi Ricki."
    },
    {
        "content": "Bniedem tal genn. Keep it up [NAME]."
    },
    {
        "content": "Prosit"
    },
    {
        "content": "flahar qed johorgu in nies li mumix biased jitkelmu ezat lafrijit kin inhmu Proset"
    },
    {
        "content": "Diskussjoni verament interessanti. Issa ghadni kemm qrajt \"Commissioner orders tenor to publish contracts on public funds received\"... nispera li l-verita divina tohrog u min hu fil-hazin ihallas prezz qares ghax xbajt nara tajn itir min naha ghal ohra ghalxejn b'xejn"
    },
    {
        "content": "Podcast interessanti u pjaċevoli bhal dejjem. Prosit"
    },
    {
        "content": "PROSIT Tal program..."
    },
    {
        "content": "Sunset Sundays always on my mind 🎉"
    },
    {
        "content": "Prosit [NAME]. Podcast iehor interessanti hafna. Dj [NAME] ifakkarni hafna fiz-zghozija tieghi. Sunset Sundays u [NAME] & Friends jibqghu ikoniki. Zmien li ma jerga' jigi qatt. Once a clubber always a clubber!"
    },
    {
        "content": "Lets see those hand s in the air c mon 1 2... 123 unz unz unz❤️"
    },
    {
        "content": "Grazzi [NAME] li gibt lil [NAME] f dan l podcast... Wisq fakkarni fl isbaħ żmien ta ħajti... [NAME] L parties tiegħek ma jintesew qatt❤"
    },
    {
        "content": "Legend❤️"
    },
    {
        "content": "Its great to listen to you guys! Prosit for another interesting podcast Well done [NAME] for pivoting and keeping relevant whilst following your passion. ps: i was there at the Rabat party 😂"
    },
    {
        "content": "Proset [NAME] u proset [NAME] … ejja minn hemm … se tqabbadni l-biki zgur … nigi sa hdejk bilfors🎉"
    },
    {
        "content": "Hahaha yes luckily u can sleep when u need where ever u r 😂 and the explosion of energy when awake is out of this world 🌎 😊 Incredible [NAME] 🎶 ❤🎶"
    },
    {
        "content": "llegenda ta zoghzija taghna"
    },
    {
        "content": "Very interesting interview!! [NAME] is an amazing DJ who creates fantastic things!! ❤👍"
    },
    {
        "content": "Ġenwinament nieħu pjaċir nara bniedem bhal [NAME] jkun successful. He believed in it, hadem ghaliha u akkwista dak li dejjem xtaq. Il-Passjoni li ghandu ghal dak li jghamel hija ammirevoli. Prosit Dj [NAME]. Wish you more success. A great positive interview prosit [NAME] wkoll."
    },
    {
        "content": "Thank you Dj [NAME] ❤"
    },
    {
        "content": "Prosit [NAME]. Ma naqbilx mieghek fuq hafna affarijiet (u l-anqas ma [NAME]). Pero dak huwa irrelevanti. L-importanti li hallejt lil guest jitkellem, konversazzjoni interessanti flowing, bla tlaqlieq u bla noti. Podcast host promettenti hafna."
    },
    {
        "content": "L-ewwel podcast li qed nara ta [NAME] (biex nisma lil [NAME]). U minflok kull ma smajt huwa lil [NAME] jajjat u jitkellem fuq [NAME] biex jipprova jimponi l opinjonijiet tieghu. Vera basici u mehudin minn sitwazzjonijiet specifici. L-umilta ta [NAME] tispikka u tibrilla hdejn il presunzjoni ta [NAME]."
    },
    {
        "content": "Fir Russia isiru elezjonijiet forsi mhux fare daqs kemm suppost imma jsiru elezjonijiet generali, ghara ma jaghmilx imhatra dak li ma sirx elezjjoni ghax jitlifa. L aqwa haga li ghandu Putin li mhux falz u mhux laghqi bhal mexxeja kollha taghna. F zmien il covid kienet demokkratika l eu ghax ghamlet iktar min sentejn terrerorizza lin niesha ghal business, Putin ma ghamilx hekk. Jew l ewwel timporta t terroristi fil kontinent imbat taghmel ligijiet kontra l iffinanzjar tat terrorizmu biex b hekk ikollha skuza biex timponi l komunizmu"
    },
    {
        "content": "[USER] l- ewwel nett prosit imma illum nahseb li xi frit jew wisq waqajt fin niexef meta thaddidt fuq id demokrazija. Kont nistenna ahjar minn xi hadd bhalek, bniedem kolt u ta intellett. Xi darba nixtieq illi niltaqaw, nifqaw flixkun whiskey u nithaddtu fuq hafna argumenti varji. Tghamilx l-izball illi taqa fit tentazzjoni li tmeri l ovvju biex tkun tidher differenti!"
    },
    {
        "content": "Jaf jitkellem dan ir ragel. Fil verita nies bhal [SURNAME] mhux iccensurati iridu jigu imma zgur ma ghandiex inkunu qisna fl Emperor's New Clothes fejn il verita qeda quiddiemna imma taparsi ma narhawiex. Jien ma nivvotax u niddubuta qatt nerga nivvotax bit tip ta nies li ghanda fil paliament."
    },
    {
        "content": "Great podcast. Spot on [NAME] 💯 the hypocrisy of the world towards Russia and China, etc, yet America gets away with its propaganda and is the cause of 90% of conflicts in the world. For me, he sits on the fence too much, [NAME]. [NAME] love for you to have a podcast regarding the state of affairs of Palestine."
    },
    {
        "content": "Jien nara kollox u nemmen li Trump l aqwa soluzzjoni, waqt it tmexxija tieghu ma kien hemm l ebda gwerra, b'dan li ghandhom issa qas jaf x qed jigri, pupazz li ma kien kapaci jghamel xejn hlief jiffinanzja l gwerrer u jaqa ghan nejk mal kapi ta' Stat... Trump kienu jibzghu minnu b hekk hadd ma kien jgholli rasu ghal gwerra."
    },
    {
        "content": "Diskusjoni interresanti, nahseb wiehed mil ftit persuni smajtu jajd li ihobb il paganizmu Tal festi, apparti ekk nahseb li tkellimtu fuq naqbel Ma [NAME] li kieku nazel liberalism fuq affariet ohra imma L ahjar L bilanc"
    },
    {
        "content": "meta nara l [NAME] dejjem niftakar fil faldi ta [NAME]!!"
    },
    {
        "content": "Grazzi [NAME] [SURNAME] ♥️"
    },
    {
        "content": "IL DOMINKU [SURNAME] KIEN DEJJEM IHAWLU IS-SIGAR KULLIMKIEN GHANKI FIT-TOROQ TAL FROT. MALTA HEMM BZON LI-KULL GVERN JITLA FIL GVERN."
    },
    {
        "content": "Podcast eccellenti. Tkun tista terga isaqsi dwar l-aesthetic policy tal-bini please?"
    },
    {
        "content": "Podcast mexxej. Raġonevoli. B'messagg ċar li qabel kull fervur politiku, aħna Maltin. Ma jfissirx li hu żball li jkollok idejal, anzi hi ħasra li qed dejjem tikber l-apatija lejn id-dmir li ċittadin jieħu sehem fil-proċess elettorali. Fi żmien meta qed tikber il-pjaga ta' astenzjoni fejn tikkonċerna l-użu tal-vot, innutajt minn dawn il-podcasts li fortunatament fuq iż-żewġ naħat tal-Kamra tad-Deputati hemm elementi validi. Hemm min bir-raġun b'ghemilu qed ixettel il-bruda u joħloq stmerrija. Iżda mal-ħażin m'ghandux jeħel it-tajjeb. Il-vot hu għodda biex l-elettorat jifred il-qamħa mis-sikrana."
    },
    {
        "content": "[USER] meta titkellem fuq l-argument li avukat tal-kriminal ma tarahx postu fil-parlament, gib l-ezempju ta' avukat famuz li meta heles lil wiehed Libjan fuq teknikalita ta' arrest, dan l-avukat hareg bi tbissima fuq wiccu jifrah mal-klijent tieghu quddiem il-media. Avukati bhal dak ma rridx nara li jmexxu lil pajjizi jien, avolja min hu jemmen li anke l-Amerika kapaci jmexxi."
    },
    {
        "content": "Toghobni l idea tal planters u ghal min ma jafx hiehu hsibhom hemm is self watering system 😊"
    },
    {
        "content": "[NAME] dawn largumenti aqlahom meta ikollok xi hadd tal Gvern ha naraw xha iwiegbek. Il PN xorta hija difficli biex ikun fil Gvern ghax soluzzjonijiet mhux vera ittijom bis serjeta u sakemm jibqaw certu nies fil PN hadd mhu ha jafdahom"
    },
    {
        "content": "L ewwel ma trid tinnota min hjandu liktar sahha l politici jew xi 4 kuntratturi biljunarji? Kieku hadna l ezempju ta kif inbniet Santa [NAME] kieku Malta genna."
    },
    {
        "content": "BEAUTY AND BRAINS 😊. [NAME] [SURNAME] you're a genius and so down to earth. Wish you well 🙏. [NAME] you put your guests at real ease ⚖️. Cheers 👍🇲🇹❤️🇪🇺"
    },
    {
        "content": "Podcast nteresanti mmens, pero halli guest jitkelem iktar. Grazzi"
    },
    {
        "content": "[NAME], you can talk with the ministry involved now; there's no need to [SURNAME] for the government to change to help in trees. Also, I'd like to see more political content from the Labour and Independent camps, as it currently seems like you're siding with the Nationalists. Keep up the good work with these types of podcasts!"
    },
    {
        "content": "Il bicca taf xinhi li kwazi nofs malta li jsir merhba bih hekk jirragunaw ha nsemmilek haga zghira mela fethet spazju haz zabbar ta san [NAME] u tinda li hi tinda mhemx!! Imqar imtaqba ta jew merrija xejn ma ghamlet u ghax ktibt kumment ghalfejn ma sarux tined ghax inti tihu pjacir btinda fuq bank tpoggi ghad dell mhux tihu tfal tieghek hemm u hekk tghamel satejn issir vopa mixwija! Tithol wahda tikkumenta fuq il comment tieghi u tghidli hekk trid it tinda mur fejn il bahar🤦‍♂️ igifieri biex [NAME] li lmentalita ta nofs il poplu ijad -10 ta mhux Zero!! U fuq il bini kiku nista nihodlok ritratt ta faccata ta quddiemna imma mhux ihallini hawn faccata griza skura 5 sulari u il kumplament tat triq kulhadd fuq il fil igifieri il PA trid ezorcista tajjeb ghax hlief xjaten mhemx ghax biex tohrog bxi permess hekk trid tkun altru mohhok imtaqqab!"
    },
    {
        "content": "Great podcast. I see a lot of talk from the opposition, but no plan or solutions. In other words, all talk no action. That's the worry going forward, convincing people. [NAME] and [NAME] through is what the party needs."
    },
    {
        "content": "[NAME] il-QUEEEN"
    },
    {
        "content": "Qatt mortu Burano? Rajtuhom id djar kollha kuluri differenti"
    },
    {
        "content": "[NAME], [NAME] qal li inti helwa u lisbah wahda fil parliament. Ha nirrispondieh... Emnu, ghax vera 100%❤❤❤"
    },
    {
        "content": "Proset [NAME] la mal [NAME] 😋 🟥⬛🟥⬛🟥⬛"
    },
    {
        "content": "Tal isptar li qalet jien grali fin 1999 ma kienx hemm post ghalija biex inwelled. Tefghuni got toilet f'Jannar u kif kienet hiergs it tifla qaluli le ghax m'hemmx post u dan kien [NAME] [SURNAME]"
    },
    {
        "content": "L issue tal overpopulation qass il Pn ma jidher jaf kif ha jsolviha. Ghax fil verita n nies gew ghax raw opportunita ta xohol kif ahna ghamilna meta rajna opportunita l awstralja jew il canada. Imbaghad minn dan l influss gawda ftit kulhadd u HAFNA minn gabhom u haddiemhom. Fi zmien li kien hawn l ekonomija stagnata, fl 2010, kieku l pn gabu 20,000 haddiem just kienu ha jimpattaw ic cifri tal qaghad, mhux joholqu x xoghol. Jigifieri biex il pn ikun kredibli irid l ewwel jammetti li n nies gew ghax sabu x xoghol imbaghad jghidilna liema setturi ha jwaqqaf. Tipo allinqas il gvern beda bil y plates, li kif qal [NAME], kulhadd induna li hemm wisq…hlief il pn -ma jmurx jekk isemmiha jurta lil xi hadd. Pero hekk qed juruna li huma more of the same. Bonswa u proset ta xoghlok"
    },
    {
        "content": "Grazzi [NAME] [SURNAME] ❤"
    },
    {
        "content": "HEMM BZON TA EDUKAZJONI FL'ISKEJJEL U FIL KNEJJES GHAX RELIGIONJIET KOLLHA MHUX F'MALTA BISS HAFNA NIES JITWIEDU IMMANKATI ALLA HALAQ LI-MMANKAT?? IN-NATURA"
    },
    {
        "content": "People are all the same about this subject. I live in the States, and there are still a lot of people who [NAME]'t agree with this sort of subject. I think this is in part because [NAME] of the LGBQ are so in people face about their gender."
    },
    {
        "content": "Proset Wend ysirt nafek minn fuq it tv fuq reality show, vera mara sabiha minn barra u minn gewwa, ibqa kif int u thalli lil hadd jipprova jwaqqak down Nawguralek ghal futur sabih u kuntentizza flimkien mar ragel tieghek Sahhiet dear"
    },
    {
        "content": "Kemm ahna socjeta ta nejk li nitrataw persuna b'daqshekk karatru helu u tiehu pjacir tismaha titkellem kellha taghdi min dan kollu habba socjeta ipolarizata min ideat bla bazi u ghanke motija is sahha mil edukazjoni tar religjon antikwata."
    },
    {
        "content": "Mohh maghluq, mhux lest li jinfetah ghal sitwazzjonijiet differenti u \"weird\". Is-socjeta trid tfasslek b'restrizzjonijietbiex ma tesprimix ruhek, biex ma turix int min int vera, ghax jekk int mintix bhal bqija, int hazin. Pero, ma jafux li iktar ma jemarginawk, iktar tisbieh u tiskopri kemm int differenti u ssir thobb lilek innifsek. Niehu gost nara rebbieha bhal [NAME], li rebhet kontra il-ktajjen tas-socjeta."
    },
    {
        "content": "Kemm naqbel maghkhom. Ma nafx x'inhu dal fuss li trid bilfors temfasizza jiena gay jew dak gay. Jiena bniedem. Being gay is not what defines you who you are."
    },
    {
        "content": "Proset [NAME] … kemm hadt pjacir nisimghek titkellem … kemm ghallimtni affarijiet li qatt m'ghaddewli minn mohhi … niftakrek zmien twil ilu f'xi modelling show … Ammirajtek kemm tkellimt sinciera u edukata … Ahna hdimna naqra flimkien dan l-ahhar … u naf ukoll kemm inti persuna semsittiva wkoll ghall-Wirt Kulturali … Ibqa dejjem ferrihija u ENJOY life. Respect [NAME] u grazzi [NAME] talli tajtna din l-opportunita' nitghallmu."
    },
    {
        "content": "Niftakara hal qormi b'xaghra twil u lixx. U kienet misthija hafna."
    },
    {
        "content": "Prosit tassew interessanti immens. Sabih li kullhadd ikun stmat indaqs. Ahna kollha l-istess."
    },
    {
        "content": "Interesting podcast and enlightening for us. 💯 agree on what you [SURNAME] about the dress code [NAME] wear in the gay pride festival not just in Malta to is inappropriate and bring issues on themselves."
    },
    {
        "content": "Podcast interessantissimu li ha johrog gid minnu, lill [NAME] nafa ckejkna minn dejjem sa dejjem kien tifel mill isbah b fattizzi helwin u illum mara mill isbah kont nara f rahal tieghi. [NAME] sabiha minn barra u minn gewwa u minn dejjem sa dejjem nafa izomm ruha ❤"
    },
    {
        "content": "Prosit rickt"
    },
    {
        "content": "U [NAME] [SURNAME] fejn ra jew sema' li \" Koreani tan Nord sparaw fuq in nies \"?? Kullhadd jivvinta w jigdeb..."
    },
    {
        "content": "Prosit [NAME] interessanti"
    },
    {
        "content": "Prosit"
    },
    {
        "content": "Issa ha tiktbu il ktieb ghax ma tistax tirispondik?"
    },
    {
        "content": "Jahasra opportunita bhal din ma [NAME] [SURNAME], u turi kemm kien hawn nuqqas ta fact checking/ricerka f'din l-intervista. Il-prezentatur lanqas jaf x'laqtu, sfortunatament."
    },
    {
        "content": "Well done, [NAME] 👏. [NAME] [SURNAME] would be interesting to have on the podcast."
    },
    {
        "content": "Top..."
    },
    {
        "content": "Prosit [NAME] ghax hargu hafna affarijiet interessanti ghal pubbliku generali"
    },
    {
        "content": "Ax gadàffi kn tana biccs mil ajru Libjana u ahna konna tajniħ biccs mil bahar"
    },
    {
        "content": "grazzi [NAME] talli tghamel daw il podcast, l istejjer jiehdu zvolta ohra, il media tal llum ghall min hu intelligenti mhumiex kredibli,"
    },
    {
        "content": "Interessanti hafna, prosit [NAME]!"
    },
    {
        "content": "Very interesting. [NAME] knew my dad very well."
    },
    {
        "content": "Prosit. Podcast informattiv hafna. Keep it up."
    },
    {
        "content": "Prosit [NAME] vera kien podcast interessanti"
    },
    {
        "content": "Prosit imma hallejtni bil kurzita meta kien QED jitlellem fuq lisptar u staqsejtu xi haga ohra"
    },
    {
        "content": "Wiehed mill-aqwa podcasts. Mistiedna nteressanti."
    },
    {
        "content": "Prosit [NAME]"
    },
    {
        "content": "Thank you"
    },
    {
        "content": "Flahhar sibt podcast tajjeb, ghax ta [NAME] [SURNAME] qallani"
    },
    {
        "content": "Skond kliem [SURNAME], hemm programm iehor zgur specjalment rigward l kaz tas-sigaretti"
    },
    {
        "content": "Dan il-podcast ikun fuq spotify?"
    },
    {
        "content": "Prosit [NAME] vera kien program interessanti"
    },
    {
        "content": "Issa ghandna l kannabis legali minflok."
    },
    {
        "content": "Nixtieq nemmnek sur [SURNAME]"
    },
    {
        "content": "bniedem bravu qatt ma jkun popolari u mahbub mil-[SURNAME]... grazzi [NAME] ta din l-intervista u prosit lil [NAME], li ghalkemm ma naqbilx f'kollox namirrah ferm"
    },
    {
        "content": "Prosit"
    },
    {
        "content": "Illum skoprejt xi bniedem ta' talent kbir dan [NAME]. Ninzalek il-kappell [NAME] ta' kemm tkellimt sincier, onest u umli. Tkellimt il-fatti. Tkellimt is-sewwa bla habi u kantunieri. Tkellimt ta' ARTIST. Bniedem professjonali. Nerga nghidilkom it-tnejn li intom … GRAZZI mmens 🙏🏼👍🏼"
    },
    {
        "content": "Illum tghallimt kemm ma naf xejn. Grazzi [NAME] u grazzi [NAME]. Jiena bhal persuna li nhossni Artist, bi ftit background tal-palk ( fejn ghamilt 4 snin nistudja Acting), inhossni producer zghir ta' dak li qed naghmel bhalissa fuq il-media platforms tieghi … fejn nikkrea stejjer, dokumentarji informattivi ckejknin, script writing, 'acting', filming, kif ukoll post production u promotion … u b'holma kbira li xi darba niffilmja dokumentarju ta' idea li ilha tberren f'mohhi ghal dawn l-ahhar sentejn … illum tghallimt kemm hemm x'taqdef."
    },
    {
        "content": "Il Gagga film Malti 🎥 ta klassi. Hasra qatt ma deher fuq it TV. Xeni sbieh ta Malta fi snin 70"
    },
    {
        "content": "MIL MONTI DIK IL GAKKETTA"
    },
    {
        "content": "Proset ta dan il podcast ibqa sejjer hekk [NAME], we need more like this i suggest to invite [NAME] [SURNAME]"
    },
    {
        "content": "[NAME], haqqek prosit ta dawn il-podcats li qed taghmel, kompli hekk. ma naqbilx mieghek fuq ir-religjon, pero nkun qed nistenna l-podcasts li ttelgha jew li tkun qed tiehu sehem fihom"
    },
    {
        "content": "nixtieq li tamel Film fuq l Assedju il Kbir 1565"
    },
    {
        "content": "Zos Zone of Seperation immens tajjeb tieghu bravu tassew u l Spettur [SURNAME] immens"
    },
    {
        "content": "Tghalim kontinwju. Dan il podcast ghandu ikun ipublikatt hafna prosett"
    },
    {
        "content": "Drama maltija ta tv medjokrita tboss"
    },
    {
        "content": "Veru prosit [NAME]. [NAME] bniedem għaref u għalhekk jgħaddi milli jgħaddi. Malta jiġi biss għal imħabba u l-passjoni tiegħu lejn dak li hu Malti."
    },
    {
        "content": "Grazzi lil [NAME] [NAME] [SURNAME] ta diskussjoni informattiva tieghek."
    },
    {
        "content": "[NAME] [NAME] [SURNAME], mohh bravu immens. Proset [NAME]. Proset ukoll [NAME]. Mhux qed nahlu l hin."
    },
    {
        "content": "Kemm int bravu"
    },
    {
        "content": "F'[NAME], il-Partit Nazzjonalista għandu sur. Laqtuni l-aħħar batuti tal-podata. Politiku għandu jżomm f'moħħu li qabel hu aħmar, blu, aħdar hu Malti għax b'hekk biss ikun kredibbli u jirbaħ l-appoġġ ta' l-elettorat. Irid jagħraf it-tajjeb anki f'dawk li jħaddnu ħsibijiet differenti minnu u jixpruna ideat fl--aħjar interess tal-pajjiż."
    },
    {
        "content": "Prosit ta' dal-podcast [NAME]. Nies bhal [NAME] u [NAME] ghandhom jigu aktar rikonoxxuti tax-xoghol volontarju kollu li jaghmlu ghalina lkoll. Il-passoni li ghandhom huwa impressjonanti u hasra ma jsibux appogg mill-ministeru koncernat."
    },
    {
        "content": "Biex tnaqqas in nies triq mudel ekonomiku li jrendi pagi tajbin sabiex il Malti jaghmel ix xoghol li llum qed jaghmlu dawk li hafna minnhom ġejjin mil Asia. Inhoss li l-pn m ghandhomx pjan ċar u nasal nghid anke volontà biex tonqos il popolazzjoni. Biex issahhah l infrastruttura Malta tibqa' works in progress."
    },
    {
        "content": "Metro ma jahdem qatt f malta. Min se jidhol ghal tender biex jiehu metro f idejh f pajjiz daqs naqra. Kemm se jkun biljett biex twaslek f post 2 min boghod? u jekk ejja nghidu ikun irhis. Kif se jfendi l ispejjez u jaqla l flus? ma tahdem qatt u jekk isir ikun gimick ifalli mil ewwel bhal arriva ta AG"
    },
    {
        "content": "Ma nahsibx li il goal huwa l importanti. Imma il pjan biex tilhaq il goal. #jekk trid ekonomija b sahhita ghandek bzonn lin nies ghax il popolazzjoni li kellna mhiex bizzejjed biex tmexxi pajjiz b ekonomija b sahhita."
    },
    {
        "content": "sirt nisma iktar lilek mill podcast ta [NAME]"
    },
    {
        "content": "Proset [NAME] … vera tkellimt bis-sens u bil-lingwa taghna … dik tat-triq. Nixtieq inkun naf x'vizjoni ghandek inti fejn jidhol Wirt Kulturali bhal-Qbajjar Battery ezempju, shelters li jinsabu mirduma u qed ikomplu jigu abbandunati as we speak … ;("
    },
    {
        "content": "Prosit... Kurzita zghira [NAME]... Ghala ivvutajt PN fit 2013 jekk int stess qedt li lahhar 5 yrs tal PN fil Gvern kienu dizastru??"
    },
    {
        "content": "in other words il population mi ha tonqos qatt!! M ghandniex bzonn metro, m ghandniex bzonn nivvintaw xejn aktar, jekk innaqsu 150 elf ruh nigu kif konna qabel!!"
    },
    {
        "content": "KIEKU L-AWSTRALIA TKECCI IL-MALTIN U L-GHAWCIN GHANKHOM FEJNTILQONA, L-INGLISI QATT KECCEJTHOM DOMINKU [SURNAME] KELLU L-KURAG U KECCIJIEHOM. U KULLHAD KONTRIEH... [NAME] [SURNAME] BHALA SPORTS NAQBEL MIEGHU"
    },
    {
        "content": "MALTA DEJJEM SA TKUN OVER POPOLATION, IL-MALTIN IRIDU IMORRU FLAWROPA."
    },
    {
        "content": "[NAME] [SURNAME] KIF SAR MEXXEJ QAL DAWK LI MA GEWXSA IMMUR PERSONAL U MAR DOMINKU [SURNAME]. IL-CAPO MA MAR GHAND HAJJ E BEK REBAH IL-MUVIMENT."
    },
    {
        "content": "Jien ghandi fuq is sittin u narom il podcasts specjalment ta [NAME] u [NAME], nispera li il mentalita tal politika tinbidel u jkollna tmexxija ghaqlija"
    },
    {
        "content": "metro... lanqas konna kapaci naghmlu sistema tal-linja sura ahseb u ara metro! lanqas ideja x'qed jigri fit-triqat ma ghandkom!!"
    },
    {
        "content": "tal-posta jiddependu fuq il-haddiema barranin? allura qabel kif kienu jmexxu? qabel biex tidhol pustier kienu jitolbu ezamijiet u zbub, u issa lanqas hemm bzonn tkun taf taqra in-numri tal-bibien!!"
    },
    {
        "content": "meta tghasar it-tidwir tal-kliem taz-zewg partiti, dejjem tinduna li ma jridux inaqqsu l-overpopulation ghax huma laghqa tal-businessmen! mela allura ser ikolli nghid il-famuza frazi... nivvota zobb!!"
    },
    {
        "content": "Great podcast. He spoke well, [NAME], and most importantly, his going out there listening to people taking it on board. His [SURNAME], hungry, and eager to work."
    },
    {
        "content": "Ghaw bzonn hafna iktar politikanti bhal [NAME] [SURNAME] 👏👏"
    },
    {
        "content": "Grazzi [NAME] [SURNAME]. Bniedem li jalla ikun hawn hafna iktar bhalek fil politka."
    },
    {
        "content": "2019 kont ghadni gej lura Malta wara xoghol ta irham li ghamilt madwar UK kollha. Restawr ta knisja tal Birgu San Lawrenz u bini zuntier ta knisja zurrieq 2007 Tlabt lil ministru biex jofrijli xoghol Mal Heritage Malta biex nofri servizzi tieghi lejn kultira. Kien fil bidu Palazz tal president il belt. Taf x kienet il twegiba tal ministru ghax ma ghandhiex kwaliefiki f Sena ta irham. Barranin kwaliefiki foloz u ma jafhux Sistema tal ninja Maltija dawk jigu impjegati ghax Barani!! Vera injoranza Grassa"
    },
    {
        "content": "Proset Ta Veru. U proset Rick"
    },
    {
        "content": "PROSET HAFNA 🙂❤️👍"
    },
    {
        "content": "proset ta vera suggett li mux sija u nofs imma xhur jirikjedi. sfortunatament il generazzjoni li ghandna ma jimpurtaha xej mil istorja ta malta kif immutu ahna li ghandna 40/50 nahseb listorja ta malta tisparixxi... keep it up u grazzi ta linformazzjoni"
    },
    {
        "content": "Misshom jirrikonoxxu xogholkom mhux jarawkom treat veru interessanti kemm ghandna gahwriet f artna u kemm hemm izjed ma nafux bihom grazzi ta l informazjoni."
    },
    {
        "content": "Vera interessanti u grazzi tax xoghol taghkhom"
    },
    {
        "content": "Persuni bhal [NAME] u [NAME] huwa persuni li ghandhom bzonn jigu iktar ivvalorizati, mhux biss ghar-rickeri u l-gharfien, imma kif ukoll ghal idejat ta' x'jista jsehh minn dawn il-postijiet storici illum il-gurnata. Prosit tal-Podcast [NAME]!"
    },
    {
        "content": "Jekk kuntrattur isib l imhaffer lest gost jiehdu, xghala zo***"
    },
    {
        "content": "Keep them coming [NAME]."
    },
    {
        "content": "Prositt ta program"
    },
    {
        "content": "Proset hafna ta xogholkom. Proset ukoll [NAME] ta' dawn l-intervisti ferm interessanti. Xtaqt nsaqsi lil [NAME] u [NAME] jekk ghandhomx xi informazzjoni fuq il-forti zghira maghrufa bhal ir-Rook bejn il-bajja tal-Qbajjar u ix-Xwejni, Ghawdex. Fil-passat din kienet diskoteka u meta sa fejn naf jien giet lura ghand Heritage Malta dan il-post safa abbandunat u ivandalizzat. Nixtieq inkun naf jekk ghandkomx xi informazzjoni fuqha. Grazzi hafna. [NAME]"
    },
    {
        "content": "Teachers iridu jkunu attrajenti u surit in nies mhux ishom sid il kera... trid tkun sod mat tfal imma trid tkun interessanti. Kelna teacher tal enviornmental TAL OSTJA pero kelna iehor isu litteralment ir ras li insa li ha jati kas student. Fis sekondarja ma tistax tallem isek ed tati lecture."
    },
    {
        "content": "proset hafna, pero jekk ikollom paga, isiru parti mis sistema..."
    },
    {
        "content": "Kemm ghadna lura hanina dinja. Keep up the good work."
    },
    {
        "content": "Proset tax xoghol li tamlu u [NAME] top proset nihu gost nisimak"
    },
    {
        "content": "Korrezzjoni zghira meta semmejt kemm ġew jiswew il-proġetti ta' riġenerazzjoni ridt nghid miljuni u mhux eluf :) grazzi talli segwejtu dan il-podcast."
    },
    {
        "content": "Prosit napprezza jekk jigi [NAME] jitkellem fuq IL programm tieghek."
    },
    {
        "content": "Bravu."
    },
    {
        "content": "Prosit [NAME] u [NAME]!"
    },
    {
        "content": "Proset, imnalla jkunu dawn it tip ta podcast biex issier taf naqa verita"
    },
    {
        "content": "Interesting podcast. [NAME] fantastic points straight talking guys how it should be. Needs a reform."
    },
    {
        "content": "Fejn nista insibu Limestone cowboy?"
    },
    {
        "content": "intervista interessanti hafna u wiehed jitghallem kif tahdem verament fl-industrija tal-films. [NAME] Maġi straight to the point u [NAME] mexxa b'mod eċċellenti bħas-soltu."
    },
    {
        "content": "Prosit!! Huwa vera ta' bzonn lil jkollna nies bhal [NAME] li jispjegaw x'inhu vera jigri ghax sfortunatament l-mainstream media mhux qedin jitfaw dawl fuq dawn l-aspetti! Grazzi kbira wkoll lil [NAME] talli qasam din l-intervista maghna 😊"
    },
    {
        "content": "Sew qed titkellem!"
    },
    {
        "content": "Sagħtejn bis-sens. Prosit [NAME]. [NAME] xprunajt lil [NAME] li għamel overview san tax-xenarju politiku u ekonomiku f'pajjiżna. Fakkarni f'zoghziti kemm konna niġru wara l-Perit Duminku [SURNAME] meta qalilna kif minn żogħżitu daħal fil-pulitika biex jgħin għal qawmien mill-ġdid tal-Partit Laburista wara dawk is-snin twal fl--Oppożizzjoni (1987 - 2013,salve1996-98). [NAME] ta rendikont pożittiv ta' x'ghamlu Gvernijiet Laburista mill-2013 'il hawn. Ammetta li mhux kollox kien ward u żahar, imma kumplissivament kien pożittiv. Stqarr li fadal xi jsir u nkoraggixxa ucuh godda jersqu lejn il-politika biex f' ambjent iktar bilancjat u responsabbli tkompli l-ħidma fl--aħjar interess tal-pajjiż."
    },
    {
        "content": "Grazzi sur ministru tal pajjiz li fottejtu. Issa nizfnu mad-diska ikollna"
    },
    {
        "content": "[NAME] ekonomista bravissimu."
    },
    {
        "content": "Jien ma vvuyajtx habba l over population. Qatt ma kienet ili nivvota iktar minn 40 sena"
    },
    {
        "content": "Podcast interessanti ħafna. Il-Ministru milli qal jidher li għandu intenzjonijiet tajba però bil-fatti għad fadal ħafna x'jitranġa. Jalla ma jitħammiġx u jżomm sod mal-prinċipji tajba mhux bħal ħafna minn sħabu. Grazzi [NAME]."
    },
    {
        "content": "[NAME] wiehed mil ftit membri politici li huma mohhom miftuh u jghid is-sewwa"
    },
    {
        "content": "When you say a lot and say nothing at all, overpopulation issue is an urgent one and needs immediate response"
    },
    {
        "content": "IL-KAPITALIST IRID 3%QADQ, META IKOLLU BZON JIMLA POSISION FIL PRONT"
    },
    {
        "content": "Outstanding Podcast, Keep it up [NAME]."
    },
    {
        "content": "Ahseb u ara l paga tal man in the street kemm hi cuccata! il bqija naqbel mieghek"
    },
    {
        "content": "Nisperaw li xi darba narawh il kap tal partit lil [NAME]"
    },
    {
        "content": "Inellimlek [NAME] dejjem insegwik il gvern qieghed jaghmel hafna incentivi pero l mod ta kif jaghmluhom mhux jinhass ghand iz zghar. Ez susidju tad dawl ghal penzjonanti, stupendju ta 120euro fix xahar ghal guvni ta 18 il sena, customer care fil ministeri u entitaijiet vera baxxa u nuqas ta tarif fuq is sugget, ghajnuna ghal faccati antiiki u hafna aktar affarijiet grazzi u prosit"
    },
    {
        "content": "Qisu huta kemm jizloq mil-mistoqsija propja. Politiku hu xinhu, jdur mal-lewza."
    },
    {
        "content": "Prosit [NAME] Ħadd pjaċir nismagħha il ministru kont naħsbu aktar imkabbar u kiesaħ u illum inħares differenti lejh veru spjega tajjeb... Jien il weġgħa tiegħi over population ukoll"
    },
    {
        "content": "Great interview, [NAME]. Love for you to interview [NAME] [SURNAME] from Għawdex to get his perspectives."
    },
    {
        "content": "Iz zaghzagh idejqu jisimghu 'kullhadd' korrot' jew dejaqhom il fatt li ikun hemm koruzzjoni?"
    },
    {
        "content": "So all those people in parliament are not quality? Hemm naqbel mieghek"
    },
    {
        "content": "Il-mistoqsija ghalik Sur ministru hija wahda semplici. L'interess tieghek fil-qasam tal-ekonomija Maltija hija ghal partit u kemm jista jdahhal flus biex ikun eligibli ihallas id dejn ta' hafna progetti zejda, li pajjiz ma kellux bzonn jew biex tghin lil poplu Malti!? Onestament l ekonomija Maltija f'dawn l'ahhar snin qieghda l'izjed hemm ghal barrani mhux biex intejbu l hajja taghna l-maltin! grazzi ghal gabna l partit laburista jien spiccajt tlaqt min Malta ghax hassejt li l'barrani rispettat izjed minni, gewwa pajjizi!"
    },
    {
        "content": "Grazzi lil onorevoli Ministru tal-Ekonomija [NAME] [SURNAME] ❤"
    },
    {
        "content": "Persuna brava li Malta tkun ahjar jekk wiehed jaghti cans lil nies bhalu."
    },
    {
        "content": "Prosit keep it up [NAME]."
    },
    {
        "content": "Podcast interessanti u prosit li taghti lehen lill-indipendenti, imma [NAME] ghandu bzonn jiftakar li l-podcast tieghu imma qed iggib il min jitkellem u mhux biex jghid tieghu ghax lilu smajtu kemm il darba. Probabli ha tghid dan il poddata tieghi u naghmel l-irrid, imma xorta xtaqt nsemma lehni."
    },
    {
        "content": "wasalna f punt li jekk hadd mhu ha jkollu l bajd jghid li rridu naqqsu din il hmerija tat tkabbir u pika, il maltin iridu jahdmu? worthed jahdmu l maltin? meta barrani jhallas inqas taxxa jew xejn? worthed malti jinvesti meta kif tgholli rasek issib mingel jaqtahhilek biex jahtaf minn fuqek? nies bhall [NAME] irridu u mhux avukati b kilba ghal poter u giddibin bi prfessjoni!! sakemm jibqaw kunsilli bil partiti ma nivvutax! sakemm l elezjoni generali tibqa bid distretti ma nivutax lanqas!! qeda mahduma ezatt biex jibqaw jirenjaw u jahtfu!! ga telqu hafna maltin u ohrajn ha jitilqu (inkluz jien l hemm riesaq) issib min jghidlek mur u tigix, mhux problema fejn jirenjaw gdur ta dik il kwalita mhux post li lant tahli hin u sahha fuqu!! [NAME] u nies bhalu huma lunika ragg ta tama ghall pajjiz! mhux [SURNAME] ghax dak ukoll jizgarra kif jibda jizbel u jghajjar imma hemm ohrajn u anke mal partiti pero jibzaw!!"
    },
    {
        "content": "IL FUTUR TA MALTA! Keep it up [NAME]!"
    },
    {
        "content": "u ghamilna in numru 12 siehbi"
    },
    {
        "content": "meta hraqtu il fleurs [SURNAME] fl elezzjoni"
    },
    {
        "content": "bniedem tal genn umli u qalbu tajba tislijiet"
    },
    {
        "content": "Kemm hu helu dal-guvni, ghad hawn zaghzagh tajbin u edukati f dan il pajjiz. Prosit u grazzi."
    },
    {
        "content": "Proset Guys! Very well [SURNAME]! Ejja Rick int jmiss ghaz-Zurrieq"
    },
    {
        "content": "Tellghuk in-nies ghax TAHDEM MIL-QALB u bniedem down to erath. Bniedem ezemplari hafna!"
    },
    {
        "content": "hemm bzonn forza bejn nies bhalkom biex tiggieled lil-forzi suwed li huma l-pl u l-pn. Cert li jekk tifformalizzaw xi haga l-appogg jigi. GHANDNA BZONN PARTIT IEHOR"
    },
    {
        "content": "There is nothing different from being independent or affiliated with a political party. The Mayor should always be the group that generates the most votes. Obviously, [SURNAME] [SURNAME] did not get more votes than the Labour party. The local council system in Malta works by seats which is totally ridiculous. Democracy failed."
    },
    {
        "content": "Enjoyed the podcast. His a breath of fresh air hungry and understands the community. We need more like him."
    },
    {
        "content": "Prosit imma nixtieq insaqsi xi haga... Kif trid taqqad lindipendenti jekk it twemmin tahom mhux listess?"
    },
    {
        "content": "Prosit u grazzi lit tnejn li intom. Tama gdida meta nismaghkom❤"
    },
    {
        "content": "[NAME] il quddiem ghorganiza get-together ta dawn in nies indipendenti... so biex inkunu nafhuhom seww... PROSIT ta kollox sabieh xxxx illejl it tajjeb lilkom 💗 🤗"
    },
    {
        "content": "Mela jiena proud li vutajt lil yellow... PROSIT U hemm bzonn li jinaqdu U joholqu partiet... PROSIT. Ghadu zghir U ghandu xjofri... jiena kont namirah lil zijuh ghax kien genwin ta veru... Baravissimu U nawguralhu..."
    },
    {
        "content": "Grazzi [NAME] -- u Grazzi [NAME], ghalerwieh naqra arja friska u tama. Nisma lilkom nerga nibda nittama li forsi xi darba Malta tkun hielsa mit-Tribalizmu u mill-mibgheda politika. Ghajjejt f'dal pajjiz imma nibqa hawn ghax lil Malta inhobba, iebsa [NAME] dan t-tkissir kontinwu, disrispett lejn l-ambjent, lejn l-identita u l-kultura taghna. Pjanar ta'xejn kollox ibbazat fuq numri, serjeta xejn, gungla -- imma ahna jisthoqilna hekk?? jien kont wahda minn dawk it 33k u j'alla xi darba dan il-poplu jiftah mohhu u veru jibda juri imhabba lejn pajjizu u mhux lejn partit mahmug u korrott! u kellu bzonn ukoll hawn hafna aktar ' Steves ' f kull kunsill lokali"
    },
    {
        "content": "Prosit lit-tnejn!"
    },
    {
        "content": "Zewg personaggi importantissima ghal pajjizna. Prosit u komplu hekk, grazzi hafna."
    },
    {
        "content": "Taf li hekk bdejt nghid meta mortu f' ta [NAME]. Ghedt kemm jaqblu fli tghidu."
    },
    {
        "content": "Watching from Melbourne ❤"
    },
    {
        "content": "Is 7 fejnu please mhux nsibu"
    }
]