[
    {
        "content": "Meta fittixna summer job, la jien u lanqas shabi ma stajna nsibu xogħol b'iżjed minn 4 e is-siegħa (illegali li tħallas b'inqas mill-minimum wage).",
        "sentence_number": 1
    },
    {
        "content": "Is-summer jobs tal-iskema tal-gvern farsa sħiħa.",
        "sentence_number": 2
    },
    {
        "content": "Bażikament jibgħatuk f'post bla ac fejn tagħmel jumejn tipprova ssib x'inhu xogħlok għax ħadd ma jkun ippreparat li ġejjin l-istudenti.",
        "sentence_number": 3
    },
    {
        "content": "Xħin jindunaw li bagħtulhom studenta, tispiċċa jew taħli l-ħin jew titgħabba bix-xogħol ta' xi ħaddiem li jħallik tinqela bil-filing u hu jiġri barra.",
        "sentence_number": 4
    },
    {
        "content": "Inkella jibgħatuk tgħallem is-summer school - tliet persuni ta' 17, bla kwalifikazzjonijiet pedagoġiċi u b'responsabilta' enormi li jieħdu ħsieb madwar 15-il tifel u tifla... S'issa kont fortunata li ta' 16 ilni naħdem mindu kelli 14 fit-turiżmu... U xorta bqajt nitħallas kważi xejn minkejja li għandi esperjenza vasta u nitkellem tajjeb erba' lingwi :/.",
        "sentence_number": 5
    },
    {
        "content": "Min naħa l-oħra ma tagħtix tort lill-employers diċenti - ftit minnhom lesti li joffru training għall-ħaddiema li lesti biss għal xahrejn ta' sigħat flessibli fis-sajf :/.",
        "sentence_number": 6
    },
    {
        "content": "Il-Malti qaddis m'hux, imma jiekol irid ukoll.",
        "sentence_number": 1
    },
    {
        "content": "Jekk ittih xogħol jaqla' l-bażwa imma ttih paga ħmerija ttih tort ma jkunx irid jaħdem?",
        "sentence_number": 2
    },
    {
        "content": "Din hija skuża li tinsab kullimkien.",
        "sentence_number": 2
    },
    {
        "content": "Tfisser \"Hadt ma jridd jahdimli ghal paga baxxa u benefiċċji ta xejn\".",
        "sentence_number": 3
    },
    {
        "content": "Konna jien u xi ghaxar indjani.",
        "sentence_number": 2
    },
    {
        "content": "Il hanut kellu aktar affarjiet ma jahdmux mili jahdmu u ara biss ifetilek titlobom gurnata off ghax jigu bil paroli.",
        "sentence_number": 3
    },
    {
        "content": "Ghadew tlett snin u dejjem ghamilt servizz tajjeb u il paga kull ma zdiedet b' 1.50.",
        "sentence_number": 5
    },
    {
        "content": "Itelghalom ix xoghol u jitilaw is sales u tismahom jifirhu bl eluf li ghamlu waqt li int qed tahdem ma nies li qas biss jafu jinhaslu huma stess ahseb wara platt.",
        "sentence_number": 6
    },
    {
        "content": "Tithalas daqsom u jekk isaqsi ghal kundizjonijiet ahjar jghidulek jekk ma togbokx itlaq.",
        "sentence_number": 7
    },
    {
        "content": "Tahseb li malti se jghix bdan il hassle?",
        "sentence_number": 8
    },
    {
        "content": "Le mhuwiex.",
        "sentence_number": 9
    },
    {
        "content": "Tahdem u qas tkun tista taffordja id dar jew karozza, ahseb u wara trabbi familja, xinu il punt?",
        "sentence_number": 1
    },
    {
        "content": "Might as well ma tamel xej u tibqa toqod id dar mal genituri.",
        "sentence_number": 2
    },
    {
        "content": "Fi zmien missieri waiter kien jaqla biz zejjed biex jejx hajtu full.",
        "sentence_number": 3
    },
    {
        "content": "Daz zmien tahdem u qas ikollok biex tejx.",
        "sentence_number": 4
    },
    {
        "content": "Taghmilx ix xoghol tal gvern u mir aghmel il part-time u tiddikjara xejn.",
        "sentence_number": 4
    },
    {
        "content": "Top tips ta fejn titfa il flus li ma tiddakjarax:.",
        "sentence_number": 7
    },
    {
        "content": "Karozzi, anzi jekk tibda timporta u tbiegh int ahjar.",
        "sentence_number": 8
    },
    {
        "content": "Haddem erba indjani u tihom karozza y plate biex jahdmu ghalik.",
        "sentence_number": 9
    },
    {
        "content": "Ikri il proprjeta lil istess haddiema tieghek biex bhekk il flus li qed ittihom terga tehodhom lura.",
        "sentence_number": 10
    },
    {
        "content": "Nahdem p/t ma ristorant, gili ghamilt il-pre-interview nghidulu, incempel/nibghat email lill-min japplika.",
        "sentence_number": 1
    },
    {
        "content": "Minn l-ahhar batch ta 50 persuna ghal waiter li applikaw, 24 maltin, 26 barranin.",
        "sentence_number": 2
    },
    {
        "content": "Grupp minnhom available all days, u lesti jaghmlu xoghol \"zejjed\" tipo jahslu platti jekk jkun hemm bzonn (bl-istess paga ta waiter u bid-dishwasher) u li hemm bzonn.",
        "sentence_number": 3
    },
    {
        "content": "Grupp iehor, ghax jien vegan ma mmissx platti bil-laham, ghax sibtijiet ma nahdimx, ghax il-boghod (15-20 minutes karozza matul il-gurnata, ahseb u ara filghaxija xhin tlesti biex tmur lura), ma nahsilx platti.",
        "sentence_number": 5
    },
    {
        "content": "Iehor kull data li offrejtlu ghal interview, kelli 3, ma nistax, ma nistax, ma nistax - kompli pappija mal-jobsplus mela, ohrajn b'kazijiet il-qorti ghadhom ghaddejin inkluz glied/serq etc - marridx trouble, - 5 ha jimxu ghal interview.",
        "sentence_number": 6
    },
    {
        "content": "Issa ha jkunu 16 barranin u 5 maltin ghal istess position - min tahseb ha jkollu izjed cans jigi impjegat?",
        "sentence_number": 8
    },
    {
        "content": "Ps isbah jkunu zaghzagh hergin mill-iskola, ma jafux jzommu platt/ jiehdu order u jippretendu xi € 10 is-siegha u weekends le.",
        "sentence_number": 9
    },
    {
        "content": "Jien ma niddiskutiex pagi ghax miniex management per se, imma ghandi idea hux u ovvja mhux ha jhallsu hekk, ghal li qed joffru.",
        "sentence_number": 10
    },
    {
        "content": "Mhux veru li ma iridux jahdmu.",
        "sentence_number": 1
    },
    {
        "content": "Dan l-iskuzi jintuzaw mad-dinja kollha min nies li ma iridux ihalsu pagi dicenti jew li jippretendu l-alla min nies.",
        "sentence_number": 2
    },
    {
        "content": "Huwa fatt li il pagi mhux tajbin imma huwa fatt ukoll li qghad ma hawnx.",
        "sentence_number": 1
    },
    {
        "content": "Il mistoqsija tiegħi hi fejn qed jaħdmu il Maltin?",
        "sentence_number": 2
    },
    {
        "content": "Lebda malti ma ikun jixtieq jaqla l bajt biex jiehu €4 is seigha meta specjalment ikollu xi ihallas imma il barani jigi jitmellah alih €4 is siegha tajbin hafna meta pajjizu jithalas bit tuffieh u xi kabocca, bara min hekk il barani madux problema biex ihallas il kera aliex huma ikunu 6 jew 8 gol flat u €800 fix xahar kera huma farsa bejn 8 ( €100 IR RAS ) imbad imorru jibatu flusna pajjizom... u jien il loan tieghi €700 fix xahar wahdi.",
        "sentence_number": 1
    },
    {
        "content": "Hekk irid min ihaddem.",
        "sentence_number": 2
    },
    {
        "content": "DIK IS SITWAZJONI L AHWA.",
        "sentence_number": 4
    },
    {
        "content": "\"Tini l-paga, imma x-xoghol zommu ghalik\".",
        "sentence_number": 1
    },
    {
        "content": "Mihiex xjenza tar-rokits.",
        "sentence_number": 6
    },
    {
        "content": "Jien naħseb li il-Malti huwa mfissed.",
        "sentence_number": 1
    },
    {
        "content": "Għandu modi kif jdaħħal paga xorta jekk jirreġistra mal-jobs plus.",
        "sentence_number": 2
    },
    {
        "content": "Waqt il-pandemija, jien kont wieħed minn dawk li spiċċajt mkeċċi mix-xogħol minħabba li kont naħdem fit-turiżmu, mort nirreġistra u għażilt x'naf nagħmel pero meta gew l-opportunitajiet qatt ma sfurzawni.",
        "sentence_number": 3
    },
    {
        "content": "Kien żmien fejn kont ridt nixtri post u ridt nieħu loan allura paga rreġistrata kelli bżonn.",
        "sentence_number": 4
    },
    {
        "content": "Li kieku ma kelli l-ebda interess niehu loan, faċilment kont nibqa nirreġistra u naħdem fuq l-idejn ma xi kuntrattur u naqlagħa sew u jekk ġiet il-festa ma mortx xogħol għax 'ma ġara xejn' hemm il-pagament tal-jobs plus dieħel.",
        "sentence_number": 5
    },
    {
        "content": "Meta jiġi għal-restaurant, nagħżel li nerġa nmur fejn hemm il-Malti imjegat.",
        "sentence_number": 6
    },
    {
        "content": "Għawdex s'issa mhux ħażin!",
        "sentence_number": 7
    },
    {
        "content": "Allura ghaliex meta nohgrog application Maltin japplika wiehed biss u xi 70 Indian?",
        "sentence_number": 1
    },
    {
        "content": "Incempillu ghal interview u jiggieled mieghi biex ma jigix?",
        "sentence_number": 2
    },
    {
        "content": "Pagi dejjem thallsu tajjeb u overtime kemm felhu.",
        "sentence_number": 3
    },
    {
        "content": "Ma nistax nifhem ghax kieku offrejt paga hazina pacenzja imma li qas application!",
        "sentence_number": 4
    },
    {
        "content": "Il malti bla skola mal gvern jahdem.",
        "sentence_number": 1
    },
    {
        "content": "Bhal malta pajjizi ohra, Missieri kien immigrant l awatralja ax il local mhux ser jahdimlek xol iebes.",
        "sentence_number": 2
    },
    {
        "content": "Din hija xi haga li trid taddi minnha kull pajjiz sfortunatament.",
        "sentence_number": 3
    },
    {
        "content": "Il malti irid jahdem!",
        "sentence_number": 1
    },
    {
        "content": "Jekk mhux sejjer zball min ta pajjiz ta nofs miljun 900 biss qedien fuq relief.",
        "sentence_number": 2
    },
    {
        "content": "Ovjament la hafna mill-maltin ghandhom skola ma nippretendix li jispiccaw jahdmu tal-bolt jew xi xoghol ta tqandil.",
        "sentence_number": 3
    },
    {
        "content": "Hemmekk imbghadt qed jingabu l barranin, ghax il-malti jippreferi xoghol fuq desk mit-tnejn sal-gimgha milli xoghol fi shana jew fxi weekend.",
        "sentence_number": 4
    },
    {
        "content": "U xi nghidu ghal jobs gewwa l-lukandi.",
        "sentence_number": 5
    },
    {
        "content": "Jien sa 5 snin ilu kont immur waiter go lukanda u barman fit-tigijiet bhala part time wara uni.",
        "sentence_number": 6
    },
    {
        "content": "Anzi kullhadd jitlob il papa jew mama ghal xi karozza jew ghal xi iphone.",
        "sentence_number": 8
    },
    {
        "content": "Vera mhux xi paga wow imma come on da tgergir fuq il-barranin mhux gustifikat anzi qedien ibaghtu 24/7 skapitu ta erba bazuzli maltin.",
        "sentence_number": 9
    },
    {
        "content": "L-argument li \"ħadd ma jrid jaħdem\" huwa argument qadim daqs il bniedem stess (anka kitba fil Mesopotamja antika issibha din!",
        "sentence_number": 1
    },
    {
        "content": "Li żgur hija li l-malti ma jridx jaħdem biċ-ċiċri.",
        "sentence_number": 3
    },
    {
        "content": "Le ghax il-Maltin ma jridux ihallsu sura ta nies.",
        "sentence_number": 1
    },
    {
        "content": "Ma nafx Malti minghir xogħol honestly.",
        "sentence_number": 1
    },
    {
        "content": "Eżatt.",
        "sentence_number": 1
    },
    {
        "content": "U dan mhux fil catering biss jigri hekk.",
        "sentence_number": 1
    },
    {
        "content": "L-effett qed jinhass fkull industrija.",
        "sentence_number": 2
    },
    {
        "content": "Diga hawn inginiera Indjani li jahdmu ghal nofs il prezz, f kundizzjonijiet hafna aghar.",
        "sentence_number": 3
    },
    {
        "content": "Minn ha jiggwadanja hawn?",
        "sentence_number": 4
    },
    {
        "content": "Mhux il-haddiem Malti zgur.",
        "sentence_number": 5
    },
    {
        "content": "Hepi kejk [SURNAME], kejki twin!",
        "sentence_number": 1
    },
    {
        "content": "Did police investigate?",
        "sentence_number": 5
    },
    {
        "content": "Dejjem qist li jekk inkun barrani infittex xogħol f'pajjiż ieħor ikolli iktar ċans inġebbed ftit il-verita fuq il-passat tiegħi.",
        "sentence_number": 1
    },
    {
        "content": "Inqas ċans li min iħaddem ikun jista jiċċekja id-dettalji eżatti.",
        "sentence_number": 2
    },
    {
        "content": "Meta tkun Malti tapplika għal job f'Malta min iħaddem b' xi mod jew ieħor ikollu d-dettalji ta l-istorja tiegħek kollha.",
        "sentence_number": 3
    },
    {
        "content": "Żvantaġġ naħseb.",
        "sentence_number": 4
    },
    {
        "content": "Eżempju jekk ikun jaf li mhux ġej minn tat-tajjeb jaf li jista jażżarda joffrilhek paga inqas.",
        "sentence_number": 5
    },
    {
        "content": "Jien u il mara ghandna hanut ukoll u bhalek nahsbuha.",
        "sentence_number": 1
    },
    {
        "content": "Nzabbab mhux nafda il hanut f'idejn min kellu kazijiet il- qorti.",
        "sentence_number": 2
    },
    {
        "content": "Il hanut taghna naqra niche trid tkun tifhem fih biex tahdem u tbieh allura difficli nsibu.",
        "sentence_number": 3
    },
    {
        "content": "Pero iz- zibel ta cv's li jibatu certu maltin tal blieh.",
        "sentence_number": 4
    },
    {
        "content": "Min 10 jekk ikollok 1 sura difficli.",
        "sentence_number": 5
    },
    {
        "content": "Il- ftit li nsibu bl- iskuzi.",
        "sentence_number": 6
    },
    {
        "content": "Wiehed ghax ma jridx jahsel il hanut, lohra trid flexible hours (meta hemm [SURNAME] miktub il hinijiet) etcetc.",
        "sentence_number": 7
    },
    {
        "content": "Imbaghad minn naha l-ohra ghandek TCNs ikunu qas ghadhom waslu hawn u jridu jahdmu fil hanut jew lanqas jifmu kazz fil linja ta prodotti li jridu jbieghu.",
        "sentence_number": 8
    },
    {
        "content": "Nibku biex nsibu xi hadd sura.",
        "sentence_number": 9
    },
    {
        "content": "Imma kemm thalsu fil verità?",
        "sentence_number": 1
    },
    {
        "content": "Ejja ngħidu taghmel 6 siegħat xogħol is sibt, kemm tithallas?",
        "sentence_number": 2
    },
    {
        "content": "Malti li ma jirregistrax għax-xogħol ma jitqiesx fil-kalkolu tal-qagħad.",
        "sentence_number": 1
    },
    {
        "content": "Igifieri dawk li jkunu komdi ma jaħdmux għax hemm min jaħdem għalihom ma jingħaddewx bħala qiegħda.",
        "sentence_number": 2
    },
    {
        "content": "Minn dawn hemm ukoll min iħaddem rasu u jirreġistra 'kumpanija' u jimpjega lilu nnifsu jew il-mara u it-tfal biex ikunu jistaw ihallsu s-social security għall pensjoni.",
        "sentence_number": 3
    },
    {
        "content": "Nahseb hawn iktar barranin ifittxu xoghol mill-Maltin fil-pajjiz u l-erba Maltin li hawn ifittxu jew minghajr impjieg ma' jridu jaghmlu xejn.",
        "sentence_number": 1
    },
    {
        "content": "Irriklamajta l-paga?",
        "sentence_number": 1
    },
    {
        "content": "Forsi l-kunċett ta' paga diċenti tfisser affarjiet differenti għal nies differenti, jew sempliċiment kif ngħidu ħu l-fama u mur orqod, jekk imprendituri fis-settur tiegħek ġabu fama ta' pagi baxxi ħa ssiba iebsa ssib min japplika jekk ma tkunz tidher attrajenti.",
        "sentence_number": 2
    },
    {
        "content": "Mhu veru xejn, ħallsu sew, b'kundizzjonijiet ta' nies u jiġu jaħdmu.",
        "sentence_number": 1
    },
    {
        "content": "Mela mela l-Maltin kollha ta' skola.",
        "sentence_number": 1
    },
    {
        "content": "Ghax ma nghidux generazzjoni mohha biex iggib il-flus mix-xejn.",
        "sentence_number": 2
    },
    {
        "content": "Jien ix-xoghol ninqasam, izghar minni hlief jaraw kif jigbdu lejhom u jakkwistaw flus bl-inqas kedda possibbli ma jaghmlux.",
        "sentence_number": 3
    },
    {
        "content": "U ghax Alla jista' kollox, min l-inqas li ghandu kwalifika l-iktar li jara kif jakkwista u jahtaf.",
        "sentence_number": 4
    },
    {
        "content": "Ule xbin Maltin iridu imma \"get rich quick schemes\" ibda b'tan-negozji tal-catering, jeqirdu lil Gvern biex igib TCN.",
        "sentence_number": 5
    },
    {
        "content": "Jghidlek, xi bravu, \"il-pagi tajbin hafna imma work-life balance ma jkollokx ghalhekk il-Malti ma jidholx ghalihom\".",
        "sentence_number": 6
    },
    {
        "content": "Hekk nahseb jien.",
        "sentence_number": 7
    },
    {
        "content": "Maltin ta' zmieni jaghmlu hames xogholijiet biex ilahhqu.",
        "sentence_number": 8
    },
    {
        "content": "Happy kejk dej hi!",
        "sentence_number": 1
    },
    {
        "content": "Ftit xuhur ijlu, jekk mhux sejjer zball tkeccew hafna maltin li kienu qed jahdmu mal bolt food, xi jfisser dan.",
        "sentence_number": 2
    },
    {
        "content": "Miluwx kont nahdem ukoll fxi business iehor.",
        "sentence_number": 3
    },
    {
        "content": "Mhux se nsemmi ismu ghax maruf sew.",
        "sentence_number": 4
    },
    {
        "content": "Tghid mhux se nidhol biex inhares lejh.",
        "sentence_number": 6
    },
    {
        "content": "Jien sirt clijent regolari ta dan il business (ma haqqux imma msoma) issa pero meta mmur nara li hemm tibdil enormi tal istaff u ma tarax malti wiehed.",
        "sentence_number": 8
    },
    {
        "content": "Infittex isem u ID / passport number kif naghmel lill-maltin, jkunu ilhom naqa Malta u maj jkollomx kazi ta qorti vantagg hux.",
        "sentence_number": 1
    },
    {
        "content": "Issa billi kazijiet qedin online, isib li trid.",
        "sentence_number": 2
    },
    {
        "content": "U mhux ha nimpjega xi hadd b'kazijiet ta serq, f'post, fejn ghalkemm hemm kameras, hemm ammonti ta flus.",
        "sentence_number": 3
    },
    {
        "content": "Jew kazijiet ta agressjoni - meta dan irid jiffacja nies fuq kull xift, I'm sorry but there are standards.",
        "sentence_number": 4
    },
    {
        "content": "Xi hadd ghadu jibda, qed nghidu ma jafx jiehu order sura u laqqas igorr platti €5-€5.50.",
        "sentence_number": 1
    },
    {
        "content": "Issa jekk tistennew xi €12-€15 fis-siegha mbagahd tgergrux ghax joghla l-ikel (u bhala prezzijiet fejn nahdem jien normali).",
        "sentence_number": 4
    },
    {
        "content": "7 fis siegha.",
        "sentence_number": 1
    },
    {
        "content": "Iktar minn kemm kont nithallas jien il hilton (5 fis siegha).",
        "sentence_number": 2
    },
    {
        "content": "U ix xoghol tal hanut lanqas jibda ma kemm kont nitbazwar fix xemx u sal 4 ta filghodu kull weekend il hilton.",
        "sentence_number": 3
    },
    {
        "content": "Xorta nies li mhux iffitxu xogħol.",
        "sentence_number": 1
    },
    {
        "content": "Il Maltin x sar minnhom?",
        "sentence_number": 2
    },
    {
        "content": "Jien nahdem f'fabbrika fil-manifattura.",
        "sentence_number": 1
    },
    {
        "content": "Paga regolata minn collective agreement mal-union.",
        "sentence_number": 2
    },
    {
        "content": "M'hemmx distinzjoni bejn Malti, Afrikan jew Asjatiku, ma kulhadd nimxu l-istess.",
        "sentence_number": 3
    },
    {
        "content": "L-iktar baziku, labourer li jekk jaf izomm xkupa bizzejjed, ghandu xi Eur 6.50/hr u jibqhgu tielghin.",
        "sentence_number": 4
    },
    {
        "content": "Jien ma nirriklamax specifikament, ghax skond x'inhu kapaci jaghmel l-individwu inharrgu u skond ix-xoghol li kapaci jaghmel, inhallsu.",
        "sentence_number": 6
    },
    {
        "content": "U bin nuqqas ta'nies, ghandu xebgha overtime, bis-siegha siegha w'nofs, l-afrikani li ilhom xi hames snin saru sinjuri!!",
        "sentence_number": 7
    },
    {
        "content": "Naqbel ma hafna ma li qed tghid… ghawn xeba maltin isejhu innifishom ta 'entrepreneur' iridu jsiru miljunarji qabel jaghlu erbghin.",
        "sentence_number": 1
    },
    {
        "content": "U kif qed tghid qed jipprovaw ikabbru bit-TCN.",
        "sentence_number": 2
    },
    {
        "content": "Iktar kont qiegħed naħseb f'affarjiet bħal minn liema background ikun ġej l-applikant.",
        "sentence_number": 1
    },
    {
        "content": "Per eżempju hu żewg applikanti ta 16-il sena għal-job part time, wieħed ġej mis-sekondarja tal-Ħamrun u ieħor ġej minn San Alwigi - dawn ġa ma jitqiesux pariġġ bejniehom.",
        "sentence_number": 2
    },
    {
        "content": "Inutli tgħidli li min jgħamel l-interview ikun imparzjali għax anke b'mod subkonxju jibda jfittexx biex jivvalida dak li jkun għadda min moħħu.",
        "sentence_number": 3
    },
    {
        "content": "L-istess fuq il-background tax-xogħol.",
        "sentence_number": 4
    },
    {
        "content": "Hawn Malta il-kumpaniji kollha għandom il-fama tagħhom u ħaddiem li ġej minn kumpanija magħrufa isib xogħol iktar malajr minn wieħed li mhuwiex, anke jekk it-tnejn li huma jkollhom l-istess kapaċitajiet.",
        "sentence_number": 5
    },
    {
        "content": "Ir-raġunar bażwi li jsir hu li kieku wieħed kien tajjeb daqs l-ieħor kieku kien ikun sab xogħol ma kumpanija tajba ukoll.",
        "sentence_number": 6
    },
    {
        "content": "Dawn l-istess nies jekk japplikaw barra minn Malta ma jkunux preġudikati daqs kemm ikunu hawn.",
        "sentence_number": 7
    },
    {
        "content": "Apparti ikel qabel u gili waqt shift + drinks.",
        "sentence_number": 1
    },
    {
        "content": "5eur aċċettabbli ghal xi hadd ġdid.",
        "sentence_number": 1
    },
    {
        "content": "Xi ħadd bl esperjenza u jihu xogħolu bis serjeta kemm?",
        "sentence_number": 2
    },
    {
        "content": "Btw l ikel tar restaurants expensive ħafna malta, jien nsiefer ħafna, u naħseb malta wieħed mil iktar postijiet expensive u il kwalità tas servizz ma tibdiex ma ta barra.",
        "sentence_number": 3
    },
    {
        "content": "Il-Maltin imorru għal xogħlijiet b'kundizzjonijiet aħjar, iġifieri jekk il-paga ma tistax tkun iżjed mela allura x-xogħol irid ikun inqas.",
        "sentence_number": 1
    },
    {
        "content": "Dan ifisser li l-Malti ma jfittix xogħol fejn il-lavrant irid ikun *engaged* fuq xogħlu il-ħin kollu jekk il-paga tkun relativament baxxa.",
        "sentence_number": 2
    },
    {
        "content": "Xogħlijiet *unskilled* fejn il-lavrant irid jaffaċċja l-klijenti l-ħin kollu hemm tendenza li jkunu hekk.",
        "sentence_number": 3
    },
    {
        "content": "Għalekk ma tarax ħafna Maltin meta tmur biex tinqeda x'imkien.",
        "sentence_number": 4
    },
    {
        "content": "Xoghol ta waiter mhux ta skola, jien miniex xi wiehed naqbdu bit-tixxju u skola fejn mort abz, sakemm ma tigiex kocc inglizati u qziez meta nati cempila ghal interview, anzi tahdem kontra jekk Malti.",
        "sentence_number": 1
    },
    {
        "content": "L-attitudni kollox, tkun habrieki u prudenti bizzejjed.",
        "sentence_number": 2
    },
    {
        "content": "Fuq kollox bla jekk tgerrex l-klijenti tista tkun b'alfabet ittri wara ismek ghax ma tkampax.",
        "sentence_number": 3
    },
    {
        "content": "Kien hemm part timers llum gradwati u ohrajn jiktbu isimhom u daqshekk, paga l-istess ilma.",
        "sentence_number": 4
    },
    {
        "content": "Nassumi li bl-esperjenza 7-8 - jien xoghli pre screening, tips niccekja qorti u Facebook uek.",
        "sentence_number": 1
    },
    {
        "content": "Btw zaghzagh u anka adulti li qed tfittxu xoghol, tikxfux sormkhom fb.",
        "sentence_number": 2
    },
    {
        "content": "Kocc dagha fil-vojt, ritratti hara mejta uek, kollha jnaqqsulkom punti qabel tibdew.",
        "sentence_number": 3
    },
    {
        "content": "Bhala prezzijiet below average - jien limitat l-hrug tieghi imma average nara postijiet bhal luzzu u maritime.",
        "sentence_number": 4
    },
    {
        "content": "Ma ta barra skond fejn.",
        "sentence_number": 5
    },
    {
        "content": "Imma fejn qed imorru?",
        "sentence_number": 1
    },
    {
        "content": "Liema huma il jobs unskilled fejn qed imorru il Maltin?",
        "sentence_number": 2
    },
    {
        "content": "Ha ngħidlek ftit mill-esperjenza tiegħi.",
        "sentence_number": 1
    },
    {
        "content": "Meta kont għadni fil-bidu u kont immur napplika għal-unskilled labour bħal storekeeper jew clerk iż-żewġ domandi fejn kont nara l-espressjoni tal-interviewer tinbidel kienu 'minn fejn int?",
        "sentence_number": 2
    },
    {
        "content": "' u 'għandek karozza jew min iwasslek?",
        "sentence_number": 3
    },
    {
        "content": "' Ir-risposti kienu jkunu 'Zejtun' u 'le'.",
        "sentence_number": 4
    },
    {
        "content": "F lejla jigu 40eur + tips.",
        "sentence_number": 2
    },
    {
        "content": "Fuq social media ghandek ragun imma iz zghar ma tfemomx, idejalment online ma jkollok xejn public.",
        "sentence_number": 3
    },
    {
        "content": "L ahhar li kont l Austria, servizz ta veru.",
        "sentence_number": 4
    },
    {
        "content": "Waiters puliti, multi lingual, u jafu xinhuma jagħmlu.",
        "sentence_number": 5
    },
    {
        "content": "Jidru li jieħdu gost jagħmlu xogħolhom.",
        "sentence_number": 6
    },
    {
        "content": "L-importanti li xogħol tkun tista tgħamlu bil-pass tiegħek u li dejjem ikollok x'taqsam ma l-istess nies mhux iġerruk l-hawn u l-hemm.",
        "sentence_number": 2
    },
    {
        "content": "Biex issib dawn ix-xogħlijiet trid tmexxi *by word of mouth*.",
        "sentence_number": 3
    },
    {
        "content": "Ovvja ha ssaqsi minfejn u ghandekx transport, specjalment tkun tifel ta 16.",
        "sentence_number": 1
    },
    {
        "content": "Fis-1am jispicca xoghol, ha joqod jwasslu xi hadd li mhux triqtu kull xift jew tqabbdu taxi?",
        "sentence_number": 2
    },
    {
        "content": "Mhux ha tigi alabiebek zgur u mhux ha tobbliga lill-hadd u laqqas thallas taxi kull darba jew taqtahilu ghax jigi jahdem ghal lasta.",
        "sentence_number": 3
    },
    {
        "content": "Jkun adult, jirranga hu.",
        "sentence_number": 4
    },
    {
        "content": "Qahba Madonna x'int extrem u ta ksur il-bajd.",
        "sentence_number": 1
    },
    {
        "content": "Ili ma nara cleaner, courier jew receptionist malti biex inkun onest.",
        "sentence_number": 1
    },
    {
        "content": "U ma naħsibx li nħolqu daqshekk jobs lanqas.",
        "sentence_number": 2
    },
    {
        "content": "Dawn il-mistoqsijiet dwar it-trasport qgħedin ngħidu meta kelli 18-19.",
        "sentence_number": 1
    },
    {
        "content": "Kont ili nuża tal-linja waħdi minn 14-il sena.",
        "sentence_number": 2
    },
    {
        "content": "U x-xogħolijiet li kont napplika għalihom ħinijiet regolari suppost.",
        "sentence_number": 3
    },
    {
        "content": "Iżda naf li bejn is-suppost u x'jiġri fir-realta hemm baħar jaqsam.",
        "sentence_number": 4
    },
    {
        "content": "Rigward iż-Zejtun fost episodji oħra darba kelli interviewer sfaċċatament staqsieni \"veru li ż-Żejtun kulħadd ħamallu?",
        "sentence_number": 5
    },
    {
        "content": "\" Dan meta kelli 25 jekk trid l-eta ukoll.",
        "sentence_number": 6
    },
    {
        "content": "Iżjed jien iċ-ċuċ pruvajt inwieġbu b'edukazzjoni.",
        "sentence_number": 7
    },
    {
        "content": "U kompla jinsisti!",
        "sentence_number": 8
    },
    {
        "content": "Ilek ma [NAME] f'postijiet fejn ikun hemm ħafna attivita esterna.",
        "sentence_number": 1
    },
    {
        "content": "F'ufficcji ta' kumpaniji kbar u tal-gvern fejn ikun hemm biss il-ħaddiema tal-post issib iktar Maltin.",
        "sentence_number": 2
    },
    {
        "content": "Imma intom hamalli - u ghalhekk ghandi hafna hbieb minn hemm, ghalkemm jien min-north ;).",
        "sentence_number": 1
    },
    {
        "content": "Ifhem bhala xoghol ta waiter, ejja nghidu tigi tapplika ta 18, ha nsaqsuk, ghandek biex tmur lura?",
        "sentence_number": 2
    },
    {
        "content": "Jekk tghid le, l-mistoqsija ta wara ha tkun, kif ha tmur wara xoghol meta nispiccaw 1am-2am?",
        "sentence_number": 3
    },
    {
        "content": "Issa jekk tghidli li tirranga, jien personali ntik cans, jekk trid timxija minn naha ta fuq lura, f'idek, imma jkun xi hadd ghadu skola bhala summer job, ma nhossniex sura nghidlu/nghidila mur ghal rasek.",
        "sentence_number": 4
    },
    {
        "content": "Ara jkunu certu functions filghodu, hemmhekk juzaw tal-linja.",
        "sentence_number": 5
    },
    {
        "content": "Umbaghad hemm ir-regoli li m'hemmx politika, u certu topics bhal religjon mal-klijenti, ovvjament jekk jghidu xi haga ma ddoqx ghal widnejk, jew ma tghid xejn u tghid lill-management (u meta jkun xi hadd gdid noqodu ghassa kif imur mal-klijenti, specjalment non-regulars, ghax 1.",
        "sentence_number": 6
    },
    {
        "content": "[NAME] kif jihendilja sitwazzjoni, 2.",
        "sentence_number": 7
    },
    {
        "content": "Jkun ghadu jibda, ma nistenniex li jkollu skills ghal certu sitwazzjonijiet, u gili klijenti ppruvaw jiehdu vantagg, kemm bhala items ta l-ikel u kemm kellna kazi fejn dejjqu waitresses - hemmhekk xi hadd bhali li jkun pajzan, jitfahom il-barra) jew ghallinqas tmur fil-kcina, tiehu timeout u toqod toffendijhom ghal kwiet.",
        "sentence_number": 8
    },
    {
        "content": "Vantagg tieghi u li ma jkolliex kuntatt ma minn japplika fizikament ghax l-interviews mhux jien naghmilhom, u allura niehu servizz daqs klijent normali fejn hemmhekk tista taghmel assessment izjed veritier tal-persuna, u anka huma, jkunu iktar komdi.",
        "sentence_number": 9
    },
    {
        "content": "Issa noqod fuq maltin ghal waiter.",
        "sentence_number": 1
    },
    {
        "content": "Ara tigiex int mela :) nistenna cv u kondotta.",
        "sentence_number": 2
    },
    {
        "content": "U mill-posts naqtak jew ma [SURNAME] jew nazzjonalist, jekk ma [SURNAME] haha u jekk ta efa... l-barranin missier malta gabomna.",
        "sentence_number": 3
    },
    {
        "content": "Ilqat il musmar fuq rasu ħabib... mal gvern.",
        "sentence_number": 1
    },
    {
        "content": "Iva nifhem il-punti tiegħek.",
        "sentence_number": 1
    },
    {
        "content": "Għalekk dejjem applikajt għal-xogħolijet b'ħinijiet regolari.",
        "sentence_number": 2
    },
    {
        "content": "Personalment minn dejjem kont iktar ninqala għal ippjanar, loġistika, u riċerka minn li għal xogħol fiżiku għalekk kont infittex xogħolijet bħal storekeeper u clerk.",
        "sentence_number": 3
    },
    {
        "content": "Ta' 15-il sena spiċċajt jien u ommi waħedna u ta' 18-il sena kelli immur naħdem.",
        "sentence_number": 4
    },
    {
        "content": "Ovjament 'bla skola' xogħol fiżiku jtuk.",
        "sentence_number": 5
    },
    {
        "content": "Wara ammont ta' snin ngħamel xogħolijiet li ma jużawx il-kapaċitajiet tiegħi spiċċajt rajt x'għamilt u eventwalment mort nistudja l-universita għax qist li ma kellix alternattiva.",
        "sentence_number": 6
    },
    {
        "content": "Kieku kont niflah inbajjad u ngħaddi l-pajpijiet ta l-ilma kont immur ngħamel dak ix-xogħol iżda l-fiżiku ma jtinix.",
        "sentence_number": 7
    },
    {
        "content": "Dak dejjem kien u għadu xogħol imħallas tajjeb jekk il-business ikun f'idejk.",
        "sentence_number": 8
    },
    {
        "content": "Mhux biss mal-gvern.",
        "sentence_number": 1
    },
    {
        "content": "Dawk ix-xogħlijiet anke f'kumpaniji privati Maltin ta ċertu daqs jeżistu.",
        "sentence_number": 2
    }
]