[
  {
    "post_number": 1,
    "content": "Well served by tal-pizza zabbar road fgura. Best pizza ever. \n Good size and cooked well.. good prices and served you with a smile. Well done\n recomended 100%"
  },
  {
    "post_number": 2,
    "content": "I started the home loan process with BOV 35 weeks ago, and to this day, I still do not have a confirmed date for the final deed. \nThere have been no delays on my end, as this is not my first property—I’m fully familiar with the procedures and paperwork involved.\nThe notary’s file was submitted in November, and yet, according to the latest email I received last week, the file is somehow still stuck in the pre-vetting stage which makes no sense because I had received an official email from BOV on the 19th of December, stating that the assessment was finalized and everything was in order. The next step, according to the email, was that the legal office would contact my notary with a date.\nEmails and phone calls have been of no help. Every time I reach out, I am passed from one person to another, and all I hear is \"someone is working on it\" or \"you have to wait.\" I understand that processes need to be followed, but these long delays are completely unacceptable.\nThis ongoing delay is putting me at risk of losing the entire property. On top of that, all the extra costs for extension letters are falling on me as the client. \nIf the promise of sale falls through, I will be left with notary costs, bank fees, architect fees, and the life and home insurances which I have been paying from October 2024 when the BOV employee that was taking care of my loan process told me to apply and start them. Not to mention, I’ll have to start searching for another property in a market where prices have already risen.\nIt’s incredibly disappointing to see \nBank of Valletta\n advertise about having the best home rates, only to fail in delivering timely service and proper support for their clients. \nThis situation has become beyond frustrating now."
  },
  {
    "post_number": 3,
    "content": "Just returned back  from a break at the Grand Hotel Gozo. The staff at this hotel have a high level of customer care .Always with a smile even when very busy.Whatever we requested we were attended to in the least possible time. A special thanks to receptionist Doreen A smart well educated diligent young lady with a charismatic character and also to the front office manager that you can see him going around the hotel making sure all is in order,.Food was excellent and last but not least the well designed clean room with magnificent views and luxurious bathrooms Keep it up \nGrand Hotel Gozo\n  Looking forward for the next visit."
  },
  {
    "post_number": 4,
    "content": "Am looking for someone who would carry an upright Piano from Madliena (12 steps down ) to Naxxar (12 steps up).\nPlease include your phone number, no of people to carry and your quote. Thanks"
  },
  {
    "post_number": 5,
    "content": "This is not a sponsored post but à genuine   recommendation for Jacqui Pace Balzan who cured my dizzy spells...great bedside manners and very efficient..."
  },
  {
    "post_number": 6,
    "content": "Hi \nI am looking to have new cushions and waterproof covers made for my patio furniture. Any recommendations please?"
  },
  {
    "post_number": 7,
    "content": "I'm looking for somewhere to accommodate 15-20 people privately for some drinks and platters. Central area. Any recommendations?\nThank you "
  },
  {
    "post_number": 8,
    "content": "Does anyone know from were can buy like these ?"
  },
  {
    "post_number": 9,
    "content": "HI, looking for someone who can give Banjo lessons in Malta (not online)."
  },
  {
    "post_number": 10,
    "content": "Looking for a reliable company to clean a leather sofa. Any recommendations please?"
  },
  {
    "post_number": 11,
    "content": "Where can I buy metal rods 1mm thick. Aprox 100m total"
  },
  {
    "post_number": 12,
    "content": "I would like to highly recommend Caviar & Bull for the exquisite food and stellar service. In particular a thank you goes go Kyra for going out of her way to ensure we had a pleasant experience. We will surely be back "
  },
  {
    "post_number": 13,
    "content": "Looking for an ENT woman doctor tried and tested. Thank you."
  },
  {
    "post_number": 14,
    "content": "Ghandi bzonn number ta’ xi hadd li jbiddel zip ta’ basket. Thanks."
  },
  {
    "post_number": 15,
    "content": "Any suggestions on the best Indian restaurant in Malta please?"
  },
  {
    "post_number": 16,
    "content": "Xi hadd kapaci jkahhalom dawn u zebha saqaf ta kamra ta hames metri b zewg metri?"
  },
  {
    "post_number": 17,
    "content": "I am setting up a company with a third party and need a professional legal advisor to assist and advise me personally on a private shareholders' agreement."
  },
  {
    "post_number": 18,
    "content": "Good evening, can you please recommend good meat restaurants? Or restaurants that serve really good meat? Maybe a meat platter? For a romantic night . Thanks"
  },
  {
    "post_number": 19,
    "content": "Looking for recommendations on where to buy the best quality Ceramic and / or Cast Iron pots and pans in Malta. Thanks!"
  },
  {
    "post_number": 20,
    "content": "Looking for a reliable handyman who can assisit us with final details on a new apartment. Any recommendations would be appreciated. Thanks"
  },
  {
    "post_number": 21,
    "content": "I was well served to the point of tears... yesterday i was hunting high and low for compression stockings xxl for my dad who is in hospital. Went to Felice Pharmacy Zabbar and found a good soul her name I believe was Sara. She asked me about the measurements, I only had one and she needed 3 different measurements. I was lost of what to do, she just gave a reassuring look and told me don't worry... she just phoned the ward M1 and asked the nurses to measure my dad's leg while she waited for the figures. I couldn't believe how helpful she was being. The measurements were given ... even though the pharmacy didn't have, she continued by phoning the agent to ask if they supply that size which is not very common and they did...keep the good work .... you restored my faith in goodness"
  },
  {
    "post_number": 22,
    "content": "Do you know where I can find this Tescoma set of heart shaped cookie cutters please? Locally not online. Thanks."
  },
  {
    "post_number": 23,
    "content": "Anyone know where sells 225/50/R19 tyres?"
  },
  {
    "post_number": 24,
    "content": "Bongu\nHawn xi hadd jaghmel biebien tal garages.\n87 inches width x 94 inches height.\nMa irridux jahdem bil mutur pero irridu bhal stampa li hemm garage abjad bit twieqi fuq kull naha.\nIrridu lest fiz zmien xaghrejn.\nMin irrid itini quote jibatli fuq jamesborg1@gmail.com jew icempili fuq 99296509.\nGrazzi"
  },
  {
    "post_number": 25,
    "content": "Can anyone recommend a very good Endochrinologist? Specifically on Diabetes."
  },
  {
    "post_number": 26,
    "content": "Hi , good morning,I tried to buy a heavy duty professional steamer 8bar,I don't find anything like that in Malta,you have any suggestions please.Thanks"
  },
  {
    "post_number": 27,
    "content": "Ghaw xa haddt jaf min jiftah u isewwi il garebox pls manual"
  },
  {
    "post_number": 28,
    "content": "Tabib jigi dar zabbar pls?"
  },
  {
    "post_number": 29,
    "content": "\"Looking for Shinko & Heidenau Tyres in Malta\n\"\nHi,\nDoes anyone know of a local importer or shop that stocks Shinko or Heidenau motorcycle tires? I’ve had no luck online or in local tire shops.\nIf you’ve come across them in Malta or know someone who imports them or know of a website that ships such tires to Malta (without costing a leg and an arm for shipping) I’d really appreciate the info. Thanks!"
  },
  {
    "post_number": 30,
    "content": "Pity that I didn't take a Before photo. My front door was so weathered that the wood was nearly white \n However, Mr Duncan Farrugia came to the rescue and now my door is as good as new. He doesn't know that I am writing this but I think it is the least I can do to thank him for his outstanding work. His FB page is Restorations on Wood 77300900. Highly recommend from my end (and I consider myself as a very hard to please person when it comes to such works \n)"
  },
  {
    "post_number": 31,
    "content": "Need a professional person to carry out chimney sweep of my Ravelli Pellet stove.  \nEven someone to at least service/ clean the stove at least at this point. \nAny recommendations please?"
  },
  {
    "post_number": 32,
    "content": "What are your reviews of construct furniture please?"
  },
  {
    "post_number": 33,
    "content": "Terrible Experience with \nInterni Italia by Attaguile\n – Avoid at All Costs\nDetailed Review:\nWe really regret going with Interni and making the trip all the way to Sicily, hoping to get quality furniture. Save yourself the hassle and money—there are way better companies in Malta you can go with instead.\nWe trusted the recommendations from family and friends who had used them before, but this was NOT the same company they described. The dining table we ordered barely had any info in the brochure, so we relied heavily on their supposed “expertise.” They kept reassuring us they knew their products inside and out. Well, they didn’t. The colour of the dining table changed twice—once when we made the final payment (which we reluctantly accepted because we didn’t want to lose the deposit), and again upon delivery. The table we got in the end was nothing like what was promised. All this while communicating in fluent Italian as English is very poorly spoken at Interni.\nOn top of that, the workers they sent were rude, unprofessional, and even damaged our gypsum ceiling during installation without bothering to tell us. \nTo make matters worse, they admitted that the designer who worked on our project doesn’t even work with the company anymore (which says a lot). We were also told that they had received negative feedback about one of the installers that they sent to our house—and yet, they still continued contracting him to their clients. \nAfter weeks of back-and-forth to discuss the issue of the dining table, Interni were dodging us, offering nothing but a fruitless video call. We even reached out to the owner and told him we’d be going public with this nightmare.\nInterni's Response: \nThe owner challenged us to pursue legal action and accused us of trying to “blackmail” him with a negative review. He claimed to also have advised his lawyer of the same. (We didn’t even bother replying to that ridiculous written message. The next morning, the owner kept trying to contact us, asking for an in-person meeting.)\nWe finally met with one of their Interior Design Consultants, who basically claimed they had delivered what we ordered, and couldn’t care less that we were misled by two of their designers. During the meeting we explained that the designer could have provided samples of the dining table’s color but didn’t, and that critically, the table we received didn’t match the brochure description. In the end, their only offer was a measly €200 for the inconvenience caused by the installers.\nPresently, this case is being investigated by the European Consumer Centre as the Malta consumer affairs Authority has no jurisdiction over Interni since its an Italian registered company. This makes it harder for you to conclude cases. So beware.\nBottom line: \nStay away from Interni if you care about quality service or professionalism. In hindsight, we trusted that Interni would take care of us far too much, which was a mistake. However, being given a table that is different from the brochure was completely beyond our control and entirely their fault. We have since done business with Styles Furniture in St. Venera and had a very positive experience."
  },
  {
    "post_number": 34,
    "content": "Many says that Melita customer care is sh*t ... but I was served really really well and with customer service efficiently at Melita Paola by a representer named Nicole. \nVery well done so I give her praise cause we usually get it better to share negative feedback rather than the positive feedback. Thanks again Nicole. Very well served !"
  },
  {
    "post_number": 35,
    "content": "Hey people, can anyone recommend a farmhouse in Malta which is good for a bachelors party please?\n26th of May"
  },
  {
    "post_number": 36,
    "content": "Suggestions for someone who can fix/ service a macerator toilet pump. Preferably tried and tested. Sliema area. Thanks"
  },
  {
    "post_number": 37,
    "content": "Looking for repair of motor of toilet pump."
  },
  {
    "post_number": 38,
    "content": "Hawn xihadd jaf b'xi mastrudaxxa li kapaci jahdem xi haga simili hekk joghogobkom? Grazzi\nhttps://www.facebook.com/reel/1186584811978097?s=yWDuG2&fs=e"
  },
  {
    "post_number": 39,
    "content": "Is there a restaurant in Malta that serves Kosher food or does anyone know if anyone does Kosher catering (home deliveries)?"
  },
  {
    "post_number": 40,
    "content": "Can someone please recommend a reliable car mechanic in Qormi area who services Honda and Mazda cars. Thank you in advance."
  },
  {
    "post_number": 41,
    "content": "Good evening everyone!\nWe are looking for a mason that is licensed for demolition (of a property) anyone have tried and tested recommendations?\nThank you !"
  },
  {
    "post_number": 42,
    "content": "Hi\nCould you recommend someone who hand makes wedding dresses please.\nThanks"
  },
  {
    "post_number": 43,
    "content": "Hello! Could someone from EjcS company please contact me? I've been trying to reach out, but no one is returning my calls or responding to my emails. Is anyone else experiencing the same issue? Thanks"
  },
  {
    "post_number": 44,
    "content": "Recommendations : Volleyball Coach to carry out sessions in the North of Malta."
  },
  {
    "post_number": 45,
    "content": "Hi! I would like to ask if there's someone who used the services and took a course with Life Long Learning? If so how was your experience? TIA!"
  },
  {
    "post_number": 46,
    "content": "Good afternoon, I'm looking for someone who works on wells. Thanks in advance"
  },
  {
    "post_number": 47,
    "content": "A truly remarkable service by Jasmine at \nEyeland Opticians\n Pama.\nProfessionalism at it's best. Very patient and knowledgeable."
  },
  {
    "post_number": 48,
    "content": "Hello\nI need someone who knows how to install hinges on two small kitchen cabinet doors. The holes for the hinges need to be drilled and then they need to be attached to the door. If possible, I need this done today. Thank you so much!"
  },
  {
    "post_number": 49,
    "content": "Meta tircievi citazzjoni mil Italia tkun ittra registrata?"
  },
  {
    "post_number": 50,
    "content": "Jien mhux xi wiehda li nhobb nikteb hawn pero fuq din l-esperjenza veru pozittiva ser ikolli nikteb. \nKelna lift li kien ilu installat ftit aktar min 3 snin u hlief problemi ma jaghtix.\nDarba kul hmistax kien jieqaf. Min wahlu kien igib kul skuza, daqqa d-dawl u daqqa l-ovr, etc. Meta qabzitilna iddecidejna li nibdlu l-kumpanija u mmorru ma ohra.\nIccekjajna ma hafna kumpaniji u ghazilna Eleva lifts. Meta l-lift u l-installazjoni gie spezjonat minnhom, harget cara li kelna nibdlu hafna parts minnhu ghax kienu ta' kwalita nferjiru sa anke l-lift kif kien installat u l-qaghada li kien fih, kien perikoluz. Dhalna fi spiza kbira ghax kwazi bdilnih kollu.\nMin hawn infahhar l-efficjenza, l-kwalita tax-xoghol u l-profesjonalita ta' @Eleva liftaMalta. Honestament, veru jahdmu bilghaqal u joqghodu attenti ghal kwalita tax-xoghol.\nDan nista nghidu ghax ahna tista tghid li konna mahhom il-hin kollu waqt li jahdmu. L-owner ta Eleva Lifts mar 'out of his way' sabiex jara li nkunu moqdijin kif suppost, b'lift ta' kwalita u minghajr ma jdahhalna fi spejjez zejda. Keep it up Eleva Lifts Malta. \nGrazzi \nSilvio Diandra Desira\n/ \nEleva Lifts Malta\nHa naghti parir mil esperjenza taghna. Morru iccekjaw l-MCCAA li ghandkom il-lift registrat maghhom. Jekk ma jkunx, suppost il-lift ma jkunx jista' jintuza u l-insurance li thalsu kollox ghalxejn."
  },
  {
    "post_number": 51,
    "content": "Wpuld.you recommend MDF as a material for doors pls? Looking for white sprayed doors similar to this:"
  },
  {
    "post_number": 52,
    "content": "Hawn xi hadd xtara passenger lifts minn barra u gew installati hawn Malta? Maintenance u tiswijiet kif jahdem imbaghad?"
  },
  {
    "post_number": 53,
    "content": "Does anyone know where I can take this bag for a good clean please. Material suede"
  },
  {
    "post_number": 54,
    "content": "Looking for a Book…Willing to Buy\nI’m looking for a copy of The French in Malta by Carmel Testa. If anyone has it and no longer needs it, I’d be happy to purchase it.\nPlease let me know if you’re willing to sell or if you have any leads on where I might find a copy. \nTalk to me in Private. \nThanks in advance!"
  },
  {
    "post_number": 55,
    "content": "I'm writing to express my outmost disappointment in part of the staff of the Welbee's store in St. Julian's. The story is from a few minutes ago when I entered the store, as I usually do, right before work. I entered wearing headphones (again - as I always do) and suddenly I do see the entire store staring at me. I turn around and see the security (the morning shift on the 17.02.2025) walking towards me, clapping and calling my name as if I'm some type of a dog.\nI take off my headphones and ask if I can help with anything, to which he responds saying that I must leave my bag in the lockers. Mind you I do enter the store with a bag on an almost daily basis and I do not believe I should leave my bag in the lockers (that often give off errors or are broken), keeping in mind that it contains my work laptop and I am responsible for it outside of my work location.\nI proceed explaining all that to him, as well as the fact that I do enter the store every day with a bag and he proceeds to insists on me leaving it. After a brief argument and me letting him know I shall not leave my bag, I am told that I can keep it but I will have to show its contents upon leaving the store. Although I do believe that this insinuates the fact that I am stealing, which is neither within my culture nor my education, or is complicit to the way I was raised, I agree as I know that I have not, nor am I going to, do anything wrong.\nI proceed with looking for what I went in for, when another employee (usually standing up right next to the cash registers behind a desk) walks towards me and also insists on me leaving my bag. I explain to him that I do come into the store every day with a bag and somehow this is the first time that I've been stopped. I also let him know that there are cameras in the store and they can check the fact that I am always wearing a bag in the morning. I do also point out a few ladies that are wearing bags, to which he responds telling me that mine is a backpack, while theirs is a laptop briefcase.\nI then proceed to leave the store as I see no point in continuing to argue with them as they kept on repeating and not even listening to what I'm trying to say.\nI do find the attitude towards customers absolutely atrocious starting from the clapping and yelling, to implications of me stealing, to the absolute invasion of privacy and personal space."
  },
  {
    "post_number": 56,
    "content": "Bongu,tafu min fejn nsib nixtri pum ta bieba ta karozza diahasu yrv pls,grazzi"
  },
  {
    "post_number": 57,
    "content": "Hi\nDoes anyone know a shop that has/geta these 2 yoghurts please?\nIf not exact what are the closest suggestions you can provide please?\nhttps://international.krikri.gr/-Cyprus-Super+Spoon+High..."
  },
  {
    "post_number": 58,
    "content": "Good morning, does anyone know from where I can purchase iron-on / sew-on patches please? I specificially need a train patch. Thank you."
  },
  {
    "post_number": 59,
    "content": "Tafu lil xi hadd li jbiddel is serratura ta bieb tal aluminium pls?"
  },
  {
    "post_number": 60,
    "content": "Ghandi bzonn lil xi hadd jigi jwahhali stacking kit biex intella tumble dryer fuq il washing machine."
  },
  {
    "post_number": 61,
    "content": "The second issue of 𝐈𝐧𝐬𝐩𝐢𝐫𝐚𝐭𝐢𝐨𝐧𝐬 is out now — Oxford House's magazine showcasing fresh ideas and smart solutions.\nFrom stylish furniture to ergonomic designs and inspiring décor ideas, each issue brings new perspectives to help you create functional and inviting spaces.\nExplore the latest edition \n https://bit.ly/oh-inspirationsissue2\n#OxfordHouse #Kitchens #HomeFurniture #Malta"
  },
  {
    "post_number": 62,
    "content": "Can anyone recommend a reliable property management company for short lets please?"
  },
  {
    "post_number": 63,
    "content": "Tafu min ibiegh table top dishwasher?"
  },
  {
    "post_number": 64,
    "content": "Good evening,\nAnyone knows of a Pizzaiolo that would voluntary come to a Childcare centre to do a demonstration and small pizza's with our little ones\n?\nThanks in advance."
  },
  {
    "post_number": 65,
    "content": "Min jaghti services jew jaghmel maintenance fuq il gakkijiet tal karozzi?"
  },
  {
    "post_number": 66,
    "content": "Anyone knows good shops where they sell board games Like magic maze tower?"
  },
  {
    "post_number": 67,
    "content": "Hello everyone!\nWhere could I find this?"
  },
  {
    "post_number": 68,
    "content": "PLEASE schedule more shows like yesterday's Skyfall screening with Live Orchestra ♡ hearing all the classic 007 music in the flesh was incredible, the standing ovation wasn't long enough to thank all the professionals for their dedication and passion to bring us this experience. The ONLY downfall at the MCC was the seats. Every single person had their shoulders on someone seated next to them whether they had come together or not, slim or not, everyone's legs/arms/bags were visibly squashed. That being said, it really was the only negative thing! Here's to hoping for more great shows like this one "
  },
  {
    "post_number": 69,
    "content": "Does anyone know of a guitar teacher for little kids please ?\nThank you"
  },
  {
    "post_number": 70,
    "content": "Can someone recommend a good place in the south for a sunday roast dinner please "
  },
  {
    "post_number": 71,
    "content": "Can anyone recommend somewhere where I can order a t-shirt printed like below?"
  },
  {
    "post_number": 72,
    "content": "Exceptional electrical service by \nAlan Bonello\nHe is punctual, honest, does a great job and very reasonable. Sometimes he comes the very same day. \nHighly recommended and very reliable!"
  },
  {
    "post_number": 73,
    "content": "My bathroom tiles on one side of the room are being pushed out as a result of the usual movement of structure so typical to Maltese buildings. They have now reached the point of almost falling down. I need a good  reliable tiler to remove and redo. Any suggestions please . Thanks."
  },
  {
    "post_number": 74,
    "content": "Bongu.  Jista' xi hadd jghin, please?\nTafu min ibiegh serpentina flessibbli ta' taht il-kitchen sink li jkollha outlet ghal-dishwasher, jekk joghobkom?  Cempilt Homemate u ma ghandhomx. Grazzi.\n-----------\nCan anyone help, please? I am looking for a flexible hose under the kitchen sink with an outlet for a dishwasher.  Homemate doesn’t have any. Thank you."
  },
  {
    "post_number": 75,
    "content": "HI. Im looking for a kids costume of Ash (Pokemon). Has anyone seen anywhere pls? I cannot find. Thanks"
  },
  {
    "post_number": 76,
    "content": "I have been lucky to come across \nMSI\n a few weeks ago! This helpful gentleman managed to fix an issue we had been struggling with for months! Extremely polite and a pleasure to work with. He went over and above what was needed and gave us a timely high quality service! Highly recommended for any electrical works!"
  },
  {
    "post_number": 77,
    "content": "Anyone who can change the battery on a xiaomi robot vacuum?"
  },
  {
    "post_number": 78,
    "content": "Does anybody know anyone who fixes problems about induction hob please?\nTIA"
  },
  {
    "post_number": 79,
    "content": "Jiena dak I-istes persuna li tellajt xi xar ijlu fuq il-Crosscut u l-jigsow. \nNixtieq nghid grazzi hafna lil HIKOKI ta SanGwan I I haqna  ftehim mal-kumpanija u biddluli l-Crosscut ma ' wahda gdida u anke rrangawli l-Jigsaw. \nSodisfatt hafna bis-servizz, klijent taghhom kont u klijent taghhom ser nibqa; \nGrazzi tal-irgulija, grazzi lil HIKOKI ta SanGwan."
  },
  {
    "post_number": 80,
    "content": "Xi hadd jaf min fejn nista nsib fabric spray iswed?"
  },
  {
    "post_number": 81,
    "content": "Tafu b xi ironmonger Gozo li jiftah Ilum please?"
  },
  {
    "post_number": 82,
    "content": "After watching the wonderful Skyfall screening at MCC yesterday, my friend and I went for dinner in Valletta and tried somewhere new to us. MAMAVON was super clean, great service, lovely atmosphere and the food... wow! Flavourful, good menu variety, abdundant ingredients (check out my fresh crab linguine with prawn bisque, yes all thay sauce was full of fresh crab!!!), I beleive one of the owners had served us and she was a delight. Definitely going again....and soon."
  },
  {
    "post_number": 83,
    "content": "Looking for someone who does concrete planters made to measure"
  },
  {
    "post_number": 84,
    "content": "Xi hadd jista’ jghini minn fejn nista’ nsib pannelling bhal dan ( qisu flute finish ) li nkun nista naqta minnu biex naghmlu l-qis li rrid jiena ? \nGrazzi"
  },
  {
    "post_number": 85,
    "content": "Hi I'm looking for a tv remote for a Finlux Tv."
  },
  {
    "post_number": 86,
    "content": "Hello Everyone,\nLooking to buy outdoor decorative panels. Anyone stocks them pls?"
  },
  {
    "post_number": 87,
    "content": "Hi guys. Who's the agent for Season Air conditioners please?"
  },
  {
    "post_number": 88,
    "content": "Need a reliable plumber in sliema pls"
  },
  {
    "post_number": 89,
    "content": "X inhu l ahjar u l irhas VPN please?"
  },
  {
    "post_number": 90,
    "content": "Tafu min jaghmel xoghol ta ‘Epoxy Resin’ fuq madum dirett hawn Malta?"
  },
  {
    "post_number": 91,
    "content": "Hi.  Any one who has a family member at Porziuncola Home can help me please?  I am trying to find a private GP who can check a family member who resides there.  Maybe someone can share their contact. Thank you "
  },
  {
    "post_number": 92,
    "content": "A truly enjoyable experience...just watched skyfall in concert...excellent....\nEnjoy gala performance tonight"
  },
  {
    "post_number": 93,
    "content": "Very well served last evening at \nTango&Fork\n. It was our first dining experience there but for sure will not be our last. We were a party of 2 and a toddler. The food served was topnotch and the staff’s attitude and mannerisms were so warm and welcoming. Keep up the good work, you get 5 stars from us."
  },
  {
    "post_number": 94,
    "content": "I have a melita tv box which is hidden in a cupboard and need an external ir sensor, i tried using one from iptv box to see if its the same but does not work, anybody knows where i can buy such sensor?"
  },
  {
    "post_number": 95,
    "content": "Good morning. I need to print 2 large branded “sails”, BUT the material needs to be breathable so the wind passes through it and will not have any effect/damage  on the mast. It is only being used as a display. Do you know what material can be used and recommendations for a reliable suppliers would be appreciated. "
  },
  {
    "post_number": 96,
    "content": "Looking for a wooden stool with the shape similar to the one in the picture. Any recommendations pls?"
  },
  {
    "post_number": 97,
    "content": "Min fejn nista nordna insect screen ghall din it-tieqa \nGrazzi"
  },
  {
    "post_number": 98,
    "content": "Aw Xi hadd jaghmel zinc plate pls\nGrazzi"
  },
  {
    "post_number": 99,
    "content": "Xi hadd jaf minn fejn nista nixtri labar generic tal pinna tal insulina 29g 12mm. Grazzi\nI need to buy generic 29g 12mm insulin pen needles, can anyone help pls? Thanks"
  },
  {
    "post_number": 100,
    "content": "Bongu!\nGhandi taragg tal-granit u ghandi bzonn induru (polishing etc) xi hadd jista jighni jekk joggobkom? \nGrazzi bil-quddiem!"
  },
  {
    "post_number": 101,
    "content": "I need to find the grave of a family at the Addolorata Cemetery.\nAre there specific office visiting hours as nobody ever answers the phone I was given ie. 21693508.\nWhat information will be requested to find a specific grave ?\nThank you."
  },
  {
    "post_number": 102,
    "content": "Anyone who knows how to install some IKEA furniture? as we where booked for some time with a guy for today but person couldn't make it.Beds and Desks are the items. Today would be perfect .mob7947 6944"
  },
  {
    "post_number": 103,
    "content": "Looking for a seamstress to do some alterations\nI’ll be in Malta around March and I would need a seamstress to take care of a couple of garments - some need alterations, others zip replacements etc. They would need to be done relatively fast. Any contacts would be appreciated"
  },
  {
    "post_number": 104,
    "content": "Well served by \nStrada Rjali\n hamrun, definitely the best sushi!"
  },
  {
    "post_number": 105,
    "content": "Bongu, tafu lil xi hadd jahdem/inaddaf grease traps go restaurants jekk jghogobkom, grazzi."
  },
  {
    "post_number": 106,
    "content": "Dress to impress….Look no further.Cessani.Tried and tested.Thanks once again x"
  },
  {
    "post_number": 107,
    "content": "Looking for some one who can uninstall FCPX from an old Macbook and install it to another one. Any help please ?"
  },
  {
    "post_number": 108,
    "content": "Haven't received an ARMS Malta billing for these past four months. Anyone also having this problem?\nTrying to contact Arms Ltd is next to impossible, spent ages for someone @ Arms to respond to my incessant calls..."
  },
  {
    "post_number": 109,
    "content": "How often are there trips from the new park and ride to Mġarr(Gozo)? Is there a schedule?"
  },
  {
    "post_number": 110,
    "content": "Do you have any recommendations for a good Italian restaurant please? (Pizza & pasta) \nThank you! "
  },
  {
    "post_number": 111,
    "content": "Shiplowcost ghadhom jezistu, ghax icempel ma jaqbad hadd, emails u messages ma jirrispondi hadd. Hemm forsi xi mezzi ohra kif nista naqbadhom?"
  },
  {
    "post_number": 112,
    "content": "Nixtieq nikri mini van + driver ghal gurnata ax ghandi xi hbieb barranin biex indawwarhom ftit. Lil min tirrakomandawli pls?"
  },
  {
    "post_number": 113,
    "content": "Can someone pls remind who the agent for Magimix ( parts) is ? Broken bowl\nTks"
  },
  {
    "post_number": 114,
    "content": "Health Insurance \nMela taghzel upgrade ghal premium mhux basic u kull vizta ta' tabib tigik Eur 30 u jtuk lura Eur 25 dejjem. Physio jigik Eur 45 u dejjem jtuk lura Eur 25 ghax jghidulek 'Exceeds fair and reasonable cost'. Allura nghid jien min qed jisraqni? Naf min jghix barra minn Malta u jiehu kollox lura! Xbajt nara l-istess kumment kwazi ghal kull claim! Imma kurjuza l-bicca!!! "
  },
  {
    "post_number": 115,
    "content": "BOV\n Sliema Preluna , today you really and truly failed to provide a satisfactory service.... and this is not a first either, but today topped them all!!\nThe majority of times that we need to use Sliema Preluna branch, other than the fact of excessive wait time and not enough chairs.... we end up either having 'half' a solution or being 'half' served! \nToday we walked in with just 1 client in line, (we had to wait a few minutes to get in to the branch as the security officer had gone to get a glass of water from upstairs). Once it was our turn, we explained to the young lady at reception (she always has a nice smile, but I cant recall her name) what our issue was, since she could not or did not know how to resolve the issue, she asked Nicole for assistance. \nMs Nicole didn't know how to solve the issue either, so she asked us to wait while she went upstairs to ask someone else for a solution..... we waited a good 10 minutes, while Nicole went upstairs. We then saw Nicole come back down the stairs, she nodded as in acknowledgement and went on her way to another desk further in! \nSo we waited for Ms 'Receptionist' who had also left her desk to look for some box belonging to another client. When she came back from her errand, I asked if she had any news as we had been waiting for more than we thought was necessary. \nBelieve it or not she went to ask Nicole who gave her the reply (which she most probably knew did not solve our issue). So why on earth didn't you Nicole tell us what the reply was??. Why did you just walk by and nod, especially considering that you most probably knew that the issue was not going to be solved? When I asked you why you walked by you said that you had relayed the message to Ms Receptionist, but one of you was lying as Ms Receptionist said that she would ask you, we actually saw her doing so!\nThis incident compelled me to write here as not only once again did we end up with no solution, but to add insult to injury it felt like we weren't treated appropriately at all!!!\nI think clients that end up having to go to a branch should have their issue resolved, not have to wait more than necessary, should be treated decently, and the team at this particular brnch should stop failing to provide a satisfactory and humane service.\nYou may ask why did I not write to their customer resolution office... Weil the last time I did, it didn't get me anywhere either, apart from the fact that I got an email to fill in their survey!"
  },
  {
    "post_number": 116,
    "content": "Anyone knows a shop that sell these locally pls?"
  },
  {
    "post_number": 117,
    "content": "Trying my luck, my car has a locknut and from what I understood the locknut key is worn out so can't change my tyres.  Does anyone make new keys locally by taking a shape of the locknut installed on the tyre?"
  },
  {
    "post_number": 118,
    "content": "Xi hadd li jaghmel kisi u tibjid."
  },
  {
    "post_number": 119,
    "content": "Very well served by Flowerland. My husband buys from them every year, not only for Valentine's but throughout the year. They always deliver fresh and beautiful flowers that last me for weeks. Delivered also by a very kind driver. They never dissappointed us! Thank you Flowerland team and my Husband "
  },
  {
    "post_number": 120,
    "content": "Looking for a reliable trustworthy bajjad - 2 bedroomed apt to be freshly painted all in white in 1 week max!"
  },
  {
    "post_number": 121,
    "content": "Positive feedback:\nAlways well served at \nCefai Formal Wear\n mosta! \nMartina Calleja\n and the other lady (sorry dont know the name) always ready to help with a smile! They love what they do. Simply the best! Keep it up and THANK YOU! "
  },
  {
    "post_number": 122,
    "content": "In need of original Mitsubishi ASX stereo system. Can be retro style w/o touchscreen. 2014 onwards. Please pm."
  },
  {
    "post_number": 123,
    "content": "Hi I’m\nUrgently looking for someone to fix a pvc door, any leads pls?"
  },
  {
    "post_number": 124,
    "content": "LOOKING TO BUY USED SSD SATA OR M.2 IN BULK IF POSSIBLE"
  },
  {
    "post_number": 125,
    "content": "Hi, pls anyone knows a supplier/shop where I can buy bubble wrap with BIG bubbles? (not interested in the normal one with small bubbles). Thanks"
  },
  {
    "post_number": 126,
    "content": "Xi hadd jahdem fuq convection oven zanussi industrial please"
  },
  {
    "post_number": 127,
    "content": "Any suppliers who sell vending machines pls?"
  },
  {
    "post_number": 128,
    "content": "Looking to buy a 13\" rim for a 2006 Ford Ka. Where would you suggest to find a second hand unit (apart from the agent)? Thanks."
  },
  {
    "post_number": 129,
    "content": "Any supermarket or stores in the south that sell bagels? No filled. Just a packet/bag of bagels?"
  },
  {
    "post_number": 130,
    "content": "Good morning\nAnyone know where I can find about 30 t-shirts of shiny silver colour at wholesale prices please?"
  },
  {
    "post_number": 131,
    "content": "Good morning,\nLooking for suggestions. \nThe letterbox key got misplaced and I need a replacement. \nThere is 060 engraved on the lock. Any suppliers before I go ahead and drill the lock?\nThank you"
  },
  {
    "post_number": 132,
    "content": "Bongu, haw xi hadd li xtara min dis site u l prodotti gew kollox ok please? "
  },
  {
    "post_number": 133,
    "content": "Any recomendations for neck problems ?"
  },
  {
    "post_number": 134,
    "content": "In urgent need of passenger side front angel eyes. HONDA FIT 2015.\nWhere can I find please?"
  },
  {
    "post_number": 135,
    "content": "Wara nofsinhar hadt it-tifel minuri l-polyclinic ta' Rahal Gdid fis-2.30pm. Kelli referal minn Mater Dei biex jibdulu dressing. Ir-recepitionist prezenti Ruby Pace irrifjutat li tirregistra lit-tifel tieghi minkejja li prezentajt l-karta tal-Identita tieghi u referral mit-tobba tal-isptar. Skond s-sinjorina Pace hemm policy li bilfors trid tigi pprezentata l-ktieb tat-tfal tal-isptar. Nhar il-Hadd  filghodu mort fl-istess polyclinic fejn kien hemm recepitionist iehor u nqdejt meta pprezentajt l-karta tal-identita u r-referral mill-isptar biss. Hadd ma talabni l-ktieb tat-tfal tal-isptar.  Ghalxejn kienu l-protesti tieghi li tifel ghandu bzonn li dressing tigi mibdula minnufih.\nDin il-policy li tipprezenta l-ktieb tat-tfal biex tinqeda l-polyclinic meta dahlet?\nJekk hija policy ghaliex ma hemm l-ebda tabella/twissija dwar dan?\nGhaliex fuq ir-referral mill-istpar ma hemmx miktub din il-policy jekk inhu hekk?\nGhaliex il-Hadd li ghadda nqdejt u llum le?"
  },
  {
    "post_number": 136,
    "content": "Need recommendations for a professional tiler who can handle rectified floor tiles and 45° wall corners. Thank you"
  },
  {
    "post_number": 137,
    "content": "Very well served by the day unit at Mater Dei. Yesterday I had a colonoscopy scheduled. I want to publicly thank all the staff and doctors who did an amazing job looking after all their patients. They are a very vibrant bunch of people making sure everyone is well looked after. All with a smile on their faces and encouraging everyone before they went into their procedure. And 90% were Maltese. Thank you for making a not very nice experience bearable. Well done to all the doctors and Nurses at the colonoscopy unit "
  },
  {
    "post_number": 138,
    "content": "Highly recommend \nKingMobile Malta\n, unbeatable price on the latest Samsung, great service, super efficient. Well done"
  },
  {
    "post_number": 139,
    "content": "I would like a cat door installed in my balcony door (which is made of glass). I contacted the company who made the door before I moved and they said I would have to pay for a whole new door for them to do it \n. Does anyone know someone who can do this for me without paying for a whole new door? Or is that the only way?"
  },
  {
    "post_number": 140,
    "content": "I am seeking assistance with a problem I am experiencing with my Tag Heuer Connected Calibre e4 watch, as it is not turning on. Can anyone recommend a Tag Heuer repair shop or an individual in Malta who can provide expertise in resolving this issue?"
  },
  {
    "post_number": 141,
    "content": "Edit: I sent an email to DealToday explaining the situation and they stepped in and gave full refund. Thanks to their great after sales.\nNot served by \nBella Vista Hotel Malta\n  in Qawra.  We paid via \nDealToday\n  on a Half Board basis.  We found dirty quilt covers and no heating.  There was not even a single teaspoon.  We asked for a quilt replacement, they took the quilts but at 3 hours no replacement was given, all while the room was very cold.  A maintenance worker came to try to fix the heating, we were told that heating starts after 5pm but still no heat was coming out of the vents.  We did not use anything in the room, so we went to reception to ask for a refund and we got a blatant no.  We did not even get offered to change rooms as it seems heating is controlled centrally and it is either set very low or off altogether.  The worst part is that there was no responsible manager to handle cases like this and no one took responsibility.  This situation is senseless. Both the receptionist and the acting manager knew exactly what was going on since they both repeatedly said they understand but they don't have any kind of authority. It took the receptionist an immediate checkout to forward a business card including an email address of the front office manager. However, she kindly informed us that most probably we are going to get the same answer since they do not refund no matter what. All we asked for is our money back since basic hotel client requirements were not met. This looks like a fraud as we paid for the services that we never got.  We went to pack to leave and as soon as we went out of the room the card was blocked before we even checked out.  All we want is our money back. \nMCCAA - Malta Competition and Consumer Affairs Authority"
  },
  {
    "post_number": 142,
    "content": "Trying my luck here...admin delete if irrelevant. I am looking for the accessories (at least k-beater and whisk) of a Kenwood mixer that is still mechanically sound (see picture). It is more than 40 years old. Is there anyone that still has these accessories and would like to sell them for a reasonable price? Thank you.\nEdit: The model number of this model is A707A. The attachments are a bit longer than the Kenwood Chef's."
  },
  {
    "post_number": 143,
    "content": "Ghandna bzonn inbiddlu l geezer urgenti dil-gimgha . Xi hadd jista jirrakomanda lil xi hadd ? Grazzj"
  },
  {
    "post_number": 144,
    "content": "Does anyone know where I can buy furniture matching the ones in the photos please?"
  },
  {
    "post_number": 145,
    "content": "I had the most amazing birthday party, all thanks to the incredible planning! Everything was beautifully organized, from the decorations to the food and entertainment. The attention to detail made the event truly special, and I felt so celebrated. I couldn’t have asked for a better experience—highly recommended the \nCurtain Raiser Kids Parties\n Joanne,Anthea and all their team! anyone looking for a stress-free and unforgettable celebration!"
  },
  {
    "post_number": 146,
    "content": "Hi \n tafu minhu l-agent li jgib din id-ditta grazzi "
  },
  {
    "post_number": 147,
    "content": "Looking for someone to cut an island top to install a bigger hobb . Material is like a quartz ( not sure ) pls help"
  },
  {
    "post_number": 148,
    "content": "Hi, I need a courier to pick up a package from the UK. Any suggestions please?"
  },
  {
    "post_number": 149,
    "content": "Metal Pocket Door\nHi, any shops that supply metal pocket door like the one below. Thanks"
  },
  {
    "post_number": 150,
    "content": "Furniture Legs\nHi, do you know any shops that sells modern furniture legs? Thanks"
  },
  {
    "post_number": 151,
    "content": "Who is the local agent for Fresubin pls?"
  },
  {
    "post_number": 152,
    "content": "Are you tight on budget but still looking for high-quality products? Oxford House has got you covered! Take advantage of our 𝐅𝐞𝐛𝐫𝐮𝐚𝐫𝐲 𝐏𝐫𝐨𝐦𝐨 𝐏𝐚𝐜𝐤𝐚𝐠𝐞 for only €1,295.\nEnjoy this all-in-one offer:\n Faber Built-In Hood (VALUE PB BK A60)\n Bosch Gas Hob (PGP6B5B86)\n Bosch Oven (HBA272BB3)\n GROHE Kitchen Sink and Tap Bundle\nDo not miss out on this limited-time deal \n https://bit.ly/oh-essentialpackage\n#OxfordHouse #Malta"
  },
  {
    "post_number": 153,
    "content": "Hi, meta tikri post li tkun mdahhla l agenzija, il kuntratt issir ghand il kumpanija stess jew l ahjar li naghmluh ghand nutara anke ghal fini ta ligijiet. Ahna l ewwel darba li ser nikru u ghalura nixtiequ ftit parir forsi wiehed ghadda minnha. Grazzi hafna"
  },
  {
    "post_number": 154,
    "content": "I don’t normally post reviews etc but when someone gives me A+ all around ( customer service, taste, presentation and price point) then I must share. I was looking for someone to make me an original Victoria sponge cake and got a few people recommending  CREATIVE BAKING MALTA- CAKES and so I gave it a shot. From beginning to end it was seamless. But best of all the cake was DIVINE. She gave me a few mini cookies for free ( BONUS POINTS) and I’m glad she did as now I know who to go to for cookies for my son to take to school for his bday. Excellent cake and excellent cookies. Great service. Cake was super fresh and not the mass produced type. She will be my go to from now on for sure.\nhttps://www.facebook.com/\nCreative Baking Malta - Cakes"
  },
  {
    "post_number": 155,
    "content": "Tafu min ikollu din id ditta malta please ?"
  },
  {
    "post_number": 156,
    "content": "Very well served at Crosscraft Pama by Marika. She really went out of her way to find us the right appliance to meet our needs.\nThank you Marika!"
  },
  {
    "post_number": 157,
    "content": "Hi. Does anybody fix tooled leather surfaces.  It is not an antique   Thanks"
  },
  {
    "post_number": 158,
    "content": "Anyone know where to buy cargp pants?"
  },
  {
    "post_number": 159,
    "content": "Hawn xi hadd jaf min igib din d ditta ta membraine pls?"
  },
  {
    "post_number": 160,
    "content": "Do you know outlets who have heart-shaped sticky notes please?"
  },
  {
    "post_number": 161,
    "content": "Need quotations for PVC Aluminium apertures and doors."
  },
  {
    "post_number": 162,
    "content": "Anyone used this company please? Any feedback is appreciated \n Thank you."
  },
  {
    "post_number": 163,
    "content": "Any adult piano lessons for adult beginners in south area please?"
  },
  {
    "post_number": 164,
    "content": "Hi. Does anybody fix tooled leather surfaces.  It is not an antique   Thanks"
  },
  {
    "post_number": 165,
    "content": "Tafu min ikollu din id ditta malta please ?"
  },
  {
    "post_number": 166,
    "content": "Very well served at Crosscraft Pama by Marika. She really went out of her way to find us the right appliance to meet our needs.\nThank you Marika!"
  },
  {
    "post_number": 167,
    "content": "Very well served by \nTropical Marine Aquatic\n. Had an emergency and in no time \nMario Borg\n acted immediately to solve my problem notwithstanding it is Sunday. \nThank you for your commendable service!"
  },
  {
    "post_number": 168,
    "content": "Recommendations for someone to install dashcams pls \n preferably tried and tested. Thanks."
  },
  {
    "post_number": 169,
    "content": "Urgent pvc/alum guy needed to fix a sliding door - any leads pls ?"
  },
  {
    "post_number": 170,
    "content": "Hello, anyone selling 99% Pure Alcohol for personal use, yet ? For homemade liquors…TIA"
  },
  {
    "post_number": 171,
    "content": "I need help using the wellbees app. I have the loyalty card number, have added my grocery shopping to the cart. Where do I insert my loyalty number pls?"
  },
  {
    "post_number": 172,
    "content": "Looking for a French language tutor to help me improve my conversational French. Any recommendations please?"
  },
  {
    "post_number": 173,
    "content": "I've lost a bunch of keys, in the area of Hughes Hallet, Sliema.  2 of them identical to the black and red one in the photo. If someone found them please contact me"
  },
  {
    "post_number": 174,
    "content": "Asking the always helpful members of this group. I seem to have lost one of my car number plates yesterday in the heavy rain, possibly in the Marsa area. If anyone came across a number plate DCL 6xx please let me know. Thank you in advance."
  },
  {
    "post_number": 175,
    "content": "Do you suspect that someone is putting screws on the streets on purpose? I got three punctures in 1 day all with screws in. The Puncture shop was full as well with everyone complaining. Shouldn't be illegal throwing screws in the street?"
  },
  {
    "post_number": 176,
    "content": "My eyes are not served"
  },
  {
    "post_number": 177,
    "content": "Looking for a Maltese teacher, private lessons (8 and 7 year old) please, Zurrieq area.\nThank you xxx"
  },
  {
    "post_number": 178,
    "content": "Does anyone know from where I can find frosted window films as these"
  },
  {
    "post_number": 179,
    "content": "Hello, I have this hp envy 6020e printer, that is failing to print.  The page comes out totally blank, no colour and no black.\nI've tried \n - cleaning head and cleaning head advanced from HP app. several times.\n - changed the ink cartridges to new ones\nBut still no luck.\nIf there is someone out there that can suggest something else to try, please do before it goes to the trash..\nPlease don't tell me to take it to a technician as its not worth, understandably they charge to have a look but its not worth spending 30e for a printer that's almost 3 years old and the initial cost was 99 euros\nThanks in advance"
  },
  {
    "post_number": 180,
    "content": "Hawn xi hadd jaqdini ghada, steam cleaning ta' karozza Kia Picanto, please.\nGrazzi."
  },
  {
    "post_number": 181,
    "content": "Well done to another rubs approved partner....proud to promote you"
  },
  {
    "post_number": 182,
    "content": " Best Mattresses – \nMattress Collection\nSweet dreams start here! \n Mattress Collection is the winner of Best Mattresses at the Top Build Awards 2025! \n#creatingabetterexperience\n-\nThanks to our sponsors - \n89.7 Bay\n Knot Malta\n LOGO EXPRESS\n Ventur Auto Imports\nBøye Designs\n The Westin Dragonara Resort, Malta"
  },
  {
    "post_number": 183,
    "content": "Congratulations to Crosscraft...one of our rubs recommended partners for this achievement"
  },
  {
    "post_number": 184,
    "content": " Best Appliances – \nCrosscraft Malta\nPowering your home with the best! \n Crosscraft wins Best Appliances at the Top Build Awards 2025! \n#creatingabetterexperience\n-\nThanks to our sponsors - \n89.7 Bay\n Ventur Auto Imports\n Knot Malta\n LOGO EXPRESS\n Bøye Designs\n The Westin Dragonara Resort, Malta"
  },
  {
    "post_number": 185,
    "content": "Looking for recommendations.can you suggest someone that can do this type of makeover please?"
  },
  {
    "post_number": 186,
    "content": "Xi hadd available ilum biex jiftah drain ta garage? Lokalita Naxxar\nIbatu min hu available biss please."
  },
  {
    "post_number": 187,
    "content": "Looking for a company transporting stuff from Malta to Sicily. Any recommendations please?"
  },
  {
    "post_number": 188,
    "content": "Hi does anyone know where I can buy a LPG water heater 11 litres ph with a reasonable price please"
  },
  {
    "post_number": 189,
    "content": "Any idea where I can buy these window locks please as they need replacing ?"
  },
  {
    "post_number": 190,
    "content": "Who can do this type of door ? It's swing and turn system ."
  },
  {
    "post_number": 191,
    "content": "Praise post.   \nSephora \nProchimps\n .... You are an asset to the company.  \nAfter buying a massage chair in December and contacting them via fb messenger I waited a while ( 3 weeks ) to hear back from them due to some damages and eventually fault in the chair remote for the massage...\nDecided to call and spoke with Sephora. She not only arranged for the chair to be collected to be fixed but surprised me with a new chair.  \n@Prochimps sephora is a real star!!!!!"
  },
  {
    "post_number": 192,
    "content": "What are your opinions on artificial turf for a back garden and any suggestions on good suppliers and installers please?"
  },
  {
    "post_number": 193,
    "content": "Good morning, do u know a pharmacy with doctor today? Or a doctor visit at home?  I live in imqabba. Thanks"
  },
  {
    "post_number": 194,
    "content": "Hi from where can I buy a mobile today afternoon or tomorrow morning (public holiday pls)?  Ideally someone who can also transfer the data from the original mobile onto the new one.  Tia"
  },
  {
    "post_number": 195,
    "content": "Good day all. Looking for a trendy chic kind of vibrant bar in Valletta for a night out where one can have drinks and snacks at the bar. Thanks."
  },
  {
    "post_number": 196,
    "content": "Any shops or supermarkets that have cake pop sticks please?"
  },
  {
    "post_number": 197,
    "content": "Hi everyone, \nI want to share with you guys my frustrating experience with Traslo_GO Malta, a shipping company locally based. Just before Christmas, I shipped 5 suitcases from Milan to Malta, but one of them never arrived. Instead, I received a completely different parcel (belonging to someone else) with my luggage’s shipping label stuck on it. This clearly proves that the label detached and was mistakenly affixed to another package — a courier error, not mine.\nWhile Traslo_GO Malta did communicate with me and claimed to have asked their agents about the missing luggage, they have not provided any actual proof like emails or similar (which I asked for) of their recovery efforts — only assurances through Facebook Messenger. \nDespite this, they refused to take full responsibility, and shifted the blame to their subcontractor (Poste Italiane) and on me for \"not having attached the label properly\". However, the incorrect delivery shows that the issue was caused by mishandling during transit, not by me.\nOn top of this, I was never shown or asked to sign any Terms and Conditions before shipping. I paid via Revolut, yet never received an invoice or receipt for the transaction, which raises concerns about transparency.\nTheir only offer was a minimal refund (€45), which does not reflect the financial or sentimental value of our lost belongings. I expected a higher level of accountability and customer support, but instead, I have been left with no real resolution.\nI’m sharing my experience so others can make an informed decision before trusting this company with their shipments. Transparency and responsibility are key in this industry, and unfortunately, I did not experience either to a satisfactory level."
  },
  {
    "post_number": 198,
    "content": "Very well served by Pantar Road. Ahjar tohrog bil canoe jew jet ski ghax tasal iktar malajr. Anke goggles u flippers recommended"
  },
  {
    "post_number": 199,
    "content": "Best place to get a rental investment furnished?\nSo far checking Distinct Homes and BDI...."
  },
  {
    "post_number": 200,
    "content": "Hi I am looking for a restaurant with private area, or a venue whereby I can have stand up drinks and nibbles for around 35 peoplr for my daughter’s 1yr bday on a Sunday lunch - any suggestions?"
  },
  {
    "post_number": 201,
    "content": "Home Internet min hu l aqwa f Malta?"
  },
  {
    "post_number": 202,
    "content": "Any suggestions for same/next day flower delivery? Apart from Romano. Thanks"
  },
  {
    "post_number": 203,
    "content": "Any recommendations for furniture finishings for a small boutique where quality & service is not compronised.\nRC Installations & More"
  },
  {
    "post_number": 204,
    "content": "Highly recommend \nCar needs\n panel beater and sprayer in Ħamrun! Super happy with the job flawless! They are friendly and patient. I found them through this channel as someone referred them, and I decided to try their service. Thank you, guys! Just sharing my genuine experience."
  },
  {
    "post_number": 205,
    "content": "Hi Good Morning, i want someone to create a  simple booking website that will not be expensive? Can anyone help ?"
  },
  {
    "post_number": 206,
    "content": "Hey everyone, I’m looking for a reliable aluminum specialist to fix two windows that aren’t closing properly. If you have any recommendations, please let me know. \nPreferably someone who is efficient and trustworthy. Thanks in advance"
  },
  {
    "post_number": 207,
    "content": "Any reliable contact for Toshiba tv electrician - \nManaging to watch iptv but for some reason no Netflix - \nSeems to be losing its memory"
  },
  {
    "post_number": 208,
    "content": "Good Afternoon,\nWould you please recommend a good doctor for Dementia.\nThank you!"
  },
  {
    "post_number": 209,
    "content": "Anyone knows where I can buy an air hostess costume for a 5yr old girl?"
  },
  {
    "post_number": 210,
    "content": "By any chance do you know someone that will fix puncher that opens on Sunday please but not of Luqa"
  },
  {
    "post_number": 211,
    "content": "Hawn xi hadt ghandu cluster ta Toyota tercel automatic ta Sena 1998/99 ."
  },
  {
    "post_number": 212,
    "content": "Any reviews about Bed and Sofa Żabbar please?"
  },
  {
    "post_number": 213,
    "content": "Good Evening \nCan you please tell me where I can buy one like this please thank you!!"
  },
  {
    "post_number": 214,
    "content": "Is it normal only to be receiving this amount on 12 Solar Panels for a 2 month period?"
  },
  {
    "post_number": 215,
    "content": "We need a fridge technician who can assist us preferably tomorrow morning.."
  },
  {
    "post_number": 216,
    "content": "Bathroom Renovations\n is highly recommended for work in tile laying and plumbing. I will talk about my experience. \nI was looking for someone on this page to renew and redesign 3 bathrooms in my home. I met many people but I found that the most suitable one was Roderick. He is a very intelligent, experienced young man; a problem solver and gives ideas to improve the work throughout the process. He's very polite and never says no - Many times, he goes beyond the agreed plan to ensure that the product will be of a high standard. Not to mention, his amazing work is done at a reasonable price.\nI'm very happy with his work and wish for others to have the same experience.\nWell done, Roderick and keep it up. \nHis phone number is 99233598, much recommended."
  },
  {
    "post_number": 217,
    "content": "Ghandi bzonn electrician . Mhux SE nghidilkhom illejla ghax naf li mpossibli imma almenu filghodu . Qeighed bla dawl grazzi"
  },
  {
    "post_number": 218,
    "content": "Hi, xi mastrudaxxa jaqdini ghada kemm jamilli 3 toqbit tac capetti please"
  },
  {
    "post_number": 219,
    "content": "Anybody found these for sale locally?"
  },
  {
    "post_number": 220,
    "content": "Tafu xi hanut li jikri magdrill li jkollu 40mm annular cutter mijaw, ehl andu imma ta 30 u 50mm cutter andu ma nahdimx bijom, thx"
  },
  {
    "post_number": 221,
    "content": "Ghandi bzonn electrician . Mhux SE nghidilkhom illejla ghax naf li mpossibli imma almenu filghodu . Qeighed bla dawl grazzi"
  },
  {
    "post_number": 222,
    "content": "Is it normal only to be receiving this amount on 12 Solar Panels for a 2 month period?"
  },
  {
    "post_number": 223,
    "content": "We need a fridge technician who can assist us preferably tomorrow morning.."
  },
  {
    "post_number": 224,
    "content": "Good Evening \nCan you please tell me where I can buy one like this please thank you!!"
  },
  {
    "post_number": 225,
    "content": "Hawn xi hadt ghandu cluster ta Toyota tercel automatic ta Sena 1998/99 ."
  },
  {
    "post_number": 226,
    "content": "Any reviews about Bed and Sofa Żabbar please?"
  },
  {
    "post_number": 227,
    "content": "Anyone knows where I can buy an air hostess costume for a 5yr old girl?"
  },
  {
    "post_number": 228,
    "content": "By any chance do you know someone that will fix puncher that opens on Sunday please but not of Luqa"
  },
  {
    "post_number": 229,
    "content": "Hey everyone, I’m looking for a reliable aluminum specialist to fix two windows that aren’t closing properly. If you have any recommendations, please let me know. \nPreferably someone who is efficient and trustworthy. Thanks in advance"
  },
  {
    "post_number": 230,
    "content": "Any reliable contact for Toshiba tv electrician - \nManaging to watch iptv but for some reason no Netflix - \nSeems to be losing its memory"
  },
  {
    "post_number": 231,
    "content": "Good Afternoon,\nWould you please recommend a good doctor for Dementia.\nThank you!"
  },
  {
    "post_number": 232,
    "content": "Highly recommend \nCar needs\n panel beater and sprayer in Ħamrun! Super happy with the job flawless! They are friendly and patient. I found them through this channel as someone referred them, and I decided to try their service. Thank you, guys! Just sharing my genuine experience."
  },
  {
    "post_number": 233,
    "content": "Hi Good Morning, i want someone to create a  simple booking website that will not be expensive? Can anyone help ?"
  },
  {
    "post_number": 234,
    "content": "Home Internet min hu l aqwa f Malta?"
  },
  {
    "post_number": 235,
    "content": "Any suggestions for same/next day flower delivery? Apart from Romano. Thanks"
  },
  {
    "post_number": 236,
    "content": "Any recommendations for furniture finishings for a small boutique where quality & service is not compronised.\nRC Installations & More"
  },
  {
    "post_number": 237,
    "content": "Hi I am looking for a restaurant with private area, or a venue whereby I can have stand up drinks and nibbles for around 35 peoplr for my daughter’s 1yr bday on a Sunday lunch - any suggestions?"
  },
  {
    "post_number": 238,
    "content": "Very well served by Pantar Road. Ahjar tohrog bil canoe jew jet ski ghax tasal iktar malajr. Anke goggles u flippers recommended"
  },
  {
    "post_number": 239,
    "content": "Best place to get a rental investment furnished?\nSo far checking Distinct Homes and BDI...."
  },
  {
    "post_number": 240,
    "content": "Any suggestions for same/next day flower delivery? Apart from Romano. Thanks"
  },
  {
    "post_number": 241,
    "content": "Any recommendations for furniture finishings for a small boutique where quality & service is not compronised.\nRC Installations & More"
  },
  {
    "post_number": 242,
    "content": "Highly recommend \nCar needs\n panel beater and sprayer in Ħamrun! Super happy with the job flawless! They are friendly and patient. I found them through this channel as someone referred them, and I decided to try their service. Thank you, guys! Just sharing my genuine experience."
  },
  {
    "post_number": 243,
    "content": "Hi Good Morning, i want someone to create a  simple booking website that will not be expensive? Can anyone help ?"
  },
  {
    "post_number": 244,
    "content": "Hey everyone, I’m looking for a reliable aluminum specialist to fix two windows that aren’t closing properly. If you have any recommendations, please let me know. \nPreferably someone who is efficient and trustworthy. Thanks in advance"
  },
  {
    "post_number": 245,
    "content": "Any reliable contact for Toshiba tv electrician - \nManaging to watch iptv but for some reason no Netflix - \nSeems to be losing its memory"
  },
  {
    "post_number": 246,
    "content": "Good Afternoon,\nWould you please recommend a good doctor for Dementia.\nThank you!"
  },
  {
    "post_number": 247,
    "content": "Anyone knows where I can buy an air hostess costume for a 5yr old girl?"
  },
  {
    "post_number": 248,
    "content": "By any chance do you know someone that will fix puncher that opens on Sunday please but not of Luqa"
  },
  {
    "post_number": 249,
    "content": "Hawn xi hadt ghandu cluster ta Toyota tercel automatic ta Sena 1998/99 ."
  },
  {
    "post_number": 250,
    "content": "Any reviews about Bed and Sofa Żabbar please?"
  },
  {
    "post_number": 251,
    "content": "Good Evening \nCan you please tell me where I can buy one like this please thank you!!"
  },
  {
    "post_number": 252,
    "content": "Is it normal only to be receiving this amount on 12 Solar Panels for a 2 month period?"
  },
  {
    "post_number": 253,
    "content": "We need a fridge technician who can assist us preferably tomorrow morning.."
  },
  {
    "post_number": 254,
    "content": "Ghandi bzonn electrician . Mhux SE nghidilkhom illejla ghax naf li mpossibli imma almenu filghodu . Qeighed bla dawl grazzi"
  },
  {
    "post_number": 255,
    "content": "Hi, xi mastrudaxxa jaqdini ghada kemm jamilli 3 toqbit tac capetti please"
  },
  {
    "post_number": 256,
    "content": "Tafu xi hanut li jikri magdrill li jkollu 40mm annular cutter mijaw, ehl andu imma ta 30 u 50mm cutter andu ma nahdimx bijom, thx"
  },
  {
    "post_number": 257,
    "content": "Any courier service from usa to malta (not send on) as need shipment asap"
  },
  {
    "post_number": 258,
    "content": "I recently purchased a wet and dry cleaner to be able to clean my car/carpets/sofa with. May i ask which upholstery shampoo/detergent are you using with yours, please? I am looking at the bissell detergent and it costs 24e for 1.5l concentrated one and I m finding it a bit too expensive. thank you"
  },
  {
    "post_number": 259,
    "content": "If any y’all spa lovers wanna enjoy a nice relaxing day at a spa, I fully recommend this place called Pasha Aesthetics that I’ve been to yesterday, an AWESOMAZING incredible experience with a very talented gifted young therapist called Simona, she has an incredible gift of skills and so many different massages, facials and heavenly treatments that leaves me speechless and so grateful to go here and enjoy my relaxation!!! Book an appointment on 77790002 and enjoy your relaxation time!!!"
  },
  {
    "post_number": 260,
    "content": "Does anyone know where i can find these mini champagne bottles (used as party favours) locally please ?"
  },
  {
    "post_number": 261,
    "content": "Looking for someone who can do this type driveway in concrete, patterned or gravelled."
  },
  {
    "post_number": 262,
    "content": "Does someone knows from where i can find this floor wash?"
  },
  {
    "post_number": 263,
    "content": "X'tahsbu fuq ceiling hoods \"Sirius\" hawn minn ghandu bhalu pls? Tks"
  },
  {
    "post_number": 264,
    "content": "Hello!! Who do you reccomend for Steel apertures OR thin profile Aluminium ?"
  },
  {
    "post_number": 265,
    "content": "It seems that the only way companies answer the phone is when you shame them on this site.  This time \nAPS Bank\n have been trying to call on 25603517/3095/3260 for the past 1 hour.  Either not answering or line busy.  They do not call back when you email them.  Gone are the days when \nAPS Bank\n was customer friendly."
  },
  {
    "post_number": 266,
    "content": "Any recommendations for car Windscreen replacement please? Thanks"
  },
  {
    "post_number": 267,
    "content": "Nixtiequ nirringrazjaw lil tabib ta Oncology Dr Zack Busutill , nurses u carers ta MAU 3 Mater Dei Hospital ta paliative care  li taw lil papa Saviour Scicluna u li kienu ta ghajnuna u support kbir lil tawna lilna lil qrabatu"
  },
  {
    "post_number": 268,
    "content": "I want to Sell the furniture. Like various antique Showcase, Chest of drawers, wardrobes, frames etc....\nXi hadd ibghattal post minn ghamara antika w jghati prezz tajjeb ta kollox ? Halli in number tal mobile fil comment pls. \nGrazzi."
  },
  {
    "post_number": 269,
    "content": "anyone know from where i can import a laptop battery online? some shops here do so but how?"
  },
  {
    "post_number": 270,
    "content": "Guys please no judgement \n is there anyone who still does those custom plastic covers for sofas? (needs protection from 2 bulldogs!)"
  },
  {
    "post_number": 271,
    "content": "Min fejn idealment immur biex nixtri Electric Scooter min dawn li jtellaw 45 KM/H ?"
  },
  {
    "post_number": 272,
    "content": "IMPORTANT ANNOUNCEMENT \nWe as YOUR BLINDS Malta would like to officially clarify that Blinds Malta and Yulian (Bulgarian national) and anyone representing this name has nothing to do with us or anyone of us including our General manager Paul Pace\nWe completely disassociate ourselves from this business name, individuals and entity.\nAny actions, communications, or business dealings conducted by Blinds Malta, Yulian or anyone representing them are solely their own and do not reflect or represent YOUR BLINDS Malta in any way.\nWe appreciate your continued support and trust in us. If you have any questions or concerns, please feel free to reach out.\nWe are YOUR BLINDS Malta not any other part name or similar. \nThank you.\nTHE TEAM \nYOUR BLINDS MALTA"
  },
  {
    "post_number": 273,
    "content": "Hi there, looking for vendors to provide lunches for an office (ideally not boring stuff like sandwiches). I've already gotten in touch with a few but any suggestions  that are delicious and not super greasy are welcome! Thanks in advance."
  },
  {
    "post_number": 274,
    "content": "Thank you to the kind lady who came to close my EV charging port cover (which I left open  by mistake) whilst waiting in traffic this afternoon.  Impressed and inspired by such care and kindness. Good people exist."
  },
  {
    "post_number": 275,
    "content": "Can you recommend a good quality floor tile shop in Sicily?"
  },
  {
    "post_number": 276,
    "content": "Hi good evening, ghandi bżonn nutar li sservi gewwa ghawdex u li tifhem f’kirjiet. Grazzi bil-quddiem."
  },
  {
    "post_number": 277,
    "content": "I went to sisley sliema shop to change a top which when I went home it didn't fit.\nThe 2 salesgirl were extremely helpful\nSorry I didn't catch your names\nBig welldone for your customer care"
  },
  {
    "post_number": 278,
    "content": "Hawn xi hadd jaf lil mara li tgharma fuq il monti tbieh il make up ghandi bzonn isimha jew contact ghax bahseb li hallejt xi haga fuq l- istall taghha grazzi min quddiem"
  },
  {
    "post_number": 279,
    "content": "Hi. I need a large white paper 57 cm x 71.cm or bigger. Can anyone know where I can buy it please ?"
  },
  {
    "post_number": 280,
    "content": "Tafu xi hanut ghandu minhom pls ?"
  },
  {
    "post_number": 281,
    "content": "Someone who can do a service for a toyota vitz south areas pls"
  },
  {
    "post_number": 282,
    "content": "Anyone knows from where I can find a Glinda wicked costume?"
  },
  {
    "post_number": 283,
    "content": "McDonald's drive through what the hell is your problem??!! Why did you refuse to take my order because I was without my car??!! Unbelievable"
  },
  {
    "post_number": 284,
    "content": "Has anyone else encountered utterly tasteless tuna steaks from Greens in Swieqi? Let's see what my local stray cat has to say."
  },
  {
    "post_number": 285,
    "content": "Għeżież din hi Triq Desguanez, San Pawl il-Baħar fejn għana villeġjatura żgħira. Problema hi li t-triq tant qedgħa fi stat ħażin li biex jiġu bl'għamara qed nissogra jkolli l-ksur. Kellimt lil\n Kunsill Lokali San Pawl il-Baħa\nr iktar minn darba u ma wasalt mkien.\nL-ewwell qaluli li din f'idejn \nInfrastructure Malta\n, Infrastructure Malta qaluli li f'idejn il-kunsill. Ċempilt il-Kunsill il-ġimgħa li għaddiet u l-iskrivan Ishmael ma kien ta' għajnuna ta' xejn. Dan baqa jirrepeti li m'hemmx edeja meta se titranġa. Qalli li se jgħid lis Sindku u s-Sindku kien se jċempili hu fi żmien ġimgħa. Ġimgħa għaddiet u ma ċempel ħadd, ċempilt jien u l-istess skrivan qalli li għandu aħbar għalija, għidt ejja x'inhu ġej, l-aħbar kienet li l-affarijiet huma kif qalli l-ġimgħa l-oħra jiġifieri dawn bażikament qed jgħidu \"ma jimpurtaniex\".\nL-ewwel mhux tagħna imma ta' Infrastruce Malta, imbagħad għax inbiddel il Kunsill (f'Ġunju 2024, seba xhur ilhu), imbagħad għax m'għandhomx kuntrattur.\nGħallura hawn Malta biex issir xi ħaġa jrid ikun l-għejliet l-ellezjoni jew forsi jkun joqgħod is-Sindku f'dik it-triq jew xi ras kbira oħra?\nJien avżajthom li dalwaqt tiġi l-amara u jekk ikun hemm xi ksur niftaħ kawża l-qorti għad danni.\nIssa nhar is-Sibt li ġej hemm il-laqgħa mar residenti imma tista tattendi biss jekk l-ID card hija fl address ta' San Pawl il-Baħar, jiġifieri jekk din villeġjatura ma tistax tmur u din tagħmila ovvja li dawn mil voti biss jimpurtahom u mhux mis-servizz.\nX'nagħmel?\nAre You Being Served?(Rubs of Moira and Francesca's The Original)\nTimes of Malta\nRobert Abela"
  },
  {
    "post_number": 286,
    "content": " URGENT \n Roadworks on Triq il-Qalb Imqaddsa in St. Julian's force residents to exit through an EXTREMELY DANGEROUS blind spot onto Triq Mikiel Anton Vassalli. This urgent issue must be addressed before a catastrophe occurs. Please reshare so the right authorities can see - sending emails/calling is not urgent enough.\n Transport Malta\n  Kunsill Lokali San Ġiljan"
  },
  {
    "post_number": 287,
    "content": "I want to use this site to share a positive experience and congratulate menrad eyewear san gwann for their exceptional service . Lately I  accidentally drove over my rayban sunglasses and without expecting much I tried my luck at menrad . They checked it out there and then and to my surprise they\n managed to fix the frame . To my even greater surprise,  within two days I had my ray ban back fitted with new lenses. Truly exceptional  service  ! Thankyou and well done to  the staff who are most  helpful and most of all  give a service with a smile.   \n keep it up."
  },
  {
    "post_number": 288,
    "content": " **Lost Nissan Car Key Alert!** \nAttention everyone! \n**Lost a Nissan car key** in the Marsaskala area. If you come across it anywhere, please call **79087100**. Your assistance would mean the world! \nLet's unite to find this key! Thank you! \n **#LostKey #HelpNeeded**"
  },
  {
    "post_number": 289,
    "content": "Looking for a baker who can do heart shaped burger buns please.\nThanks"
  },
  {
    "post_number": 290,
    "content": "Paying ARMS bill online\nHaving trouble paying my bill online again. Anyone else having problems please?"
  },
  {
    "post_number": 291,
    "content": "Tafu lil xi hadd jaghmel minn dawn…flok blockout curtains ikun jista jkellimni?\nGrazzi"
  },
  {
    "post_number": 292,
    "content": "Xihadd jista jajdli fejn inisib nixtri teddy bear kbir min malta please?"
  },
  {
    "post_number": 293,
    "content": "Xi hadt ibih citrus spray please ?\nPm pls"
  },
  {
    "post_number": 294,
    "content": "Lil min sibtu tajjeb ghal parts tal VW?"
  },
  {
    "post_number": 295,
    "content": "Suggestions for reliable and professional car service for Renault Captur preferably in Zurrieq, Qrendi or Mqabba. Thank you"
  },
  {
    "post_number": 296,
    "content": "Who makes these kind of fencing screens in aluminium please? They would serve to fence of an outdoor area for privacy. Pictures for reference only."
  },
  {
    "post_number": 297,
    "content": "Hello all. Looking for someone to install a glass and aluminum door. Any recommendations please"
  },
  {
    "post_number": 298,
    "content": "Any supplier for xerox 6015 toner??"
  },
  {
    "post_number": 299,
    "content": " **Lost Nissan Car Key Alert!** \nAttention everyone! \n**Lost a Nissan car key** in the Marsaskala area. If you come across it anywhere, please call **79087100**. Your assistance would mean the world! \nLet's unite to find this key! Thank you! \n **#LostKey #HelpNeeded**"
  },
  {
    "post_number": 300,
    "content": "Hi looking for a technician on dishwashers? Thankyou"
  },
  {
    "post_number": 301,
    "content": "Very well served by Giovanni at \nEurosport Malta\n, B'Kara shop.\nYour patience and professionalism made a big difference. Helping an indecisive costumer to choose the perfect running shoes. Thanks!"
  },
  {
    "post_number": 302,
    "content": "Min ikollu bhal dan malta? Grazzi"
  },
  {
    "post_number": 303,
    "content": "I am looking for a very reliable and neat tiler to fix a broken tile in shower and to replace the tile and also clean and redo the grouting on a number of tiles in same shower. Any recommendations please ? Thank you."
  },
  {
    "post_number": 304,
    "content": "Good Morning, I need recommendations for somebody who fixes/maintains old wooden Maltese balconies pls \n Thanks"
  },
  {
    "post_number": 305,
    "content": "any handyman for jobs ? or similar pls thankyou"
  },
  {
    "post_number": 306,
    "content": "tafu tfakruni liem kienet dik il kumpanija li kienu jireklamaw li jaqilawlek kamra tal banju u jwahlu ohra f gurnata. Niftakar li kienet kumpanija tal madum u i jbijaw l kmamar tan banju imma nsejt min"
  },
  {
    "post_number": 307,
    "content": "Can someone recommend a grandfather clock repairer pls? S Demanuele are not  taking any bookings so I need someone else."
  },
  {
    "post_number": 308,
    "content": "Looking for a remote control for my awning. Agent hasn't got them anymore. Anyone has one and for some reason not using it anymore, I would appreciate it.\nThank you"
  },
  {
    "post_number": 309,
    "content": "Good afternoon, looking for recommendations for mobile phone shops, preferably those that offer payment schemes. TIA"
  },
  {
    "post_number": 310,
    "content": "Recommendations for a good Turkish kebab place in Sliema . Good value for money"
  },
  {
    "post_number": 311,
    "content": "Anybody knows who sells vitamix blenders in Malta. Have searched online but could not find.\nThanks"
  },
  {
    "post_number": 312,
    "content": "Hawn xi hadd jaf ghand min nista nibaghat purtieri tal-bellus biex jinhaslu please ? Grazzi"
  },
  {
    "post_number": 313,
    "content": "Very well served by Browns Zebbug!\nThe staff is always kind and helpful, but I have to give special mention to a lovely young lady with black hair—she goes above and beyond to assist in every way possible.\nKudos to the entire team for their outstanding service! Every time I visit, they do their best to help with anything I need."
  },
  {
    "post_number": 314,
    "content": "Ghandi dar u qed infittex bennej li jahdem bi tpartit li jibda u ilesti . Any recommendations?"
  },
  {
    "post_number": 315,
    "content": "Anyone who makes deli platters and can make delivery in south areas please?"
  },
  {
    "post_number": 316,
    "content": "Compliments to \nElia Caterers\n for their amazing Villa Overhills and their divine food.Colton who took care of my daughters wedding yesterday is a treasure in your company,he made the day extra special with his care and top notch service.Blessings "
  },
  {
    "post_number": 317,
    "content": "Hello,\nI am looking for a handyman to unlock a stuck drawer.\nThanks for your help"
  },
  {
    "post_number": 318,
    "content": "Well served by \nKingMobile Malta\n, efficient communication, fast delivery and competitive prices! Not my first purchase and not the last!"
  },
  {
    "post_number": 319,
    "content": "Not being served by \nEpic mt\n (again) - if you're looking for home internet, do yourself a favour and avoid Epic \nMy partner and I shifted to Epic around a month and a half ago. We opted for the 2000mbps fibre internet package as I work from home. During this time, we've only had this service functional for Atkins hang the time. \nThe internet cut out completely 3 times, needing technicians to visit. Last time they visited the internet was out in less than 24hrs. The worst part is being promised a phonecall the next day, everyday for a week.\nLife is stressful enough. Do yourself a favour and avoid the hassle of epic. The amount of time I've wasted because of them just left month is just ridiculous.\nPS, when fibre is connected & functional, I've never seen it exceed 800mbps (out of 2000)."
  },
  {
    "post_number": 320,
    "content": "Do you know of a doctor who does house visits in the Mosta area please?"
  },
  {
    "post_number": 321,
    "content": "Kindly recommend places from where to buy car seat covers for a BYD. Thanks."
  },
  {
    "post_number": 322,
    "content": "Xi hadd jghamilli bhal dawn pls al hanut pls  fi zmien ir ramadan?"
  },
  {
    "post_number": 323,
    "content": "Hi do you know from where I can buy professional hair dye which is PPD and PTD  free? Thanks"
  },
  {
    "post_number": 324,
    "content": "Good afternoon. I am trying to purchase an item from nsejt.mt but the system is not letting me complete the order despite it being said to be in stock. Does anyone know if the said website is up and running, accepting orders for delivery please?"
  },
  {
    "post_number": 325,
    "content": "Best corporate lawyers in Malta recommendations please? Tried and tested. TIA"
  },
  {
    "post_number": 326,
    "content": "Does anyone know where I can buy a battery for dyson 11 please?"
  },
  {
    "post_number": 327,
    "content": "Xtaqt nhalli feedback tajjeb hafna lill \nShirley Bonello\n Tal prodotti li gabitli, pruvajt IL prodotti taghha Tal hwejjeg ghax is suwed u xugamani ma bdejtx inhosshom li  qed jigu jfuhu bxejn , kif xtrajt IL prodotti taghha specjalment IL prodotti ta la Bella lavanderia kulhadd jghidli xriha tfuh gibt mieghek. Ghal min ghandu din IL problema nirakkimandahom hafna."
  },
  {
    "post_number": 328,
    "content": "Not served by GO plc!\n\nI recently checked my balance on my GO prepaid mobile and was surprised to find only €0.02 left, despite being certain I had a large amount topped up. Since I have another mobile number with a contract with epic, I rarely use the GO number, so I contacted GO’s customer care on Whatsapp to verify any deductions.\nTo my surprise, I was told that I must physically visit a GO outlet just to check my own usage history. This is not only inconvenient but completely unreasonable—especially for those who are elderly, infirm, or unable to visit a store easily.\nCustomers should have the right to access their usage details remotely!\n\nAll we seem to be getting from GO these days are price increases for features we do not want or need. How about they start by implementing basic improvements in the core services we actually do use instead?\n\nGO, please wake up, improve your service and respect your customers' time!\n#GOMalta #CustomerService #DoBetter #consumerprotection"
  },
  {
    "post_number": 329,
    "content": "Last Friday as we were early for the ferry in Cospicua, we were impressed by this coffee stall. Had a coffee and tea and both product and cleanliness was impressive. The coffee machine was gleaming like new, as can be seen in this picture. Will definitely stop by again "
  },
  {
    "post_number": 330,
    "content": "𝐅𝐮𝐫𝐧𝐢𝐬𝐡 𝐘𝐨𝐮𝐫 𝐇𝐨𝐦𝐞 𝐏𝐫𝐨𝐦𝐨 𝐌𝐨𝐧𝐭𝐡 is here at Oxford House! \nSwipe right on the perfect kitchen for you — just like Chef Roberta found her match. Our team is ready to help you find the home furniture that feels just right.\nBook your consultation now \n https://bit.ly/oh-homefurnitureconsultation\n#OxfordHouse #Malta"
  },
  {
    "post_number": 331,
    "content": "Can anyone recommend a reliable service or individual who can pick up bulky waste (including old chairs and some electronic items) and properly dispose of it at a collection center? We don’t have a car, so we can’t transport it ourselves, and unfortunately, two companies we contacted never followed through. Any recommendations would be greatly appreciated!"
  },
  {
    "post_number": 332,
    "content": "Does anyone know of companies that organize quiz/bingo events for around 30 people please"
  },
  {
    "post_number": 333,
    "content": "Does anyone know from where I can find this brand please pama are out of stock ( have been for a long time )\nThank you in advance"
  },
  {
    "post_number": 334,
    "content": "Ghandna bzonn arluggar li jaf jirregola larlogg tal lira tal batteries ghax hu jahdem imma ma jridx idoqql"
  },
  {
    "post_number": 335,
    "content": "Any reliable automatic washing machine technician please?"
  },
  {
    "post_number": 336,
    "content": "Any recommendations for a good lawyer whose expertise is in third-party wall-related issues/ownership? Thanks"
  },
  {
    "post_number": 337,
    "content": "Where can I take ps5 to put in an internal SSD? And maybe cleaned as well. Thankyou"
  },
  {
    "post_number": 338,
    "content": "Hi there can i ask for reviews on sofabeds from mondoconvenienza pls?"
  },
  {
    "post_number": 339,
    "content": "Badly served at #ilcortile, sat down at 13:00, placed the order at 13:20, however food wasn't served, kept asking where the food was and the staff kept telling us that it would be out in 5 minutes. Finally, at 15:00,  after asking again where the food was, the waiter told us that it would take them another 10 minutes. From the first time they told us that we would have the food in 5 minutes, 45 minutes passed so we asked for the bill. We paid for the drinks and left, not a single apology from the staff, not a discount on our drinks bill, nothing, it was business as usual for them. Today we were celebrating my parents birthday and they managed to ruin this special day, so frustrating and disappointed, watching all the people eating and us, staring at each other, with the staff avoiding us in embaressment. This was our first time there and definately the last, don't be fooled by the nice words they have listed on their facebook page, it is a mediocre place to eat, offering an awful service with no clue of customer care."
  },
  {
    "post_number": 340,
    "content": "UPDATE RE BEA\nSHE WAS LAST SEEN TODAY, SUNDAY 2ND FEBRUARY AND AN OLD MAN (LOOKING SCRUFFY AND UNTIDY) WAS HOLDING HER AND WALKING WITH HER ON THE BRIDGE OF MOSTA DIRECTION TOWARDS SANTA MARGHERITA ON THE LEFT SIDE. TO THIS KIND SOUL WHO MANAGED TO GET HER CAN YOU PLS CONTACT ME AND ANYONE WHO HAS ANY NEWS ABOUT HER PLS LET ME KNOW "
  },
  {
    "post_number": 341,
    "content": "hello hemm xi hadd jista jaqdini? ghandi bzon hp charger 65w bhal tal rittrat, grazzi hafna "
  },
  {
    "post_number": 342,
    "content": "Looking for a restaurant that can cater a small party with finger food and open bar for about 25 people."
  },
  {
    "post_number": 343,
    "content": "Does anyone know from where I can buy like this from local?"
  },
  {
    "post_number": 344,
    "content": "This busy road which is the only Entrance to Swieqi from Naxxar, Triq Santa Katerina Gharghur has been neglected for months with cars passing a  few centimeters away from falling into a quarry. Transport Malta take necessary action before a deadly accident happens here."
  },
  {
    "post_number": 345,
    "content": "dalghodu mort naqlgha darsa min Medjatrix ta Haz Zabbar. Wara l kedda li tajtha miskina lid dentista ghax id darsa bdiet titfarrak, tghidx kemm hadet hsiebi!  qabel ma kienet certa li qeghda sew ma hallietniex immur, u meta wasalt id dar nircievi telefonata ha tara kif jien! veru serviz tajjeb u kif suppost! grazzi lid dentista Dr Debbie u anke l istaff. prosit"
  },
  {
    "post_number": 346,
    "content": "Hello. We are looking to get 3 quotes for kitchens. Where would you recommend please? \nEdwin Vella"
  },
  {
    "post_number": 347,
    "content": "Any one in Malta that has this in stock pls? Thanks in advance"
  },
  {
    "post_number": 348,
    "content": "Can anybody please recommend a reliable and serious electrician/plumber for home jobs."
  },
  {
    "post_number": 349,
    "content": "Hi everyone! Does anyone know who can sell or make something like this locally? Looking for something similar. Any recommendations are greatly appreciated, thank you!"
  },
  {
    "post_number": 350,
    "content": "Any recommendations for HAND ASSEMBLED modular lifters please?"
  },
  {
    "post_number": 351,
    "content": "Doctors home visit central area on a weekend please?"
  },
  {
    "post_number": 352,
    "content": "Looking for bars that will show Malta Eurovision finals on Saturday. Any suggestions please?"
  },
  {
    "post_number": 353,
    "content": "Hi, ghandkhom xi suggerimenti ( links) ta showrooms jew kumpaniji li jaqalaw bathroom antika u jwahhlulek il gdida kollox huma inkluz soffit? Thanks"
  },
  {
    "post_number": 354,
    "content": "Aftersale and quality reviews on internal doors from Cieffe Joinery LTD please?"
  },
  {
    "post_number": 355,
    "content": "Any recommendations for a private tutor for Physics and Biology for a Form 3 student in the Pietà area? Preferably someone available for one to one lessons. Thanks!"
  },
  {
    "post_number": 356,
    "content": "Today, we encountered an unacceptable experience with our recent Wolt order. The restaurant confirmed that we were supposed to receive six pieces, yet the box arrived completely unsealed, with everything turned upside down and only two pieces inside. Although we submitted a complaint to Wolt, and it was eventually resolved, this situation highlights a significant flaw.\nI strongly urge all restaurants that offer delivery to adopt a policy of sealing their boxes securely or at the very least, enclosing them in a tamper-proof plastic bag. This is just a suggestion; it is essential for ensuring accountability. If a courier were to mishandle our food, it should be immediately obvious due to a torn seal. Implementing this standard is crucial for maintaining trust and safeguarding the customer experience."
  },
  {
    "post_number": 357,
    "content": "Would anyone know where I could find a wall calendar like this please, showing 4 months at a time?"
  },
  {
    "post_number": 358,
    "content": "A big thank you to Maria of Agenda bookshop in Mosta Pama for going out of her way to help me get the wooden ornaments I required short notice. Very helpful and kind....Thanks a million"
  },
  {
    "post_number": 359,
    "content": "Looking for a Hotpoint washing machine second hand motor. No fancy prices please . Or a scrap w/m ."
  },
  {
    "post_number": 360,
    "content": "I’m looking for a blower for a Nissan qashqai is there anyone that sells qashqai parts please?"
  },
  {
    "post_number": 361,
    "content": "Any recommendations for technician for Ariston Hotpoint dishwasher please?"
  },
  {
    "post_number": 362,
    "content": "Any reviews about Cieffe Joinery LTD regarding internal doors? Build quality and aftersales? TIA"
  },
  {
    "post_number": 363,
    "content": "Hi , does anyone know where I could find the following heaven temple Chinese balm ? The green one as in the picture.\nI need to buy some for an elderly man who suffers with headaches , and this is the only thing which helps him."
  },
  {
    "post_number": 364,
    "content": "I recently (24th January) sent this message to Epic. mt \nGood afternoon,\nI have just returned from paying a bill at your Republic street office and may I say, I feel disgusted at the way I was treated by a shabby looking teen whom I didn’t even recognize by the way her dyed hair looked and also the way she was dressed. This ordeal (as I cannot call it any less than this) started as a certain Lydon (he wouldn’t even give me his surname) who seemed very tired as he was even yawning whilst serving us declined to print me a copy of the statement of bills we paid as I didn’t have an ID. However, I did offer to show him a photo shot as I keep it handy. He replied that company policies require a physical ID. Fine! As I was complaining about this policy this (again) shabby girl with no uniform, who wouldn’t even give me her name, as she said I’m not her manager, pounced from nowhere telling me not to shout! Now if you have voice sensing cameras, you can obtain your proof whether I was shouting or not. I asked her ‘who are you?’ as I truly didn’t recognize that she represented Epic. To be honest I thought she was one of the teenage girls that hang around Mc Donald’s opposite, but regardless of this. May I ask why your reps have no uniform? Is this a cost cutting decision as in low cost carriers where you pay for a service and that’s it? No customer service whatsoever? I’m stating this as I was utterly astonished at the way she spoke to me in such an arrogant manner. Now, this is all being copied and I’m keeping it private so as to see how you are going to handle this. I’ll patiently await your comments, if any. \nThank you for your time. \nTo date, received none!"
  },
  {
    "post_number": 365,
    "content": "Amy fridge technician to fix fridges. The compressor is not working. Thank you"
  },
  {
    "post_number": 366,
    "content": "Hi everyone! I'm looking for recommendations for a skilled worker or company that specialises in gypsum partitioning for an office space at reasonable prices. If you’ve had a good experience with someone, please share their contact details or any photos of their work. I’d really appreciate any suggestions. Thanks in advance!"
  },
  {
    "post_number": 367,
    "content": "Looking for recommendations best prices and service on fixed canopy for yard"
  },
  {
    "post_number": 368,
    "content": "Hi, does anyone know where I can find similiar chairs like the ones below please?"
  },
  {
    "post_number": 369,
    "content": "Hi do you know from where I can buy this type of feature wall pls"
  },
  {
    "post_number": 370,
    "content": "Minn tissugerixxu ghal art bil konkos u jaddija bil power float? Pfa"
  },
  {
    "post_number": 371,
    "content": "I need to make a retractable pergola in a residential apartment, does anyone have any recommendations for a reliable company with reasonable prices please?"
  },
  {
    "post_number": 372,
    "content": "Looking for advice on a reliable cleaning company who can POWER WASH a floor with a MACHINERY with brushes and chemicals.\nSome guests dropped vinegar or sgrassatore (I saw the bottles left around) on my tiles which are very porous / matte and they attract the dirt. \nNow some tiles look “cleaner” than others and one can see the splashes of detergents. \nI would like to have them all cleaned evenly. \nAny recommendations please? Thanks!"
  },
  {
    "post_number": 373,
    "content": "Where can I find a \n scissor blade sharpener.  There was one in San Gwann near the church.  Still there please?"
  },
  {
    "post_number": 374,
    "content": "Suġġerimenti ta' Xi ħadd li jibdel dawn il-pompi tal-bieb? Grazzi"
  },
  {
    "post_number": 375,
    "content": "WOLT - Deplorable service!!!\nI used them 3 times this week and each time the delivery was very late and the food cold!!! When I tried to speak to their Customer Service, I got nowhere! What a rip off! I don't usually post on RUBS, but this is unacceptable "
  },
  {
    "post_number": 376,
    "content": "LOST\nLast seen in the Mosta area, on the 31st January, near Oratorju Qalb ta’ Ġesu’ around 8pm. Claimed to have been seen on the 1st February, around Birguma area as well. If found pls contact me asap on 99858673. Her name is Bea, she is very timid and gets scared easily. She is dearly missed. She was taking medication due to an infection \nPLS SHARE \n HELP ME FIND HER!!!"
  },
  {
    "post_number": 377,
    "content": "Hi. Good afternoon; could you please indicate where i could purchase such stools. Thank you."
  },
  {
    "post_number": 378,
    "content": "Does anyone know from where can I find spare parts for candy or hoover washing machine please?"
  },
  {
    "post_number": 379,
    "content": "LOST\nLast seen in the Mosta area, on the 31st January, near Oratorju Qalb ta’ Ġesu’ around 8pm. Claimed to have been seen on the 1st February, around Birguma area as well. If found pls contact me asap on 99858673. Her name is Bea, she is very timid and gets scared easily. She is dearly missed. She was taking medication due to an infection \nPLS SHARE \n HELP ME FIND HER!!!"
  },
  {
    "post_number": 380,
    "content": "LOST\nLast seen in the Mosta area, on the 31st January, near Oratorju Qalb ta’ Ġesu’ around 8pm. Claimed to have been seen on the 1st February, around Birguma area as well. If found pls contact me asap on 99858673. Her name is Bea, she is very timid and gets scared easily. She is dearly missed. She was taking medication due to an infection \nPLS SHARE \n HELP ME FIND HER!!!"
  },
  {
    "post_number": 381,
    "content": "Can anyone suggest where I can find like this outdoor lounge. Thank you."
  },
  {
    "post_number": 382,
    "content": "Lost keys in xhajra zabbar!"
  },
  {
    "post_number": 383,
    "content": "I am looking for a carer for an 82 years old woman. Are you available 24 hours for one week or more, with a qualified carer certificate?"
  },
  {
    "post_number": 384,
    "content": "Bongu lil  kulħadd. Xi hadd jaf min fejn nista insib nixtri dan il prodott? \n Jekk jista ikun B' kara/Sta Venera area. Grazzi"
  },
  {
    "post_number": 385,
    "content": "Any recommendations for wooden balcony and louvres restoration please? Only interested in professional workmanship please!"
  },
  {
    "post_number": 386,
    "content": "Hi, Does anyone know of a supplier in Malta that offers artificial turf in colors other than green? I would appreciate any recommendations, thank you."
  },
  {
    "post_number": 387,
    "content": "I'm gonna try my luck again - Are there any improvisational theatre/comedy groups in Malta, for beginners? \n Thanks "
  },
  {
    "post_number": 388,
    "content": "Are there any companies that lease scooters / motorbikes for 1 - 6 month periods, possibly even 1 year?"
  },
  {
    "post_number": 389,
    "content": "Would anyone know who services DeLonghi Nespresso machines? \nThe milk frother is not working properly anymore."
  },
  {
    "post_number": 390,
    "content": "Need a tailor for a Mascot Costume (Similar to Carnival Costume)"
  },
  {
    "post_number": 391,
    "content": "Liema spiżjari jkollhom dawn il-helu tal-grizmejn? Diffiċli hafna biex insib u hafna ahjar minn strepsils ghax ma jiġux ramel jew ihallu toghma morra.. grazzi"
  },
  {
    "post_number": 392,
    "content": "I lost (both) keys to my bicycle roof rack (Whispbar). Anyone ever found her/himself in my same predicament and managed to solve the issue please? The claw is currently unlocked but I need a key to secure bike when mounted."
  },
  {
    "post_number": 393,
    "content": "Is there a turnkey service to fully furnish a 3 bedroom apartment excluding bathrooms and doors?\nNot interested in tile laying, electricity, plumbing etc..."
  },
  {
    "post_number": 394,
    "content": "Very well served by DHL on demand. Unlike UPS, they are efficient, prompt, give you day and time of delivery. I was abroad so went on the ‘on demand’ and you get to choose the day of delivery. Can’t say the same for UPS who give either no information or the wrong information. Well done \nDHL\n."
  },
  {
    "post_number": 395,
    "content": "Need windows and doors for new house and Aluserv/Servgroup gave me a quote. They seem great with so many installations across Malta, but I have only been here a year so would you recommend? Appreciate help "
  },
  {
    "post_number": 396,
    "content": "Is it possible to install ISOFIX brackets on a Toyota Corolla 2005"
  },
  {
    "post_number": 397,
    "content": "Any reliable electrician for an emergency? Need assistance today"
  },
  {
    "post_number": 398,
    "content": "Hi, i need a sprayer to spray a bumper since the paint crack and need to be same color. Ideally need to have the tool to read the color. Any recommendations, tks"
  },
  {
    "post_number": 399,
    "content": "Just wanted to give a round of applause to \nCitadel Insurance\n employees.\nLast thursday I called with regards to a claim, the lady at the reception put my call through department for parts.\nI explained my issue to the guy who replied to my call , and he promised he will check and call back.\nGuess what? I had to call myself yesterday as no one from Citadel called back.\nThe excuse? I wrote you number incorrectly.. I am your client my number should be in your data base \nAnyway - he explained that I had no grounds to complain, but when I insisted he told me he will put me through with his superior, however instead of forwarding the call , I ended up hearing a whole conversation between the guy and a second man about my call and what i had told him.. a few moments later i heard the second man shouting “ ghaddiha mieghi , qabbadni maghha “ with a challinging tone ,  too bad the first guy does not how to use a phone , after a few min i gave up and ended the phone call also on my end\nWell done Citadel Insurance very professional employees you have there \nPs if you want to know what i have listened there is a recorded phone call , hopefully it’s still in your data base as phone calls from Aug-24 go way to back and are no longer in your possession "
  },
  {
    "post_number": 400,
    "content": "Where can I find this type of chairs in Malta please?"
  },
  {
    "post_number": 401,
    "content": "Anyone knows from where can i find this product, please?"
  },
  {
    "post_number": 402,
    "content": "Urgently \n Looking for someone or a company that can treat and remove molded interior walls of a semi detached apartment please? \nWe are hoping to get the walls treated and repainted (the landlord said they’ve been sealed from the outside). Does anyone have any recommendations and is there a month that is most suitable to get these works done in please? Thank you in advance. \n (Ps. We ventilate often during the day & have dehumidifiers on at night - this problem has been in the place before us and we’d like to get rid of it as it’s definitely not healthy!)"
  },
  {
    "post_number": 403,
    "content": "Recommendations for making a copy of a garage door remote similar to this pls? Reliable suppliers that don't charge the earth would be much appreciated \n Any area but around the Sliema, St Julians and Central areas would be a bonus. Thanks"
  },
  {
    "post_number": 404,
    "content": "hi ghandi din it tinda hu niextiq nibdila id drab ghan xihad jibdilhom pls"
  },
  {
    "post_number": 405,
    "content": "Can anyone suggest where I can find black warmers (elastic top and bottom), similar to the ones in the picture, please? I need 15 pairs. Thank you."
  },
  {
    "post_number": 406,
    "content": "Tafu min jaghmel cake ghal okazjoni specjali tried and tested pls"
  },
  {
    "post_number": 407,
    "content": "Which company would you recommend for a hospital bed? I've already obtained quotes from Ok Medical, Euro pharma, Sidroc and Unicare so I would like to know which of them offers the best quality."
  },
  {
    "post_number": 408,
    "content": "A need a man with a van for a quick job to move some boxes and bags from Qormi to Gzira please. Best value tried and tested."
  },
  {
    "post_number": 409,
    "content": "Good afternoon, We are looking for an architect that specialises in building demolition and rebuild. Tried and tested preferably that assists also in the required permit applications. Competitive pricing also a must. We have enquired a few, but the waiting list is long and this is something that is needed very soon. Thanks so much"
  },
  {
    "post_number": 410,
    "content": "Does anyone know if this Cpu9800x3d, is available for sale in Malta ?"
  },
  {
    "post_number": 411,
    "content": "Hi I am looking for someone who can repair scratches on a black\nplastic bumper any suggestions"
  },
  {
    "post_number": 412,
    "content": "Where can i find an xtra large letterbox for parcels and mail? tia"
  },
  {
    "post_number": 413,
    "content": "Hi, is a sodastream worth buying?\nI need some reviews about it please\nThank you"
  },
  {
    "post_number": 414,
    "content": "Hi \n Does anyone know where I can find the IKEA Mosslanda picture ledge in Malta? I need them quite urgently. Thanks!"
  },
  {
    "post_number": 415,
    "content": "Kindly suggest someone who can build a decking structure around a prefabricated above ground pool. Thanks"
  },
  {
    "post_number": 416,
    "content": "I have praised them before but need to do so again. A big thanks to all the staff at Mater Dei A&E. Once again they were without exception kind and gentle with my 92 year old Dad who is a frequent flier at his venerable age. Yes, we had to wait but there were clearly more urgent cases and when his turn came they couldn’t have treated him with more care and courtesy. Thank you all "
  },
  {
    "post_number": 417,
    "content": "Any local places that sell pink desks pls \nPhotos for reference\nThks in advance "
  },
  {
    "post_number": 418,
    "content": "Good Morning. \nDoes anyone know where I can find a wall mount iron table in Malta, please?\nSuch or similar like the picture below.\nTIA"
  },
  {
    "post_number": 419,
    "content": "Posting on behalf of a friend:\nHave ceiling leaking water everytime it rains heavily. Even the penthouse above got the same issue leaking roof and wall and its on the same side as ours. Would like a professional to help us find the source of this water leaking into our apartments.\nIf anyone can help, please contact on 79301293 via WhatsApp/Call/SMS"
  },
  {
    "post_number": 420,
    "content": "Any engineer who works on GMV Lift Systems independently ?"
  },
  {
    "post_number": 421,
    "content": "Good morning I would like a contact number of bolt cabs...ideally manager ... no robots please...ty\nUpdate \nNo given is only for everything except customer care human. You need to go back on app and explain few times to Alfred the robot that no you are not satisfied with response but wish to speak to a human....Will update accordingly\n7 hours later and still only robots are replying to my request to speak to management.."
  },
  {
    "post_number": 422,
    "content": "Good morning. Could anybody let me know where one can buy locally one of these, please? The important part is the Bosch product number MMB6384M, MM6382M or MMB6174S. \nNot found searching online yesterday at Scan, Crosscraft, Topchoice or AtoZ \n Found it on Amazon, but for some bizarre reason, Amazon won't ship it to Malta!"
  },
  {
    "post_number": 423,
    "content": "Post b' appetisers u diski sbieh.\nS'issa diga kellimt lil:\n1. Bottegin tal-Gilju\n2. Dos Avos\n3. Tal-Landar u kollha full-up."
  },
  {
    "post_number": 424,
    "content": "Does anyone know who stocks moulinex spare parts in Malta please?"
  },
  {
    "post_number": 425,
    "content": "Looking for fluted mdf boards.\nAnyone have them locally?"
  },
  {
    "post_number": 426,
    "content": "Highly recommend \nRestorations On Wood\n. Duncan's high level of workmanship and detail gave our tired looking front door a much needed spruce up."
  },
  {
    "post_number": 427,
    "content": "Hi, can anyone suggest if I can find something similar to these door handles locally please, thank you!"
  },
  {
    "post_number": 428,
    "content": "Where can I buy this? "
  },
  {
    "post_number": 429,
    "content": "I need to find someone who can fix/replace a zip on a Musto jacket (Gore-tex) - please only forward recommendations of people / companies that have the tools to fix such a jacket (as traditional sewing machines cannot be used on this fabric) - thanks"
  },
  {
    "post_number": 430,
    "content": "Where can I source this material new or used. Need 2-3 in all"
  },
  {
    "post_number": 431,
    "content": "Any suggestion on which garage/shop/person can convert normal front headlight (car) to LED please ?"
  },
  {
    "post_number": 432,
    "content": "Hi, does anyone know who sells these in Malta please? Thanks"
  },
  {
    "post_number": 433,
    "content": "Xihadd had jghidli minfejn insib nixtri minn dawn ? Please"
  },
  {
    "post_number": 434,
    "content": "Hi there, where can someone take an image/photograph and have it turned into a functional puzzle? Around A3 size."
  },
  {
    "post_number": 435,
    "content": "Anyone sells organic Citrus Spray please? Northern area.\nPm please"
  },
  {
    "post_number": 436,
    "content": "Would any one know where I can find Tiger Balm please? Thank you"
  },
  {
    "post_number": 437,
    "content": "I would like to say thank you to \nboost\n  for their quick response and solving a small issue with the order.  Not the first time i am placing orders with them and they have been always punctual, fast delivery, and they have the best quality suplements plus the staff is very friendly and helpful. Overall they are very reliable and i would highly recommend them !"
  },
  {
    "post_number": 438,
    "content": "Hello All\nDo you happen to know if there is any Sunday Market in Gozo, this Sunday 2nd of February? \nThanks!!!"
  },
  {
    "post_number": 439,
    "content": "Looking for someone with reasonable price for Fire door of 60mins."
  },
  {
    "post_number": 440,
    "content": "Searching for an old bakery for a short film, 1 day shoot"
  },
  {
    "post_number": 441,
    "content": "Very well served by the 1881 show by \nTeatru Malta\n https://1881.show/\nThis is not your typical show where you sit there and watch and clap a few times. This is a truly immersive experience where you are part of the show. You get to roam around the space and the various rooms, each themed with the individual character's personality. you can take your time to follow one character closely or jump around from one room to the other to experience more than one storyline. The acting was great, the costumes felt truly authentic and you really feel like you are part of the story. Well done to all the team that create such a masterpiece. Very highly recommend."
  },
  {
    "post_number": 442,
    "content": "Tixtri appliances minn ghand ventura qisek qed tixtri tumble dryer ta toys.fsentejn li il ghandi jibdlu 3 motherboard il pompa ta heater u terga ezatt fxahar terga tmur.\nXhin cempilt qaltli hekk jew bhekk uzajta xahar min fuq iz zmien li ghalqet il garanzija .\nTal misthija din mhux xi wahda cheap ghax kieku najghd talli hallast hadt imma din fuq 700€ xtrajta."
  },
  {
    "post_number": 443,
    "content": "I have an Airforce extractor hood which I have been using for around 2 years now and the buttons are not working well. The light button works perfectly but the bottons of the extractor work only if you push them and keep holding them. Once you release them they don't hold and don't work. Does anyone know if they can be fixed and who does these kind of repairs? Thank you "
  },
  {
    "post_number": 444,
    "content": "Good morning, Where can I find to buy rubber washers similar to these. Bottom diameter is 1cm. Thank you."
  },
  {
    "post_number": 445,
    "content": "Recommendations for Gypsum Ceiling work please ?"
  },
  {
    "post_number": 446,
    "content": "Hi everyone, I am looking for an ghonnella to either buy or borrow. Does anyone know where I might find one? Thank you!"
  },
  {
    "post_number": 447,
    "content": "Huge well done to kyra (i think her name was) from gravity! Greeted us with a huge smile and was super helpfull and friendly with my girls and they keep mentioning how much fun you where \n keep up the great work!!! Thank you once again x"
  },
  {
    "post_number": 448,
    "content": "Anyone available to clean my car from inside and out tomorrow Wednesday.?"
  },
  {
    "post_number": 449,
    "content": "Hi to whom it may concern, looking for a  accountant that specializes in cryptocurrencies accounting / taxation"
  },
  {
    "post_number": 450,
    "content": "Hi, can you suggest local companies who place the order for ikea Sicily themselves and deliver . Thank you:)"
  },
  {
    "post_number": 451,
    "content": "Hi Group,\nLooking for a squid game costume + mask for a 9yo boy. I am not sure whether this is the right group where to ask. In any case, any advise would be appreciated. Buying it from Amazon is ultra expensive.\nThanks."
  },
  {
    "post_number": 452,
    "content": "Anybody has a brass/ bronze chandelier for sale ?   Nothing elaborate and not very large."
  },
  {
    "post_number": 453,
    "content": "Looking for someone that would be able to cover a handbag with material to match a dress please. Tried & tested thanks"
  },
  {
    "post_number": 454,
    "content": "Looking for someone who can tap a thread for me. Any suggestions?"
  },
  {
    "post_number": 455,
    "content": "Any dentist's contact for an appointment as soon as possible please?"
  },
  {
    "post_number": 456,
    "content": "Hi, I would like to order a graduation-themed cake that will serve around 40 people. Any recommendations please? \nThank you "
  },
  {
    "post_number": 457,
    "content": "Morning \n Looking for someone to make me a picket fence similar to photo but straight line approx 5m. Any recommendations who can assist me soonish please?"
  },
  {
    "post_number": 458,
    "content": "Hiii jista xi hadd jijdli minn fejn nista nixtri hajt li thit bih ghax qas ghadek issib fil hwienet grazzi hafna"
  },
  {
    "post_number": 459,
    "content": "Looking for a plumber available to come to Mosta"
  },
  {
    "post_number": 460,
    "content": "Does anyone know where it is possible to have a fur coat cleaned?"
  },
  {
    "post_number": 461,
    "content": "Thank you Tyron & Sylvester at Phone Box, Tower Road - Sliema. Your polite service is amazing"
  },
  {
    "post_number": 462,
    "content": "Looking to install an apple carplay wired/wireless system for a VW Polo 6r. Any reasonably priced suggestions?"
  },
  {
    "post_number": 463,
    "content": "Cheapest synthetic turf please pm.\nThankyou"
  },
  {
    "post_number": 464,
    "content": "From where is the best place to buy shoe insoles please? I have a pair of Nike trainers I wish to revive. Thank you!"
  },
  {
    "post_number": 465,
    "content": "Anyone knows of a Toyota Rav4 mk1 for parts?"
  },
  {
    "post_number": 466,
    "content": "The people I bought my AC some years ago don’t provide technical assistance any more. It seems that this is now the thing and maintenance and repairs for ACs are now subcontracted out. Does anyone know someone capable of repairing an AC who doesn’t charge the earth?"
  },
  {
    "post_number": 467,
    "content": "Very disappointed. Bought a nutrimix from\nWorld marketing gor 620 euros.  After  3.5 years the display board was changed. To my dismay had trouble with it again after 3 years and same thing was changed.  It’s a disgrace such an expensive item to be defective and same repair.  I only use it rarely and so it is not because of too much use.  This product was replaced by world marketing for another model just 3 years after I bought it so I Imagine they had problems !!!!   Be aware don’t buy it like I did.  I know other people who had same problem with this appliance so not just me and same repair twice like me !!  Be aware don’t buy!!!"
  },
  {
    "post_number": 468,
    "content": "Is there a tool to detect electrical wires in walls? Can i rent it or can someone come on the location to do it please?"
  },
  {
    "post_number": 469,
    "content": "I need to purchase a number of archive cardboard files any suggestions from where pls?"
  },
  {
    "post_number": 470,
    "content": "Exceptional After Sales Service by \nMatthew Debattista Mainhobbies\n. This is probably the best local supplier for RC Models."
  },
  {
    "post_number": 471,
    "content": "Is there anyway where one can contact \nDealToday\n as I have been sending mail, messages on page and also on app but no one ever answers??!!!!"
  },
  {
    "post_number": 472,
    "content": "I am interested in the invisacook, which is basically an invisible hob. Has someone installed this and can provide any feedback please?"
  },
  {
    "post_number": 473,
    "content": "Require someone to assemble a new internal door frame - MDF."
  },
  {
    "post_number": 474,
    "content": "Do u know where i can find a natural bicarbonate of soda? \nNot e500(ii) ( its synthetic and not healthy) \nThank u"
  },
  {
    "post_number": 475,
    "content": "Want to commend \nLESA\n, \nTransport Malta\n and \nThe Malta Police Force\n for their increased presence and enforcement on our roads.\nReally hope such increased presence will be consistent and wish to thank them in advance for keeping our roads safe.\nKeep it up "
  },
  {
    "post_number": 476,
    "content": "Lil min tirrekomandaw ghal service u tindif ta extractor fans please ? Grazzi"
  },
  {
    "post_number": 477,
    "content": "Anyone knows where I can find locally hoverboards?"
  },
  {
    "post_number": 478,
    "content": "Any recommended motorcycle service mechanic in Lija area?"
  },
  {
    "post_number": 479,
    "content": "Could you recommend where I can purchase wallpapers, preferably at a reasonable price, and that also offer installation services?"
  },
  {
    "post_number": 480,
    "content": "Best Health insurances, plan, service and also prices- suggestions please."
  },
  {
    "post_number": 481,
    "content": "Hi I am looking for someone who can repair scratches on a black\nplastic bumper"
  },
  {
    "post_number": 482,
    "content": "A huge thank you to \nCasa Vespa Malta\n for their efficient, super quick and professional service.\nUnfortunately my Vespa \nwas knocked over yesterday \n and had some damage. I use it all the time as my primary mode of transport, so was in a rush to have it fixed.\nThey started working on it first thing this morning, and I had it back at 11am! \n All the parts that needed to be replaced, they have in stock. The mirror, brake, chrome piping, passenger footrest. They also touched up the damaged paint very well too. \nI would also like to note that the first time I serviced it there, after having it serviced for 5 years at different places, it was like I had a completely new bike. \nThank you Neville and the Team! "
  },
  {
    "post_number": 483,
    "content": "Xtaqt nistaqsi ghal feedback fuq uniplu pls. Tia"
  },
  {
    "post_number": 484,
    "content": "Need a plumber very very urgently in Gozo. PLS."
  },
  {
    "post_number": 485,
    "content": "Some local manufacturers must believe that you can fool all the people all the time.  A case in point is Sweet Tooth Products. Recently we came across six or eight cakes on display at a local convenience shop and noted that none of the packets had any expiration date. We contacted the local company who were “surprised” at this lack of information and promised to collect the Date & Walnut cake in question.\nThe “freshly” bought cake was not edible and after two weeks waiting for the local company to collect the item, they just were not bothered."
  },
  {
    "post_number": 486,
    "content": "10 on 10 Identity Malta... answering an email within 10 minutes...what an effective and efficient service ..well done"
  },
  {
    "post_number": 487,
    "content": "Good morning, I am looking for someone who can provide this exact colored paint preferably anti fugal and doesn't cost an arm and a leg. Any suggestions please?\nAlso if anyone would like to buy an unopened 5L bucket antifungal matte Crown mint paint, we are looking to sell as we got the wrong colour and can not return it."
  },
  {
    "post_number": 488,
    "content": "Good morning.  Looking for a calligraphy course . Anyone knows if there is one available ? Tks"
  },
  {
    "post_number": 489,
    "content": "Hi, I am looking for a good interior designer to design a new home, ideally who knows how to work with natural colours. Not bold colours or patterns. \nThankyou"
  },
  {
    "post_number": 490,
    "content": "Who sells Epoxy floor paint in Malta please ?"
  },
  {
    "post_number": 491,
    "content": "Hello, looking for wedding car hire companies with good prices. Thanks"
  },
  {
    "post_number": 492,
    "content": "I need the services of a lift technician, please. Any suggestions?"
  },
  {
    "post_number": 493,
    "content": "Transform your kitchen with the elegance and innovation of \nGROHE\n mixers!\nCrafted for style, performance, and durability, GROHE offers:\n️ Sleek designs to elevate any space\n️ Eco-friendly features for water efficiency\n️ Reliable German engineering for long-lasting quality\nVisit our Mrieħel showroom or shop online today \n https://bit.ly/oh-grohe\n#OxfordHouse #Malta"
  },
  {
    "post_number": 494,
    "content": "Tafu min ibieh sinks tal kciena stainless steel"
  },
  {
    "post_number": 495,
    "content": "Not served by \nGozo Channel Operations Limited\n Dizastru! 3 sijat biex nirritorna lura id-dar kont nilhaq nasal Franza!\nWara li insib rotta ohra 50m qabel nara sign 'do not use this route for Gozo Ferry' u bir rispett kollu insib puluzija li jghidlu 'fej tahseb li sejjer? Erga mur wara il-que kollu' \nNapprezza hekk ma nigix imkellem isni xi bicca imbarazz!"
  },
  {
    "post_number": 496,
    "content": "Today, I had the pleasure of attending the \nJKA WF MALTA\n Winter Championships (Karate) to watch my son compete. While the sense of competition was clearly there, it was such a pleasure to see the sense of sportsmanship the Senseis of the different dojos have managed to instill in their members.\nIt was truly inspiring to see the Karatekas cheering each other on, and even more so to watch the older members mentoring the younger ones—offering guidance, pointing out areas for improvement, and sharing their knowledge. Well done Senseis, and thank you for instilling in our children not only a sense of discipline, respect and perseverance but also the values of sportsmanship and teamwork"
  },
  {
    "post_number": 497,
    "content": "Has anyone come across brown anti-slip tape locally? I can only seem to find black, white, yellow and transparent rolls. Many thanks"
  },
  {
    "post_number": 498,
    "content": "Well served ! \nIlbierah kont ghaddej m Rabat u rajt daqsxejn ta Take Away helu helu go villagg ghal kwiet family run u fettilli waqaft…\nNassigurakom li l gwerra ma affetwathomx dawn in nies araw il prezzijiet !!!! \nJien hadt rustica pizza u bellezza kienet. \nI highly recommend !! Location below \nhttps://g.co/kgs/MmsNQVx Zagallo's Take Away & Pizzeria\n2145 1813"
  },
  {
    "post_number": 499,
    "content": "I’m interested in importing foreign goods and beverages, primarily from Asia and the US, in quantities suitable for a small business. Are there any local suppliers or importers who offer this service?"
  },
  {
    "post_number": 500,
    "content": "Qieghda infittex polonecks tat TFAL dan l kulur. Min ghandu xi hanut u ghandu in stock napprezza jekk tibghatuli private message. Grazzi"
  },
  {
    "post_number": 501,
    "content": "Dan brejk.lite ta mutur irrit namlu jixel bi's switch any electricians pls"
  },
  {
    "post_number": 502,
    "content": "Hi can anybody recommend a decent Sunday buffet lunch please? Thanks."
  },
  {
    "post_number": 503,
    "content": "I have four thick planks of wood, about 1 foot x 12 feet x 1.5 inches that I need to have planed to the same thickness.  \nCan somebody suggest anyone?"
  },
  {
    "post_number": 504,
    "content": "Hi all, I am looking for a book or website with authentic maltese recipes for a family member living abroad. Ideally dishes that are typical and commonplace nothing fancy. And sweets too, like the pink sponge cake. Thanks!"
  },
  {
    "post_number": 505,
    "content": "Lost Prescription Glasses at Lidl Santa Venera\nA pair of prescription glasses went missing at Lidl supermarket in Santa Venera, near cash register one. These are progressive lenses, custom-made for an elderly person, and won’t be useful to anyone else.\nIf you’ve found them, please reach out to me directly. Your help is greatly appreciated. Thank you!  #lostandfound"
  },
  {
    "post_number": 506,
    "content": "Anyone know a kayaking place open Sunday tomorrow? Thanks"
  },
  {
    "post_number": 507,
    "content": "Ghandi bsonn artificial turf u umbrella kbira prezz tajjeb u delivery please. \nThankyou"
  },
  {
    "post_number": 508,
    "content": "Anyone has this for sale? It's of an Opel/Vauxhall Mokka "
  },
  {
    "post_number": 509,
    "content": "Any idea where I can find a supplier of second hand side mirrors of Toyota Vitz."
  },
  {
    "post_number": 510,
    "content": "Found in the bathroom at Heaven Day Spa.... Hopefully we can return it to owner...."
  },
  {
    "post_number": 511,
    "content": "Lost black iPhone : location Triq il-Hafur Attard.  Kindly pm if seen or found. Reward will be given for your help \n Thank you"
  },
  {
    "post_number": 512,
    "content": "Where can I buy an oxyacetylene brazing torch with gas and complete kit other than Multigas?"
  },
  {
    "post_number": 513,
    "content": "Recommendations for someone who can lay outdoor kitcher TOP\nTop material is Travertine"
  },
  {
    "post_number": 514,
    "content": "Hi, can someone help us out please? Iphone has been stolen and the icloud account is now locked because the password was forgotten. Is there a way we can unlock it and use find my iphone to try to trace the device?"
  },
  {
    "post_number": 515,
    "content": "Hawn xi hadd jaf numru tal konsumatur ilni gurnata ncempel u linja taqa"
  },
  {
    "post_number": 516,
    "content": "From where can I buy a pre-paid card, such as Apple pre-paid card or similar please? I would like to give a money gift by means of such a card. Thank you."
  },
  {
    "post_number": 517,
    "content": "Need urgently a diver to retrieve a smartphone that fell into the sea near Marsa jetty. PM please! TIA"
  },
  {
    "post_number": 518,
    "content": "Who makes made-to-measure carpets?"
  },
  {
    "post_number": 519,
    "content": "Good afternoon, can anyone here recommend a good upholster? Thanks."
  },
  {
    "post_number": 520,
    "content": "Hello, does anyone know of any pilates classes using a reformer please? (Picture for attention)"
  },
  {
    "post_number": 521,
    "content": "Good morning, looking for recommendations of places for TV units. Ideally ones that open all day Saturday. TIA"
  },
  {
    "post_number": 522,
    "content": "Hi xi hadt jaf jghidli min jiksi zraben pls?"
  },
  {
    "post_number": 523,
    "content": "Need somebody who polishes old style terrazzo tiles please."
  },
  {
    "post_number": 524,
    "content": "Where can I go to fix this Tiffany lamp pls ?  It’s broken off from its base…"
  },
  {
    "post_number": 525,
    "content": "Has anyone been able to reach out to ARMs customer support number? 80072222\nIt seems it’s not working and their customer support email mentions to contact this number for urgent enquiries but it doesn’t work.\nThere is no other contact numbers on ARMs website and I haven’t gotten a response to my email. \nI appreciate if anyone can help as I need to reach out to ARMs urgently.\nThank you"
  },
  {
    "post_number": 526,
    "content": "Hi! Anyone knows where to find dark green velvet - dining chairs please? Thanks"
  },
  {
    "post_number": 527,
    "content": "Looking for recommendations for name tags to attach to clothes please.\nNeed them asap so would appreciate local options. Thanks"
  },
  {
    "post_number": 528,
    "content": "Waiting for a call back from BOV Customer Care, is like waiting for Godot. Disgraceful."
  },
  {
    "post_number": 529,
    "content": "Hi. I'm trying to set an appointment with Dr Salvina Zrinzo. I called St James Hospital and her next availability is January 2026. \nDoes anyone know if she attends in any other clinic? I am unable to find information online. \nThank you!"
  },
  {
    "post_number": 530,
    "content": "Good afternoon. Allijista jkun jezisti xi tip ta appart biex jghidlek minn fejn ikun gej certu hoss? Grazzi"
  },
  {
    "post_number": 531,
    "content": "Hi , can you kindly suggest any local companies which ship from Sicily to Malta please, (apart from Sicily to Malta & DKM services ) Thank you "
  },
  {
    "post_number": 532,
    "content": "I'm looking for a gardener to prune my trees, someone with experience any recommendations?"
  },
  {
    "post_number": 533,
    "content": "Would anyone be able to share their reviews about this washing machine/tumble dryer shelf as shown in the photo? Was it sturdy in your experience? Also, could you kindly let me know where you purchased it from, preferably with delivery to the ground floor in Naxxar? Thank you!"
  },
  {
    "post_number": 534,
    "content": "Plumber in Gozo\nHello everyone,\nDoes anyone have a number of an honest and efficient Plumber in Gozo to fix 2 toilet flushings please? Thanks"
  },
  {
    "post_number": 535,
    "content": "Can someone please advise the best pet insurance providers on the island?"
  },
  {
    "post_number": 536,
    "content": "Looking to Rent a Space – Need Information\nHi everyone \nI came across a space that seems ideal for my needs in Triq Guzeppi Calleja, Iklin, but I’m unsure who the owner or contact person is. \nI noticed a phone number written on the door and contacted the person, but unfortunately, they’ve lost the owner’s contact information. \nIf anyone has any details about the owner or knows how I can get in touch with them, please let me know. I’m genuinely interested in renting it.\nThank you in advance for your help!"
  },
  {
    "post_number": 537,
    "content": "Grazzi kbira lit-tliet ħaddiema tal-Cleansing Department li ilbieraħ ġabru skart mormi f'Wied is-Sewda bil-vann GVH157. Il-ħidma tagħkom hija apprezzata ħafna."
  },
  {
    "post_number": 538,
    "content": "Anybody who has a good service agreement for an mrl lift ? I need names and contact numbers"
  },
  {
    "post_number": 539,
    "content": "Where can i find a pallet of kristal water with a good price?"
  },
  {
    "post_number": 540,
    "content": "Hello, looking for personalised souvenirs for Holy Communion. Thanks"
  },
  {
    "post_number": 541,
    "content": "Any motoring school taking in new students for the motorcycle license please? Any help would be appreciated."
  },
  {
    "post_number": 542,
    "content": "Tal-mistħija sar is-servizz pubbliku. Tipprova jumejn fuq xulxin tikkuntattja segretarju tal-isptar biex tmexxi appuntament u jew iħalli t-telephone jdoqq u ma jaqbdekx jew jaqbad u jaqtagħlek mill-ewwel.\nU apparti minn hekk, ippruvajt xi 4 numri oħrajn u kollha qaluli li bilfors irrid inkellem lil das-segretarju biex ninqeda.\nDan hu s-servizz pubbliku li tant niftaħru bih? Minħabba nies bħal dan qegħdin l-ewwel fl-Ewropa? U għal ġieħna, dan mit-taxxi tagħna jitħallas."
  },
  {
    "post_number": 543,
    "content": "Has anyone used successfully some kind of in line water filtering system for reducing limescale from the mains?  I already have a ro for drinking water but looking at reducing scale ( gebla) from the mains or water tank. Tks"
  },
  {
    "post_number": 544,
    "content": "From where I can buy pure castor oil and rosemary oil pls?"
  },
  {
    "post_number": 545,
    "content": "Looking for this kind of tile to put on a dividing external wall. Thank you"
  },
  {
    "post_number": 546,
    "content": "Minn fejn ha jnsib battery bhal din ,?"
  },
  {
    "post_number": 547,
    "content": "Hello everyone! Recommendations for someone to remove wallpaper and paint the wall afterwards please "
  },
  {
    "post_number": 548,
    "content": "Hi, I'm looking for someone who can fix and rewire lampshades. Any contacts please? "
  },
  {
    "post_number": 549,
    "content": "Hello, im looking for someone to install my ac"
  },
  {
    "post_number": 550,
    "content": "Where are these/similar shoe clips available ln Malta pls\n?"
  },
  {
    "post_number": 551,
    "content": "Any reviews about HEXCLAD pans please?\nThanks"
  },
  {
    "post_number": 552,
    "content": "Anybody does this in Malta?"
  },
  {
    "post_number": 553,
    "content": "Looking for a plumber in Gozo to install drain water services from outside shafts and to connect  to three apartments. Appreciate any contact you can forward "
  },
  {
    "post_number": 554,
    "content": "All I really need some guidance with IDENTITA. I am at my wits end. My partner is Italian and he’s been here working in Malta for 5 years. He lost his residence card and we cannot seem to get anywhere when we go to IDENTITA in Msida to book an appointment. We are finding the same individual behind a glass who keeps saying to us to book online. With the latest guidance from him”if you cannot book an appointment on line, you stay without an ID, then”. The issue is that online we only find how to book if you are doing the ID from the beginning where you have have a reference number. There is no booking system if you loose your ID. Anyone can help please"
  },
  {
    "post_number": 555,
    "content": "I have a friend looking to improve their Maltese. Can anyone recommend a good Maltese teacher  that offers 1-to-1 lessons? Preferably can go to their own home or if not, based in a central area. Thank you"
  },
  {
    "post_number": 556,
    "content": "Any recommendations from where I can buy activated charcoal filters specifically for Faber Hoods please? Thanks"
  },
  {
    "post_number": 557,
    "content": "Xi hadd jiksi u jbajjad fuq barra ma jarax kbir u ma jaqlalekx qalbek biex ilesti!Xoghol il Mosta.Grazzi"
  },
  {
    "post_number": 558,
    "content": "Need a reliable furniture fitter to realign my kitchen cupboards Any suggestions?"
  },
  {
    "post_number": 559,
    "content": "Nixtieq insib futbol nursery għat-tifla li għandha 6 snin. Jekk ikun lejn in-naħa t'isfel ta' Malta aħjar. Preferibbilment li jkun tim tal-bniet biss, però jekk ikunu mħallta importanti li jkun hemm bniet diġà.\nLi sibt jaċċettaw bniet imma bniet m'hemmx u t-tifla tippreferi jkollha bniet oħra magħha."
  },
  {
    "post_number": 560,
    "content": "Looking to throw away lot of cardboard boxes and bags from new furniture"
  },
  {
    "post_number": 561,
    "content": "Hi, I am looking for a physiotherapist who can carry out house visits please. I need someone who can be present to carry out the exercises given regularly as the person is not willing to do them alone. \nSo Im not looking for a physio who gives out exercises and instructions and a repeat visit thereafter, but someone who can actually do the exercises with the patient. \nDoes such person/s exist please? Thanks so much"
  },
  {
    "post_number": 562,
    "content": "Looking for suggestions for Sunday buffet lunch to celebrate a special occasion. Thanks in advance"
  },
  {
    "post_number": 563,
    "content": "Anyone that can fix this?\nThanks"
  },
  {
    "post_number": 564,
    "content": "About a year ago, I was seeking quotes to install a lift at our house, and one of the quotes I received was from Mr. Manuel Deguara of Apex Lifts in Rabat. We proceeded to sign a contract with him, paid the required deposit, and agreed on an installation date.\nHowever, as the agreed date approached, Mr. Deguara began providing excuses for delays. Over the past months, this excuses has continued, with new reasons being given each time. \nDespite our repeated requests for a refund of the deposit, he has consistently failed to comply, offering further excuses instead.\nWe are now left without the service we paid for and without the deposit we entrusted to him.\nDon't Trust This company."
  },
  {
    "post_number": 565,
    "content": "From where can I buy this chocolate please? Preferably in Zebbug or nearby. Thanks "
  },
  {
    "post_number": 566,
    "content": "Jekk ikollok VAT number tkun amiltu bil hsieb li tibda business zghir part time u mbad tispicca ddum biex tibda. Dak hemm bzonn accountant jew tista timla r return inti peress li ma tkun ghamilt xejn ? Grazzi bil quddiem"
  },
  {
    "post_number": 567,
    "content": "Looking to purchase a large quantity of dark grey tracksuits suitable for 10-year-old children. Does anyone have any leads on suppliers or manufacturers I can buy from directly? Thank you!"
  },
  {
    "post_number": 568,
    "content": "Anybody here who can *urgently* replace two doors in a busy shop"
  },
  {
    "post_number": 569,
    "content": "Looking for someone/ a company which can create a pop up advert suitable for TV. Someone who has ALREADY done these as per specs provided."
  },
  {
    "post_number": 570,
    "content": "Looking for an indoor football pitch or an indoor basketball court. Any recommendations?"
  },
  {
    "post_number": 571,
    "content": "Good morning all.  Dear members we thank you for all the genuine recommendations you do daily.  To help make this platform more useful  would be really appreciated if you would give feedback of such recommendations.   Ideally a genuine customer rather than a friend or family .  So do let us know which rubs recommendations have really served you well. Thank you"
  },
  {
    "post_number": 572,
    "content": "Any recommendations for a good painter please...tried and tested please and who can start as soon as possible please....thanks"
  },
  {
    "post_number": 573,
    "content": "If you value good customer service, reliability, and value for money, I would 𝐍𝐎𝐓 recommend 𝐞𝐣𝐜𝐒 𝐋𝐭𝐝 as a condominium association.\nThings started off well, and we were hopeful, but unfortunately, around 2023 things took a very frustrating turn.\nGetting in touch with them has been such a challenge—emails often go unanswered, phone calls aren’t picked up, or they disconnect and then you get a text saying, “I’ll call you later” or “tomorrow,” but that call never comes. Messages on WhatsApp are read but rarely replied to, which only adds to the frustration.\nWe wanted a good explanation of the yearly fee which kept increasing so we asked for a meeting... another headache. They scheduled specific dates and times, only to be cancelled before or we’re given a date but no time, and when we email to check, there’s no response, and the meeting just doesn’t happen.\nIt’s been exhausting trying to get things done, and honestly yesterday they told us to look for another association which is a blessing... still I wonder what's going to happen with the money I paid for the lift as it hasn't been fixed since July 2024 and when I asked them I was told: \n\"𝐊𝐮𝐥𝐥 𝐭𝐰𝐞𝐠𝐢𝐛𝐚 𝐭𝐢𝐧𝐠𝐡𝐚𝐭𝐚 𝐛'𝐦𝐨𝐝 𝐮𝐟𝐟𝐢𝐜𝐜𝐣𝐚𝐥𝐢 𝐦𝐞𝐭𝐚 𝐢𝐥-𝐛𝐥𝐨𝐤𝐤𝐚 𝐭𝐚𝐡𝐭𝐚𝐫 𝐚𝐦𝐦𝐢𝐧𝐢𝐬𝐭𝐫𝐚𝐭𝐮𝐫 𝐢𝐞𝐡𝐨𝐫. 𝐇𝐚𝐧𝐝𝐨𝐯𝐞𝐫 𝐭𝐢𝐧𝐠𝐡𝐚𝐭𝐚 𝐥𝐢𝐥𝐮\"\nLife is short and for the sake of your sanity, look elsehwere."
  },
  {
    "post_number": 574,
    "content": "Can you please suggest a handyman in Gozo please?"
  },
  {
    "post_number": 575,
    "content": "Hello do you know who sells Tonies please?"
  },
  {
    "post_number": 576,
    "content": "Ghandi par headphones, it transmitter f daqqa wahda waqaf jahdem…hawn xi hadd jista jara x inhi l problema u jekk jigux imsewwija? Grazzi."
  },
  {
    "post_number": 577,
    "content": "Does anyone know who installs parking sensors please?"
  },
  {
    "post_number": 578,
    "content": "Does anyone know a reliable person or company that services gas water heaters? Recommendations appreciated"
  },
  {
    "post_number": 579,
    "content": "I'm looking for a repairman for a Brema Ice Makers machine. Does anyone know one?"
  },
  {
    "post_number": 580,
    "content": "Have an iPhone and would like to trade in with another iPhone. Who does trade ins ?"
  },
  {
    "post_number": 581,
    "content": "Anyone who can do custom costumes? \nPicture as example"
  },
  {
    "post_number": 582,
    "content": "Looking for wood skirting 10cm for a property. Anyone can assist and quote."
  },
  {
    "post_number": 583,
    "content": "Any recommendations for a ship carpenter to work on a boat in the south pls? Thanks"
  },
  {
    "post_number": 584,
    "content": "Looking for wall painting services particularly in limewash. Any recommendations please? Thanks in advance"
  },
  {
    "post_number": 585,
    "content": "Would anyone know if I can order locally, whiskey with a personalised label showing our company logo? TIA"
  },
  {
    "post_number": 586,
    "content": "Big Brother Malta\n success diga ghamiltu, qas tistghu tkunu iktar tan-nejk min hekk\nM'ghandi xejn kontra imma mhux kwazi kullhadd lgbtiq l irgiel ma dahhaltux wiehed straight issa min ha jaqbes u jitkellem kieku ma nkludux lgbtiq fih min jaf kemm kontu teqirdu ehh.."
  },
  {
    "post_number": 587,
    "content": "Would anyone know where I can buy a 28v charger like this please? Tx"
  },
  {
    "post_number": 588,
    "content": "Tafu lil xi hadd li ghandu mejda simili ghal kiri pls?"
  },
  {
    "post_number": 589,
    "content": "Ir remote tal bieb tal garage, mhix tiftahli, hemm min jista jaghmilli l code please?"
  },
  {
    "post_number": 590,
    "content": "Looking for suppliers offering these kind of internal doors. Any suggestions please? Thanks in advance."
  },
  {
    "post_number": 591,
    "content": "Can anybody suggest a company that does travel insurance for a 75 and a 85 year old please."
  },
  {
    "post_number": 592,
    "content": "Xàhat jahdimli frame tal Hadid ta winch u gagga tal Hadid ghal fuq bejt pls ??"
  },
  {
    "post_number": 593,
    "content": "Ghandna bzonn 10/12 kaxxi tal kartun xi 80x60cm bej u bej, xi hadd ghandu please ?"
  },
  {
    "post_number": 594,
    "content": "Just a big thanks to Shaun,Dobrinka,CJ,Jenny,Francesca and all at Welbees Park Towers...in gratitude for your Great service and help..Thanks to Philip too...he keeps the outlet so clean!"
  },
  {
    "post_number": 595,
    "content": "I have a request for guidance, but first to shout out thanks to the Pet Studio, Zebbug.  Last week they offered above and beyond great service in a charming and exceedingly kind and well-mannered way.  I needed to return a 'pet door' within ten minutes of having bourght it - one to fit within a glass aperture. \nI had managed to buy something appropriate, but not appropriate enough for the glass-cutter.  Truly they surpassed themselves.  It is a wonderful shop, full of exciting 'things' and opportunities for pets!"
  },
  {
    "post_number": 596,
    "content": "I have a heavy load of ceramic pots arriving into Sliema, and do need two men and a solid van to bring the load from DHL Sliema to Haz Zabbar.  The load will be especially heavy!  I'm seeking a Van and two Positive guys who are happy to lift pots in wooden crates. Date: 3rd or 4th February to suit.  Thank you."
  },
  {
    "post_number": 597,
    "content": "Hi i am looking for a complete syllabus notes for Biology A level. Does someone wants to sell them? Pm me thanks"
  },
  {
    "post_number": 598,
    "content": "Qed infittex lil xi hadd biex jibdilli is sink u IL banju plus IL mixers thank you"
  },
  {
    "post_number": 599,
    "content": "Xtrajna maisonette xi 8 snin ilu minghand kuntrattur, pero pjanta ta’ kif inhuma ghaddejin il-pajpijiet tad-dawl u l-internet m’ghandiex. Kif nista’ ngibha sin il-pjanta? Ga bghatt lil minn frjn xtrajtu"
  },
  {
    "post_number": 600,
    "content": "Has anyone used Sicilyshoppingtomalta recently? Any reviews pls?"
  },
  {
    "post_number": 601,
    "content": "Ghandi bzonn phone numbers ta farm houses biex naghmlu party ghal klassi tat tfal ghall precett plse"
  },
  {
    "post_number": 602,
    "content": "Having visited St. James Hospital’sfront office in Sliema regarding a Radiography I had to collect, I couldn’t come across a more courteous individual than Ms. Victoria Brincat. I was surprised by the way we were greeted, up to the way Ms. Brincat ended our brief visit. However, it’s not just this that made me comment about Ms. Brincat but how she went out of her way to explain other matters not to her competence. Thank you from the bottom of my heart. Though this might have seemed to be something normal for you, it meant a lot for me"
  },
  {
    "post_number": 603,
    "content": "Would anyone know from where this type of door is purchased from, roughly 5-7 years ago."
  },
  {
    "post_number": 604,
    "content": "Qed nfitex il xi hadd pls li jahdmili jew insi room divdiers iridhom twal u gholjin pls tipo bhal ta ritratt"
  },
  {
    "post_number": 605,
    "content": "Unacceptable and dissapointing service from \nEnemalta plc\n Enemalta\nHave been reporting a severe case of low voltage power cuts for a week and no one shows up! Our apartment is like Christmas lights going on and off, and this is not the first time. I keep calling customer care and get textbook robot responses like ‘we have other urgent cases’ or ‘you’re not alone’ or ‘they may come and they may not, we never know’. \n• Over 12 powercuts in a spam of 2 hours today \n• An average of 4-5 powercuts a day after 5.30pm\nAbsolute disaster! Our bills will remain pending until we get a basic decent service."
  },
  {
    "post_number": 606,
    "content": "i have this wall and i need hangers to display 1 shoe. where can i find ??"
  },
  {
    "post_number": 607,
    "content": "Where can I take my 8yr old son basketball? Thanks"
  },
  {
    "post_number": 608,
    "content": "Would anyone know if these kind of chairs are available locally please?"
  },
  {
    "post_number": 609,
    "content": "Looking for a plumber that can fix a leak in a shaft on the 3rd floor. Will need a harness or tall ladder for access. Anyone know someone available urgently please?"
  },
  {
    "post_number": 610,
    "content": "Xi hadd jista jtini parir minn fejn nista nixtri madum please?"
  },
  {
    "post_number": 611,
    "content": "Good afternoon. Any idea who might have the below tiles size and colour as per image and size: 44.5x44.5 and are outdoor tiles.  Bought and tiled some 20 years ago so needs to be remaining old stock. I need around 30 tiles. Thank you."
  },
  {
    "post_number": 612,
    "content": "Water pump has stopped working and is displaying EH. I don’t know who installed it, so I cannot call the supplier. Can anyone recognize where it’s from or plumber services that know how to reset this device. Thanks"
  },
  {
    "post_number": 613,
    "content": "Upgrade your kitchen with the 𝐄𝐬𝐬𝐞𝐧𝐭𝐢𝐚𝐥 𝐏𝐚𝐜𝐤𝐚𝐠𝐞 — a Bosch appliance bundle designed for effortless cooking and style.\nThis all-in-one offer includes:\n Bosch Fridge-Freezer (KIV86NSE0)\n Bosch Microwave (BFL523MS0)\n Bosch Oven (HBA214EB3)\n Faber Built-In Hood (IN-NOVA ZERO DRIP A60)\n Bosch Induction Hob (PUE611BB5D)\n Bosch Dishwasher (SMV2HVX02E)\nSeize this limited-time deal now \n https://bit.ly/oh-essentialpackage\n#OxfordHouse #Malta"
  },
  {
    "post_number": 614,
    "content": "I need a plumber with a water leakage detector. Zebbug area. Thanks."
  },
  {
    "post_number": 615,
    "content": "Do you know who sells these locally please apart from Homemate and atrium?"
  },
  {
    "post_number": 616,
    "content": "Grazzi lil kulhadd\n_________________\nQed nigbor stimi ta  xi hadd responsibli biex idur l- appoggi bi prezzijiet ragonevoli u xoghol pulit. \nLil.min tissugerixxu?"
  },
  {
    "post_number": 617,
    "content": "Tafu lil xahadd li jaqta il hgieg?"
  },
  {
    "post_number": 618,
    "content": "Does anyone know where I can buy this?\nMumuso used to sell them for like 2 euros before..."
  },
  {
    "post_number": 619,
    "content": "Who sells 72v batteries for escooters pls? Or someone who builds them custom. Tks"
  },
  {
    "post_number": 620,
    "content": "Would love some recommendations on how best to treat limestone walls indoors. My builder used to give it a coating of milk but I would love some more opinions. Thank you in advance."
  },
  {
    "post_number": 621,
    "content": "Anyone bring riutals pls locally? Tku"
  },
  {
    "post_number": 622,
    "content": "Can anyone recommend a reliable, and not too expensive,  Aluminium door provider please"
  },
  {
    "post_number": 623,
    "content": "Xi sprayer jinteresah jaghmili pajero mil qosra bir reptor spray iswed?\nGrazzi."
  },
  {
    "post_number": 624,
    "content": "Ghandi dal fanal tal irham abjad rabba bhal qisu qoxra moffa sewda\nHemm xi rimedju kif tista titnehha pls"
  },
  {
    "post_number": 625,
    "content": "not sure this is an ethical question: has anyone ordered kitchens from mondo convenienza? what are the products like? the pros n cons… etc"
  },
  {
    "post_number": 626,
    "content": "Hi, does anyone know if the application for a civil marriage in Malta has to be done in person? We are both currently living abroad and there is no clear information on the site. Thanks!"
  },
  {
    "post_number": 627,
    "content": "Can you please recommend a good audiologist to fit a hearing aid on an elderly person. Tried and tested please."
  },
  {
    "post_number": 628,
    "content": "Looking for a photo album for 54x86mm photos - any suggestions where I can find one locally?"
  },
  {
    "post_number": 629,
    "content": "Can anyone please suggests reliable sites to buy Concert tickets abroad. Thank you."
  },
  {
    "post_number": 630,
    "content": "Please tafu xi dentist miftuh illum urgenti"
  },
  {
    "post_number": 631,
    "content": "Hi everyone,\nDoes anyone know where I can find 4 empty air conditioning boxes? I need them urgently and would greatly appreciate any leads. Thanks in advance!"
  },
  {
    "post_number": 632,
    "content": "Araw xtaghmlu u klemjaw bagalja imkisra ma Ryanair.\nKisruli bagalja u se jaghtuni 16euros\n qas backpack ma tixtri b16 euros"
  },
  {
    "post_number": 633,
    "content": "Cannot find post, but someone asked for a good magnet. These are awesome."
  },
  {
    "post_number": 634,
    "content": "Where can one buy acid free storage boxes for photographs locally? Any ideas how to reduce the space taken by bulky albums but protect photographs?"
  },
  {
    "post_number": 635,
    "content": "Thumbs up \n to buonbon cafe' in mosta. Great service and attitude with customers from young to old ,super delicious food and big variety. "
  },
  {
    "post_number": 636,
    "content": "Where I can report Dog Poo (Person Recorded - Clear Face in Fgura) I've had enough now. Mandra ghamilt gol-garage."
  },
  {
    "post_number": 637,
    "content": "Recommendations for a reasonable, reputable gardener to chop off a tree please"
  },
  {
    "post_number": 638,
    "content": "Does anyone know where I can find this style of tiles please?"
  },
  {
    "post_number": 639,
    "content": "Update on what happened at the shoe shop in B'Kara:\nBoth the salesgirl and the manager contacted me with an apology, which I welcomed.  They saw my post on RUBS and acknowledged what happened. I am happy that the case is resolved and even happier that their reputation wasn't tarnished. It was never my intention to do so."
  },
  {
    "post_number": 640,
    "content": "Could anyone suggest where I could buy a strong but handy MAGNET\nThanks"
  },
  {
    "post_number": 641,
    "content": "RECOMMENDATIONS NEEDED. Hello, qed infittex mastrudaxxa li jista jaghmel wardrobe bhal tar-ritratt. Il-biebien tal-hgieg. Min jahdihom jew tafu b'xi hadd napprezza jekk tiktbu jew tibatuwli. Grazzi."
  },
  {
    "post_number": 642,
    "content": "Nixtieq niringrazja il \nImprove Installations\n talli ghalkem kien maltemp il birah marilna id dawl u amel min kolox biex qdiena.. wara 30mins gew u irangawlna fi zmien bi prezz ragonevoli.. Grazzi mil qalb u nirikomandawom\nI would like to thank improve installations for although it was a very bad weather day we had our home electricity cut off and they did everything to help us.. in 30 mins they arrive and they fix everything in short time with a good price.. thanks and we highly recommend them."
  },
  {
    "post_number": 643,
    "content": "I would like to publicly praise a wonderful person named Shelly who works at \nHomemate Co Ltd\n at Shoreline Shopping Mall. She was not only incredibly professional but also genuinely helpful from start to finish. She provided assistance with items in the shop, as well as managing to reserve an item for me from another outlet. She was not only patient and friendly, but also determined to find me exactly what I was looking for. It is rare to find someone so dedicated to excellent customer service. Highly recommended, and well done for your positive attitude and dedication towards the customers. "
  },
  {
    "post_number": 644,
    "content": "Good afternoon, does anyone please have a direct email address of Samsung's mother company? It has been a nightmare trying to contact them!"
  },
  {
    "post_number": 645,
    "content": "Hi anyone from Haz Zebbug no water? Thanks"
  },
  {
    "post_number": 646,
    "content": "Looking for Restaurants in Gozo who cater for Gluten and Lactose free Menu, which open in the evening.\nAny suggestions please?"
  },
  {
    "post_number": 647,
    "content": "Can any one suggest a good Orthopedic doctor/surgeon please?\nI did not know that the area needs to be specified. However I have pain/numbing in my hand starting from the neck area down to my thumb. Already seen GP and taken anti inflammatories."
  },
  {
    "post_number": 648,
    "content": "Good morning, I am in need of an association that takes care of a building complex's street and garages common parts. Can someone recommend any options?"
  },
  {
    "post_number": 649,
    "content": "Any recommendations for a tried and tested reliable carpenter pls? Thanks"
  },
  {
    "post_number": 650,
    "content": "Definitely not served by Gozo ferry. So they say on their page that they have a priority lane and then we arrive here and they tell us: Sorry, today there is no priority lane. How is this helping people with disabilities?"
  },
  {
    "post_number": 651,
    "content": "I was astounded and disappointed by the behaviour of a salesgirl and a senior salesgirl in a shoe shop in B'Kara. My nephew and I walked in the shop on a very rainy afternoon and he slipped on a large puddle of water just inside the shop, knocking over display shelves with shoes. The salesgirl ran over to us to  see what happened then ran around the shop screaming her head off. The manager ran over to us with a mop and said something to us, nothing apologetic, for sure. I asked her why on earth was there no mat by the door and she gruffly pointed out to the mat, OUTSIDE the shop, totally soaked. What was the point having a soaked mat outside? They didn't even check to see if my nephew was hurt! They continued to be gruff and bad tempered with us while we looked around. We found a pair of shoes he liked in the shop upstairs but didn't buy it, we put it on hold. \nThe next day I went to pick it up and pay for it. Guess what! The mat was outside the shop once again, and there was another puddle of water by the door, inside the shop. \nApart from being gruff and rude, what other qualification is required to work in this shop? Is being dim another requirement?\n* I would like to add that my nephew wasn't hurt and we didn't buy shoes from the downstairs shop, with the gruff salesgirls but from the one upstairs. The salesgirl there, Sharona, was pleasant and helpful. THANKYOU Sharona."
  },
  {
    "post_number": 652,
    "content": "I’m having problems with the BOV3D Secure app since the bank replaced my debit card with a new one. I cannot confirm payments. Has anybody experienced the same problem?"
  },
  {
    "post_number": 653,
    "content": "Tafu bxi had li jsewwi forn ta dawl tnks"
  },
  {
    "post_number": 654,
    "content": "How long does a fire door take from the time of ordering? 7 months? A year?"
  },
  {
    "post_number": 655,
    "content": "Looking for a good technician on Tesy BelliSlimo series. Any help appreciated"
  },
  {
    "post_number": 656,
    "content": "Xi technician tal fridges (LG) li jigi d-dar, grazzi?"
  },
  {
    "post_number": 657,
    "content": "If you haven’t tried ‘Hlewwiet T’Indri’ yet, you’re seriously missing out! I had been meaning to try their treats for a while and yesterday I finally managed. Their cookies and brownies are nothing short of magical. Crafted with passion and packed with flavor, from gooey brownies to mouthwatering cookies - especially the cookie dunkers \n. Perfect for gifting or simply indulging yourself, this small business is a must for any dessert lover \n https://www.instagram.com/hlewwiet_tindri?igsh=Mm1hdHlsaWpxemw1"
  },
  {
    "post_number": 658,
    "content": "Good morning - I’m looking for an interpreter Spanish to English - if you have any recommendations pls let me know. Thank you"
  },
  {
    "post_number": 659,
    "content": "Hello, looking for a souvenir shop for Holy Communion."
  },
  {
    "post_number": 660,
    "content": "Where can I fix a small mirror in San Gwann please"
  },
  {
    "post_number": 661,
    "content": "Hey guys ... can anyone recommend best place to fix a screen for Samsung S24 Ultra please? Also, somewhere they can fix there and then or on the day. Mine just smashed onto the tiles and is flashing like a Christmas tree. Thanks in advance!"
  },
  {
    "post_number": 662,
    "content": "Does anyone know where I can take a broken television and broken speakers to be thrown away . Thanks in advance"
  },
  {
    "post_number": 663,
    "content": "What services / companies are available to collect shopping ??"
  },
  {
    "post_number": 664,
    "content": "Top choice malta Top Choice - Electronics & Appliances if you are honest people rename immediately to choice tal fantazma because that is what your customer care service is - not bad - but non existent. \nThis is non existent after sales for your customers which is no service at all. \nI spent all day starting at 8 am until 445 calling all outlets in Malta in turn trying to get hold of anybody at customer care.  Didn't manage. \nIt must be easier to deal in illegal organ trafficking than to get some assistance from you lot. \nWe just need you to send someone to activate the warranty on a new appliance we bought last month. Pretty simple you'd think.  You'd think wrong. \nAt 3 I sent an exasperated email thinking surely that will trigger some form of reaction.  Again... wrong.   Good to take your money and nothing else. \nAt 445 when someone picked up the phone after 10 mins on hold,  she told me \"issa tal customer care telqu. \"Dawk sa l erbgha u issa l erbgha u nofs\". Daqsek.  Straight faced cold hearted idiotic mouthpiece who thinks she works at a government department. A reflection of this dissipated and worn out crust of a nation state.  No apology.. no feeling the need to somehow try offer a solution or any form of assurance or assistance.  Now wait till Monday you idiot.  And try your luck again at reaching fantazma studios at so called top choice. \n Truly U Le !!!!!"
  },
  {
    "post_number": 665,
    "content": "Anyone knows how I can get in touch with the  ex photographer Images he had a shop in Naxxar behind the church please ? The shop now it's not in operation  anymore!"
  },
  {
    "post_number": 666,
    "content": "Very well served by the professional staff of Bortex corporate department in Marsa.\nWent to try my new uniform and I was very well served by the amazing Mona, Jamie, Jelena and Michelle.\nSuper efficient, dedicated and passionate to serve customers with attention to detail.\nKeep it up! Amazing service as always \nBortex Fine Tailoring"
  },
  {
    "post_number": 667,
    "content": "Anyone seen something similar locally please (mirror)?"
  },
  {
    "post_number": 668,
    "content": "Hey! \nAny recommendations for traditional Maltese balcony manufacturers? (Looking for new builds, not restoration.)\nThanks!"
  },
  {
    "post_number": 669,
    "content": "Question: a person drove my car at excessive speed, now I have received a fine plus 3 points deducted from my license. The person driving has accepted the fine and reducing the 3 points from their license. Where can this be done?"
  },
  {
    "post_number": 670,
    "content": " Did you know that J-LINE home decorations are also on offer? \nPieces are limited, get yours quick!\nhttps://tinyurl.com/j-linedecor \n Buy Now Pay Later with FlexiPay Scheme\n Collect & Redeem Lava Rewards Points\n Free Indoor Parking\n Open Everyday\nT&Cs Apply"
  },
  {
    "post_number": 671,
    "content": "Looking to build so.ething lime this. Any recommendations. \nHomemate have ready ones, any feedback?"
  },
  {
    "post_number": 672,
    "content": "Min ikollu bhal dan it-tip ta wall cabinet pls?"
  },
  {
    "post_number": 673,
    "content": "Any one knows from where I can do a key like this please.Thank you"
  },
  {
    "post_number": 674,
    "content": "This was absolutely a surprise \nWe went to try \nQajjenza Bar\n as they have the new offer on Sushi.  €20 and you can eat as much as you can. Sushi was fresh , presentable and also you could feel the richness of the products used. \nThis is definitely the spot in the South of Malta for those that adore Sushi and all beyond. \n10/10 - PERFECT "
  },
  {
    "post_number": 675,
    "content": "Has anyone bought bags from Nordace through their website please? Any feedback? Are they worth the money?"
  },
  {
    "post_number": 676,
    "content": "Tafu min ikollu bhal dawn ghal bejh please tal pvc? Thanks"
  },
  {
    "post_number": 677,
    "content": "Hi, Any company of some sort, that rents out PDA's for a stock taking ? we will need about 10. \n Or maybe some expert that knows how to connect scanning mobile apps with our Stock management system.  Thanks "
  },
  {
    "post_number": 678,
    "content": "The Government Call Centre 153 (actually a private company), have a habit of sending you straight to an operator who takes your name and number and promises to call back later in the day.\nApart from several times that I have NOT been called back at all, this is very inconvenient. It is done to suit them, and not the customer.  \nI need to speak to someone now (or within 30 mins) as I am in front of my computer, with my tax papers etc. What use is it if they call me back whilst I am driving or in a meeting etc. This is all to suit them, and not customer centric. I would rather wait my turn and wait 30 minutes than avail of this unilateral 'system'.\nThere should at least be a choice to wait, or else be called back.\nI often cut and try again - but apparently this is exactly what they want, as the company probably gets paid per call as well as per minute. Thus not only is the general public screwed, but the Government too.\nDoes anyone else find this system frustrating and irritating?"
  },
  {
    "post_number": 679,
    "content": "Looking for recommendations:  we need to relocate 7 boxes of personal items from London to Malta.  Is there any company anyone used either locally or from London?"
  },
  {
    "post_number": 680,
    "content": "Does anyone know who sells this in Malta please? Not available from Easy life and Pama... I am trying to figure out if any other outlet might sell it pls. Thanks so much "
  },
  {
    "post_number": 681,
    "content": "I am looking for a number of counter top stands to be made, similar to this photo and also half the width. Not necessarily in these colours. If there are any recommendations it would be greatly appreciated."
  },
  {
    "post_number": 682,
    "content": "qed infitex gwardaroba zghira xi 195x88x54 bejn wiehed u iehor imma mhux uwsa minn 88/90 ghax ma toqodc.din biex tintuza biex idendel ggigett igifiri bir rajls.din ghal go dar ta l anzjani u trid tigi migjuba lest armata mhux zarmata u jigi xi hadd wara jarma.thx"
  },
  {
    "post_number": 683,
    "content": "Can you please recommend a good interior designer for a commercial property? Thanks"
  },
  {
    "post_number": 684,
    "content": "Bonġu. Qed infittex xi ħadd li jsewwi sufani tal-ġilda, xi ħadd affidabbli u tal-esperjenza. Tafu tissuġġerixxu lil xi ħadd jj? Grazzi ħafna \nMorning all. I need the services of a good upholsterer who can repair and recondition leather sofas. Any recommendations please? Thank you "
  },
  {
    "post_number": 685,
    "content": "UPDATE\nwhat is meant for you will find its way.\nnever stoop low and copy the behavior of people who disrespect you, stay in your truth and LET THEM. \nnb 40k was added to the original price lol.. \ntoday i was very disillusioned by an innocent old couple selling a property in st julians . the property was listed with an agency at X amount. i managed to find a way to find the money to be able to secure the deal. \nwe chatted for an hour. i showed them my plans on how i intended to do up the place.\nthe old lady and i enjoyed our time together, i promised her i would bring her over to see it when it was done up and she agreed. we chatted about the plans for her future. great chemistry all\nalong. i signed a “paper” (was gonna say contract.. contract my arse!) ensuring that at the deposit of eur500 i was reserving the property from being given to any other interested party for two weeks.\neveryone was happy. we agreed.\ni was walking on air! \nuntil a few hours later.\nthe estate agent advised me that the couple had backtracked and were asking for more money.\nincredible \nwe had a deal\nnot bound by law\nbut bound by being human and shaking hands on it.\nwhat have we become? \nhonestly this has disturbed me in more ways than one.\nwe have lost all consciousness for the sake of money.\nhoping and praying that over the night to come the sellers will have a change of heart\n vs "
  },
  {
    "post_number": 686,
    "content": "Hi everyone, I’m currently working on refurbishing an existing kitchen, mainly replacing the kitchen countertop/backsplash and installing a butler sink (Mejjilla). Who would be the best person to contact to creating a support system for the butler sink within the existing kitchen setup, and can provide advice on the ideal dimensions of the sink in the available space?"
  },
  {
    "post_number": 687,
    "content": "Any recommendation for a reliable and tested lift maintenance"
  },
  {
    "post_number": 688,
    "content": "Will you be so kind to let me know from where I can purchase a clear plastic enclosure like the picture below?"
  },
  {
    "post_number": 689,
    "content": "Best ENT recommendations Pls"
  },
  {
    "post_number": 690,
    "content": "Not served by the \nBuilding & Construction Authority\n (BCA). The developer of the site next to us is excavating right next to our wall, not observing any of the 76cm distance required by law. The BCA washed their hands by saying they won't get involved because this is a civil matter that we will need to handle through the courts, despite that the method statement (and the Civil Code) requires the developer to observe this 76cm distance.\nThe developer has already hit our corridor wall through carelessness during demolition, displacing a brick (which he verbally promised to repair later). If something similar happens at the basement levels, it could cause the whole building to collapse. We had informed the developer through a representation that we do not waiver our right to this 76cm distance. \nOur lawyer told us we need to file an injunction with the court to stop the excavation, but warned that the developer would likely retaliate by countersuing us for stopping works, exposing us to financial risk. Even if we win the subsequent court case, we would only be awarded damages of around €10-20,000 which would need to be shared or prorated between all neighbours in the apartment complex. Our portion would likely be less than €2,000, which wouldn't even cover the income we'd lose from work and other expenses to pursue this case.\nDevelopers know they are operating with impunity, because the legislative, enforcement, and judicial systems are rigged in their favour, and there is nothing we neighbours can do to protect our rights and our safety.\n-------------\nUpdate: I would like to thank everyone who provided helpful advice. I'm going to address some common points and misconceptions (paraphrased):\n\"The 76cm distance doesn't apply because the developer is removing loose material, not rock cutting.\" - That is not correct. Apart from the soil and rubble, the developer is also removing their foundations that are situated right next to our wall. The Avoidance of Damage to Third Party Property Regulations defines excavation as \"the cutting or removal of rock, clay and any other natural or human placed material, that forms part of the land, or the removal of any consolidated material\". The foundations and rubble both qualify as \"human placed material\". Both the BCA and our lawyer have confirmed that the 76cm distance still applies in this case. We might have refrained from objecting if the developer was really just removing loose material and keeping the foundations in place, but they are clearly removing the foundations too.\n\"The developer is removing material thrown there by your own developer.\" - That is not the case. There was a building on this site (now demolished) that existed long before our apartment block was built.\n\"The 76cm distance doesn't apply because your block has a basement wall there, not bedrock.\" - That is also not correct. The 76cm distance applies from the surface level, not from the base of the third-party wall. Both the BCA and our lawyer have confirmed this.\n\"Your developer didn't respect the 76cm distance either.\" - The former building on this site was uninhabited when our block was built, so there was no safety risk. But that's beside the point. We did not gain anything from it if our developer also excavated illegally. We paid the full price for our apartment on the assumption that it was constructed legally. And even if it wasn't, one illegality doesn't justify another.\n\"Damage will be covered by the developer's insurance.\" - Insurance does not cover damage if the developer is found to have been breaking the law, which is the case here.\n\"It is safer to proceed this way than to build over the old foundations.\" - That may or may not be the case. We would have been ready to talk with the developer, with the guidance of our architect, if he had approached us about it. However, the developer deceitfully stated they would respect the 76cm distance in the method statement, so we never got the chance to evaluate whether not doing so is safe or not.\n\"You are making mountains out of molehills.\" - The developer has already hit our corridor wall with heavy machinery through carelessness. You can imagine what will happen if there is similar carelessness applied when excavating right next to our block's basement wall.\n\"You don't know what you're talking about.\" - My position has been corroborated by my lawyer and the BCA, who have seen the same photos that I've posted above (and others). I appreciate that some commenters are expressing their disagreement with the definition of \"excavation\" in good faith, but I can see that others are coming from developers or their associates, who have a vested interest in sowing confusion and discrediting posts like this one. Anyone can verify the law for themselves: https://legislation.mt/eli/sl/623.6/eng.\n\"Call 138.\" - We did. That number goes to the BCA, who told us they won't intervene because it's a civil matter.\n\"Talk to a lawyer.\" - We did. He was ready to file an injunction on our behalf, but we concluded we would be worse off, for several reasons. We are currently living in a rented apartment since we don't feel safe staying next to this construction site. Stopping the excavation through an injunction would mean we'd have to continue paying rent for much longer during the court case and the subsequent resumption of works. Residential leases have a one-year minimum period, so we can't just stop renting and go back to our apartment for a few months while excavation is stopped, even if it was safe to do so. The court is unlikely to award us compensation for this rent. The case will require lots of our time, which the court doesn't award compensation for either, so we would end up suffering a huge financial loss even if we win the case. The developer will likely retaliate by countersuing us for stopping works as a form of SLAPP, which would put even more financial strain on us. In brief, pursuing such a court case would require a lot of disposable financial resources that we don't have."
  },
  {
    "post_number": 691,
    "content": "Hi, I have this opening which I would like to close with a metal garage door.\nDoes anyone know of a contact who works on metal garage doors? \nThanks"
  },
  {
    "post_number": 692,
    "content": "Tlift ic cavetta Tal karozza u m ghandix spare key. Tafu X nista namel pls ?"
  },
  {
    "post_number": 693,
    "content": "My husband and I were walking along Manoel Dimech street this morning and whilst passing in front of number 353 we were invited for a wine tasting event held by DS wines. We were very pleasantly surprised by the quality of the wines we were offered. The owner also offered tastings of his pesto, pate's and cheeses, all of a truly high quality, all at fantastic prices.  I immediately ordered 4 boxes which he will deliver free of charge.  A really pleasant morning hosted by a real wine conoisseur."
  },
  {
    "post_number": 694,
    "content": "Does anyone know of a company that rents mascot costumes please? (Full head costumes example minnie mouse) We are looking for costumes only, not an animator. Thanks in advance "
  },
  {
    "post_number": 695,
    "content": "ġaggijiet tas-soqfa (li sserraħ il-qafas tas-saqaf) minn fejn issib tixtrihom? Kemm qegħdin bħala prezz j.jogħġbkom ..grazzi"
  },
  {
    "post_number": 696,
    "content": "Need a family doctor or Geriatricianin who does house visits in Sliema. Thanks"
  },
  {
    "post_number": 697,
    "content": "Need this ninja oven any outlet that stocks it apart from forestals?thks."
  },
  {
    "post_number": 698,
    "content": "Hi all, what is the best online stationary and ink company to order for a company with best prices?"
  },
  {
    "post_number": 699,
    "content": "Good afternoon everyone!\nWhat vacuum/mop/robot cleaner do you recommend? I have a large dog, a toddler and a newborn, so my floor needs to be washed regularly. I'm looking for something that makes cleaning easier, preferably a robot cleaner or a cordless vacuum & mop (2in1)\nThanks in advance "
  },
  {
    "post_number": 700,
    "content": "Can anyone suggest a good and reliable handy-man please"
  },
  {
    "post_number": 701,
    "content": "Can someone help please?"
  },
  {
    "post_number": 702,
    "content": "Xi hadd jahdimli seat bhall dawn tal fibre tafu lill xahadd"
  },
  {
    "post_number": 703,
    "content": "Hawn min x'tara Jew ordna ghamara minghand Interni 5.0 (Interni Cinquepuntozero) ? \nXi reviews?....."
  },
  {
    "post_number": 704,
    "content": "I am looking for a carpenter/handyman to do some maintenance to some furniture around the house, mainly doors and drawers. Pls recommend."
  },
  {
    "post_number": 705,
    "content": "Looking for these non slip tiles for outdoor swimming pool area. Been around a few places but no success. Thank you"
  },
  {
    "post_number": 706,
    "content": "If anyone needs moving/transport services, I highly recommend Eric \nEric Bugeja\n! He answers messages quickly, is very reliable and very easy to deal with. He will handle your belongings with care and you will see no damages during transport. I am extremely satisfied with his services!"
  },
  {
    "post_number": 707,
    "content": "My wife went to do some ear testing at the general clinic and they advised her she lost 40% of her hearing and requires a hearing aid. Can anyone recommend where we can go for a 2nd test and to buy a hearing aid for her? Tried and tested please.."
  },
  {
    "post_number": 708,
    "content": "I need quotes to dismantle this non-structural wall and rebuild it with the door moved to the other side."
  },
  {
    "post_number": 709,
    "content": "Good evening.\nCan anyone recommend a company for ACP photo printing?\nThanks"
  },
  {
    "post_number": 710,
    "content": "Ghandi bzonn xi hatt jaghmel stima b'xejn ghal tiswijja ta bieb ta flat, bieb ta injam, li iwahalu salatura tajba ecc.."
  },
  {
    "post_number": 711,
    "content": "Xi hadd jaf minn fejn jinxtara dan il wire ta l azzar pls?"
  },
  {
    "post_number": 712,
    "content": "Does anyone here know someone who specializes in genealogy, ancestry research, or creating family trees?"
  },
  {
    "post_number": 713,
    "content": "From where to buy scread levelers? Ideal from agent need alot. Thankyou"
  },
  {
    "post_number": 714,
    "content": "Looking for a network cable installer. Any recommendations please ?"
  },
  {
    "post_number": 715,
    "content": "Well done to \nFedEx\n & Cassar & Cooper Malta express service for your excellent service and thanks to Mr Elvin Gauci for delivering the parcel \n Super Well done! \nCassar & Cooper\n fedex company"
  },
  {
    "post_number": 716,
    "content": "Photographers needed for a sporting event scheduled for Sunday 26th January @ 7am (Central area)\nBudget 50eu per photographer for a maximum of 1hr.\nThanks in advance."
  },
  {
    "post_number": 717,
    "content": "Can anyone tell me please if Pret a Porte in Żebbug Malta is still open for clients please? If yes and you have mob number of owner kindly would be appreciated\nThankyou"
  },
  {
    "post_number": 718,
    "content": " AVVIŻ MID-DIRETTORAT GĦAS-SAĦĦA AMBJENTALI\nSkont l-Att dwar is-Sigurtà fl-Ikel u r-Regolament tal-Parlament Ewropew u tal-Kunsill (KE) Nru. 178 tal-2002, id-Direttorat għas-Saħħa Ambjentali fi ħdan is-Sovrintendenza tas-Saħħa Pubblika, jixtieq jinforma lill-pubbliku, li wara informazzjoni li rċieva mingħand il-kummerċjant involut, l-imsemmi prodott m’għandux jiġi kkunsmat minħabba l-possibilta` ta’ preżenza ta’ oġġetti estranji (biċċiet tal-plastik) fl-istess prodott.\nIsem tal-prodott fuq it-tikketta: Nuggets vegetali\nDitta: Vemondo\nDati tad-durabilita`: Id-dati kollha sa, u inkluż it-22/02/2025\nUżin: 200g\nGħal aktar informazzjoni, l-pubbliku jista’ jċempel lis-Servizzi tas-Saħħa Ambjentali fuq numru tat-telefon – 2133 7333 mit-8:00 ta’ filgħodu sas-2:30 ta’ waranofsinhar jew jibgħat imejl fuq admin.ehd@gov.mt . Il-pubbliku huwa ġentilment mitlub iżur il-paġna tad-Direttorat fuq Facebook \nhttps://www.facebook.com/EHDMalta\n  jew is-sit uffiċjali fuq https://environmentalhealth.gov.mt għal informazzjoni simili.\n ENVIRONMENTAL HEALTH DIRECTORATE NOTICE\nIn accordance with the Food Safety Act and Regulation (EC) No. 178 of 2002 of the European Parliament and of the Council, the Environmental Health Directorate within the Superintendence of Public Health wishes to inform the public that following information received from the involved operator, the following product must not be consumed due to possible presence of foreign objects (pieces of plastic) within same product.\nName of product on the label: Nuggets vegetali\nBrand: Vemondo\nDurability dates: All dates up to and including the 22/02/2025\nWeight: 200g\nFor further information, the public is kindly requested to contact the Environmental Health Services between 8:00 a.m. and 2:30 p.m. on telephone number 21337333 or by email on admin.ehd@gov.mt .  The public is also being invited to access the Directorate’s Facebook page at \nhttps://www.facebook.com/EHDMalta\n  or our official website at https://environmentalhealth.gov.mt for similar information. \nSaħħa\n | \nSuperintendence of Public Health\n#environmentalhealth #EHO"
  },
  {
    "post_number": 719,
    "content": "We are having some issues with our bathroom and are considering just gutting the whole thing and starting fresh - does anyone know anyone RELIABLE who can do a full bathroom remake? We have had such issues in the past with people not showing up or doing shoddy work (which is why we are in this position to begin with), and are so worried about having another similar situation. Tried and tested and reliable suggestions would be greatly appreciated!"
  },
  {
    "post_number": 720,
    "content": "Has anyone ever ordered furniture/bedrooms from JYSK? How is the quality?"
  },
  {
    "post_number": 721,
    "content": "Does anyone know a person/ company that’s reliable to rent a camper van for a weekend in Sicily?"
  },
  {
    "post_number": 722,
    "content": "Can anyone suggest a good upholsterer pls?"
  },
  {
    "post_number": 723,
    "content": "Ive been trying to get hold of V Demajo who are the agents of Candy appliances. Send them FB messages, emails, tried calling and no reply at all. Does anyone know who fixes Candy appliances please cos these seem useless Needed urgently pls - I can be reached on 79591997"
  },
  {
    "post_number": 724,
    "content": "Hi everyone, I am in need of a metal door measuring as follows: between 125/130cm by 200/260cm. Kindly speak to me if you have something available, thank you! "
  },
  {
    "post_number": 725,
    "content": "She brought them back to life!! \nIsabelle Art Studio\n   drew my deceased cats Tiko & Toby... Very authentic drawing... Really happy with the result, Highly recommend!!"
  },
  {
    "post_number": 726,
    "content": "Not served by BOV. Last December, I was sent an SMS from their official messaging services and ended up being scammed Ma considerable amount of money.\nI realised immediately what happened and filled in the relevant documentation. After more than a month, they now told me they will not be refunding the money as they had sent SMSes warning about scams.\nMy gripe is that the scamming SMS was sent from their number. I followed the instructions as they had come from their service. It is the lack of responsibility that makes it extremely disappointing. Had the message come from an external number I would not have even looked at it, and it is very galling to note that no responsibility was taken by the bank to address the fact that their own messaging service was being used to scam their customers.\nInstead I was sent an email, basically calling me stupid as a reason not to refund me."
  },
  {
    "post_number": 727,
    "content": "Can you reccomend a shop to buy modern switches and sockets with good prices"
  },
  {
    "post_number": 728,
    "content": "If you need to have something bulky delivered from abroad do yourself a favour pay a bit more and use the various couriers available...\nMaltaPost\n are an absolute disaster...items paid for to be delivered at home...their employee doesn't even ring bell but leaves you a note that they didnt find you home. Then you need to collect it personally from the post office. This is the 3rd time it happened in 5 months...your word against theirs...practically you need to stay waiting from the early morning to film the delivery van to send them proof that he didnt even bother ringing the door bell...if not I was told I am lucky enough that the box I had to have was already at the sub post office...no communication nor acknowledgement whatsoever when you call...so please again do yourself a favour AVOID \nMaltaPost\n as much as you can for bulky items...service is abysmal and beyond 3rd country developing standards...nor a complaint with MCA settled the issue in the second time..all you get is sorry will not happen next time and here we are again. DISASTER !!"
  },
  {
    "post_number": 729,
    "content": "Anyone knows a good architect who doesn’t give you a hard time and fights for you against the planning authority? Thanks "
  },
  {
    "post_number": 730,
    "content": "Hi there! My friend is coming from Ireland for a short visit and this time we would like to head to gozo for one of the days. Is there anywhere that shows the process of making gbejniet? Maybe even the lace? Taking touristy suggestions we can nerd out about \n I am also hoping there is a pastizzi place we can go see them being made"
  },
  {
    "post_number": 731,
    "content": "Goodmorning  everyone , where can I find rubber mats similar to this pls ?"
  },
  {
    "post_number": 732,
    "content": "Wanted pcb board ta bosch classixx 5 washing machine"
  },
  {
    "post_number": 733,
    "content": "Any doctor please for house visits in san gwann area? Thank you"
  },
  {
    "post_number": 734,
    "content": "Xi hadd fuq xoghol ta soffit please?"
  },
  {
    "post_number": 735,
    "content": "I had a great shopping experience, at Rinascimento, the salesperson Elizabeth is an absolute gem! \nFrom the moment I walked in, Elizabeth made me feel welcome and listened to exactly what I was looking for. She has such a great eye for style and helped me pick out pieces that fit what I needed perfectly. She was very kind and genuine, thank you! Rinascimento @ D CLUB Fashion- 21st September ave., NAXXAR"
  },
  {
    "post_number": 736,
    "content": "8 days ago I sent this photo to Enemalta emergency services, advising them, not that I needed to, that it was dangerous and the lower bracket was showing signs of giving way. \nNeedless to say, nothing has been done. Now it has come off the wall, 1 of the live cables is severed and lying in the street and we residents have a power outage. \nTo further rub salt into the wound I have been holding the line to report the situation for over 25 minutes to keep repeatedly being told all operators are busy. \nShame on you Enemalta. Miriam Dalli x’ha taghmel?\nEdit to post. \nI am assuming that people asking for address are from Enemalta and trying to help. Thank you. \nImmediately this post appeared, I was contacted by 2 persons from the minister’s office. Within minutes a foreman was on site and repairs are currently underway. Thank you for resolving the matter, much appreciated. It’s a pity that the carelessness of a few reflects on the many."
  },
  {
    "post_number": 737,
    "content": "ARMS have never been efficient. But their inefficiency has now reached new depts.\nThey are sending “no reading” bills, or “Zero Consumption” bills, or even worse, totally exaggerated consumption bills, or just as worse, no bills at all since last July, to various apartments that I manage.  These are all meters that were specifically changed to new meters that can be read from outside, and not requiring anyone to be home.  To make matters worse, emails sent a month ago, have not even been replied to.\nARMS supposedly have an online “Eforms” section, however when one tries to use them, besides “Testing” being listed in each field, one is unable to insert the specific Account number, as there is only a dropdown menu with “ARMS” followed by a generic number, to choose from, and not the Account numbers I am responsible for.  I reported this last May, and the situation is still the same. Furthermore, when one tries to use ARMS website to give meter readings, after filling out all the details, and 'sending', it reports an error. I tried 3 times and nearly cried!\nIf one goes to Blata l-Bajda, besides the parking issues, you will have to wait for a couple of hours to speak to someone. This state of affairs is terrible."
  },
  {
    "post_number": 738,
    "content": "Who is the agent for NARDI Ovens in Malta please cause we require a part ?"
  },
  {
    "post_number": 739,
    "content": "Xi electrician tajjeb li jwahhal fog lights u DRL fuq honda fit 2017? Thx"
  },
  {
    "post_number": 740,
    "content": "Ili siegħat sħaħ bla dawl u iktar minn nofs siegha fuq telefonati lill-customer care fuq tliet numri differenti u ma jaqbdek ħadd. \nEnemalta plc\n ħudu nota jekk jogħġobkom!"
  },
  {
    "post_number": 741,
    "content": "Good evening.\nI am looking to buy a 50kg punching bag, and would need also delivery to -1 floor garage + installation. Anyone offers all in one service please? \nDechatlon only delivers to ground floor and no installation. Unfortunately I cannot carry and install myself. \nThank you"
  },
  {
    "post_number": 742,
    "content": "Minn fejn nisti insib nixtri rear bumper second hand ghal Toyota ist 2004 pls?"
  },
  {
    "post_number": 743,
    "content": "Can anyone recommend a good geriatrician in Gozo?"
  },
  {
    "post_number": 744,
    "content": "Any recommendations for solid wood doors please. Thanks"
  },
  {
    "post_number": 745,
    "content": "Hi everyone! \n Does anyone know who’s the agent or distributor for White Pure Paws cat litter is please? Thank you!"
  },
  {
    "post_number": 746,
    "content": "Minn fejn insib nixtri cover li fl-istess ħin ikun stand bil-keyboard għal tablet Samsung Tab A mudell 2016?"
  },
  {
    "post_number": 747,
    "content": "Who has in stock please? Lion French Mustard"
  },
  {
    "post_number": 748,
    "content": "Wanted something like this anyone know from where can i purchase"
  },
  {
    "post_number": 749,
    "content": "Not at all served by MR Condominium. For 4 years we used their services and discovered an appalling lack of transparency re information and clarifications. Choose wisely if looking for a condominium admin company and prioritise integrity and professionalism. I would mention that complaints were made to them but ignored.\nMR Condominium definitely not recommended."
  },
  {
    "post_number": 750,
    "content": "ARMS\n you took my money but you didn't mark my bill as paid. Unanswered emails from december and nobody picking up when calling customer care. I'm sure you'll throw in a late payment fee soon without any delays"
  },
  {
    "post_number": 751,
    "content": "Hi, does anyone kniw from where I can find a bed similar to thr beloe photo please?"
  },
  {
    "post_number": 752,
    "content": "BOV customers FYI: if your account is inactive for 2 years, they will charge you 35euros and they block your account. They don't inform you about it. To unblock the account you have to make an appointment and there are no appointments at my bank  until mid February. Hopefully you won't need to access your money in a hurry..."
  },
  {
    "post_number": 753,
    "content": "I’m looking for pine (or any other soft wood) blocks of 15x15x15 cm or more. Any leads on where to get 2 or 3 pieces? \nI have already checked at Homemate, Big Mat, PM Hobby, a few local carpenters and an online search but it’s either flat wood or having to buy a 4m beam. They’re needed for wood carving for my student."
  },
  {
    "post_number": 754,
    "content": "Tafu min fej insib indicator light bhal dan? Kien qijad fuq volvo fl 2018 ax tax xellug imfarrak ma jadinix mil vrt, thx"
  },
  {
    "post_number": 755,
    "content": "Does anyone know where I can buy MORINGA POWDER? \nThank you"
  },
  {
    "post_number": 756,
    "content": "Looking for an ANTI-GLARE solution for a large shop Glass display in order for signage to be seen behind it. \nKindly any recommendations please? \nThank you in advance!"
  },
  {
    "post_number": 757,
    "content": "Where can i find to buy one of these, needs to have handles like the one in the picture pls? Thank you in advance"
  },
  {
    "post_number": 758,
    "content": "DHL Express promotes itself as “Excellence Simply Delivered”. However this is so far from reality as the service provided locally is mediocre at best. Calling DHL “customer care”is a sick joke as they aren’t even interested to meet their commitment to the customer - asking them to escalate the problem to someone of authority is ignored as nobody is ever available and any promise to call you back is ignored or disputed. \nDHL might be excellent abroad but here in Malta the service is atrocious, disrespectful and disgraceful."
  },
  {
    "post_number": 759,
    "content": "What should Gypsum Soffit for 16sqm cost more or less painted?"
  },
  {
    "post_number": 760,
    "content": "Very well served by \nFrancesca Falzon\n’s \nPaw & Heart\nLink to order on the FB page \nYour pet’s face engraved directly from a portrait sent on order. \nReally pretty and original design \n Thank you Francesca "
  },
  {
    "post_number": 761,
    "content": "Hi all by any change someone did ozone therapy? If yes where?"
  },
  {
    "post_number": 762,
    "content": "Does anyone know where I can find this dog food locally pls?"
  },
  {
    "post_number": 763,
    "content": "Hi,\nAre there any restaurants that can accommodate a staff event for 25 people with a set menu?\nPreferably in a private or enclosed area.\nAll cuisines are welcome."
  },
  {
    "post_number": 764,
    "content": "Need to replace 4 kitchen cupboard doors in gloss white melamine. Thanks"
  },
  {
    "post_number": 765,
    "content": "Urgent: in need of a Mazda bongo rear brake drum double wheel 2008"
  },
  {
    "post_number": 766,
    "content": "Looking for someone to drill simple ventilation holes in the wall of a flat for the passing of air. Important that they use a vacuum to collect dust during drilling. Any recommendations please?"
  },
  {
    "post_number": 767,
    "content": "I need an electric oven technician since the filament is not switching on. Can anyone recommend someone please? Thanks"
  },
  {
    "post_number": 768,
    "content": "Please tafu Min igib holly wood mirrors grazzi"
  },
  {
    "post_number": 769,
    "content": "Thoroughly recommend Ta' Borgu Tyres: Borgu Yard, Triq Iz-Zebbug, Ir-Rabat.  Excellent, efficient service for 4 new tyres, alignment & balancing...great value too."
  },
  {
    "post_number": 770,
    "content": "This is the Point Sliema have been like this for over 7 months now and no work is being done,Tal biki"
  },
  {
    "post_number": 771,
    "content": "Looking for x1  or x2 who has instock north area"
  },
  {
    "post_number": 772,
    "content": "We need X2 sofas bhal dawn 2 seater in stock Please. Thank you."
  },
  {
    "post_number": 773,
    "content": "Looking at doing Laser eye surgery as contact lenses are starting to irritate. Can anyone tell me the best place to go and which doctor they recommend please?"
  },
  {
    "post_number": 774,
    "content": "Does anyone know where I can get a small round mirror cut, preferably San Gwann area. Thank You."
  },
  {
    "post_number": 775,
    "content": "Excellent customer care from Nem Nem Candles. they have sorted out a problem I had. Thank you so much"
  },
  {
    "post_number": 776,
    "content": "Elevate your kitchen experience with the stunning Galileo collection of venting hobs by \nFaber - Franke's Air Expert\n, now available at unbeatable prices during the 𝐉𝐚𝐧𝐮𝐚𝐫𝐲 𝐒𝐚𝐥𝐞 at Oxford House!\n 𝐆𝐚𝐥𝐢𝐥𝐞𝐨 𝐋𝐢𝐧𝐞𝐚𝐫: Minimalist design meets innovation with Faber's latest centre grille, offering more induction zones and efficient air extraction.\n 𝐆𝐚𝐥𝐢𝐥𝐞𝐨 𝐒𝐥𝐢𝐦: Perfect for compact spaces, this slim 60cm venting hob ensures seamless integration and extra storage space in your kitchen.\n 𝐆𝐚𝐥𝐢𝐥𝐞𝐨 𝐁𝐨𝐥𝐝: Featuring a flush double-thickness forged aluminium grille and a powerful 620m³/h motor for efficient air extraction.\n 𝐆𝐚𝐥𝐢𝐥𝐞𝐨 𝐒𝐭𝐫𝐢𝐩𝐞𝐬: Sleek white LED slider controls for each zone offer a modern look and exceptional air cleaning performance.\nDiscover these exceptional hobs at our Mrieħel showroom or shop online today \n https://bit.ly/oh-faberhobs\n#OxfordHouse #Malta"
  },
  {
    "post_number": 777,
    "content": "Anybody knows where I can find a coffee table like the ones below locally pls?"
  },
  {
    "post_number": 778,
    "content": "Hi all\nGhandi bzonn inkun naf jekk jigux Malta dawn il prodotti tal ikel u hafna aktar ta din id ditta jew xihadd jaf jghidli ta l-Italja minfejn nista nordna.\nGrazzi"
  },
  {
    "post_number": 779,
    "content": "Look for hotels or restaurants that do weekend buffet at a good low price. I need it for about 16-20 people, early June. Any recommendations please "
  },
  {
    "post_number": 780,
    "content": "Has anyone seen this gift pack anywhere? Greens had it a couple of weeks ago around Xmas time. But it finished"
  },
  {
    "post_number": 781,
    "content": "Very well served by \nĠungla\n who came over and tidied up this yard for me today in under two hours. Removed all weeds and replaced with these pretty bushes which will grow to cover the tube on the wall and also brought over an olive tree and other plants which they potted. Super professional, met my brief of needing low maintenance plants and the best part is I didn't need to lift a finger. Highly recommend \n "
  },
  {
    "post_number": 782,
    "content": "Very well served by VB their spraying services are spot on  they immedietly did the job & thet left everthing clean too Highly recomended"
  },
  {
    "post_number": 783,
    "content": "Kindly recommend someone who can turn Vcr-vhs to usb please. Preferably south area.\nThanks."
  },
  {
    "post_number": 784,
    "content": "Anyone knows from where I can buy croissants to use for a savoury filling please? Thanks"
  },
  {
    "post_number": 785,
    "content": "Looking for Maths private lessons for Form 2. Saturdays only. Many thanks!"
  },
  {
    "post_number": 786,
    "content": "Does anyone know where I can buy replacement stools like this one please?"
  },
  {
    "post_number": 787,
    "content": "Any reviews on Kanion air conditioners pls? Thank you!"
  },
  {
    "post_number": 788,
    "content": "Good afternoon everyone, we have a gas fire place and the top bits keep smoking, does anyone know if they  can be replaced and who would sell them? Or if they just would need cleaning?"
  },
  {
    "post_number": 789,
    "content": "Looking for English teacher for my 8-year-old in Saint Julian’s. Home lessons"
  },
  {
    "post_number": 790,
    "content": "Today my friend  and I went to Identity Malta. \n To renew  our ID CARDS. \n I would like to thank them so much for the patience they Took with me.\nI have a visual impairment.and due to the fact that my friend forgot his id card and had to go back again for it. \n They did their utmost To keep me calm and filled in  all the forms for me...\nI can't deny, I was very angry with this person for.\nForgetting the card, but they kept me occupied.\nand did their very best. To calm me down \n Even though they are very busy\n and they are  also, so  very efficient and get the job done very quickly snd professionally \nI was in room 2 but from entering to leaving they are all polite and helpful.\nThank you so much.  "
  },
  {
    "post_number": 791,
    "content": "Looking for tiles 60x60 for under parquet. Delivered to Sliema. Anyone knows who has for sale. Thanks"
  },
  {
    "post_number": 792,
    "content": "Where can you buy those parts locally? Ideally around Birkirkara."
  },
  {
    "post_number": 793,
    "content": "Very well served \nBuonbon Café\n Kollox kien ġenwin u magħmul mill-qalb. Aparti li nmur brunch (l-aħħar ritratt), għamilt event b'set menu bi prezz tajjeb miftiehem magħhom u kollox ħareġ sew \n Proset tad-dettall u ħsieb wara kollox. Ta' minn jgħaddi shemm għal ikel u ħelu "
  },
  {
    "post_number": 794,
    "content": "Anyone knows of a venue where we can rent for a birthday party but get our own food ?\nThank You "
  },
  {
    "post_number": 795,
    "content": "Does anyone know of a doctor who can do blood tests at mater dei for me please?"
  },
  {
    "post_number": 796,
    "content": "Is there a British Airways office/representative/desk in Malta ?"
  },
  {
    "post_number": 797,
    "content": "Any one knows from where I can bye this kind of would please?"
  },
  {
    "post_number": 798,
    "content": "i need to buy worms for breeding for fish feeding , any available please ?"
  },
  {
    "post_number": 799,
    "content": "Looking for an AC technician (FUJI) to clean an old AC."
  },
  {
    "post_number": 800,
    "content": "Good morning, looking for recommendations for Zagross marbles. Has anyone here used them? Were you satisfied with quality and service? Thanks!"
  },
  {
    "post_number": 801,
    "content": "Any recommendations of shops from where I can buy a vanity sink top, in order to build a vanity from it? Similar to this? Thanks"
  },
  {
    "post_number": 802,
    "content": "Who in Malta does these kind of steel doors please?"
  },
  {
    "post_number": 803,
    "content": "Hello I live in Attard\nIs there a doctor that does home visits ?"
  },
  {
    "post_number": 804,
    "content": "Qed nfittex l-ktieb hemm art fil folja xi hadd ghandu ghal beigh m'ghand l-agent out of stock. Tia"
  },
  {
    "post_number": 805,
    "content": "Qed infittex burdura Gold biex titwahhal f'dan il vojt....xi hadd jaqdini pls  jew jaf minn fejn nista ninqeda? Grazzi."
  },
  {
    "post_number": 806,
    "content": "Looking for recommendations.  A small venue / bar / restaurant to host around 20 to 30 people ( unofficial staff party ) where we can have some drinks , be able to mingle, talk  and walk around, no loud music , and have some light snacks or finger food.  Needs to be in Sliema or Gzira area for evening event.  Drinks Need to be paid separately by individuals.  Thanks in advance.  Please private message me."
  },
  {
    "post_number": 807,
    "content": "Does anyone know where I can take my TV remote control to be fixed please. It does not work at all. I changed the batteries"
  },
  {
    "post_number": 808,
    "content": "Hi! I’m looking for panels like the one shown below, or a square MDF skirting board. Any idea where I could get these from please? Thank you."
  },
  {
    "post_number": 809,
    "content": "I Have some family video tapes to copy on a pen drive. Any contacts please?"
  },
  {
    "post_number": 810,
    "content": "Good morning. Any good carpenters to recommend? Thanks in advance"
  },
  {
    "post_number": 811,
    "content": "A heartfelt thank you to Ian and Marsha from \nTa' Xmun Caterers\n for their incredible effort and outstanding service! Managed to prepare my birthday cake within just one day, and your kindness and willingness to help, made the whole process so smooth. Highly recommend your services. Thank you once again! "
  },
  {
    "post_number": 812,
    "content": "I only have words of praise and thanks for Klowi Bowi who worked on these bespoke items for my granddaughter. I highly recommend her services to those who wish to have personalised items. Have a look at her page: \nhttps://www.facebook.com/klowibowi"
  },
  {
    "post_number": 813,
    "content": "Any recommendations for horizontal water heaters please?  No success with Omega and Tesy that conked out after barely 3 years in operation. I heard ones with ceramic elements might be a solution. Thanks."
  },
  {
    "post_number": 814,
    "content": "Wanted Universal car  Female to Female Aerial Antenna Adapter Cable for FM AM Car Radio"
  },
  {
    "post_number": 815,
    "content": "Tafu b’xi fridge technician tajjeb pls?"
  },
  {
    "post_number": 816,
    "content": "Ghandi bżonn mechanic li jiċċekjalek il karozza bil computer u jghidli ghaliex qed iddahhan abjad . \nXi hadd li jista jaraha ghada ."
  },
  {
    "post_number": 817,
    "content": "Asking for a friend \nDo you know who sells these or who the agent is please?"
  },
  {
    "post_number": 818,
    "content": "Hi what is best to buy a condenser or heat pump tumble drier?"
  },
  {
    "post_number": 819,
    "content": "I'm trying to find/purchase tickets on Shows Happening site for the MCC Chicago the musical in march 2025, there are links to shows happening but this event isn't on there somehow. I have asked them via Facebook messenger but 0 response. Can someone please advise if they're facing the same issue?"
  },
  {
    "post_number": 820,
    "content": "Wanted bumper ta wara escort M6 black"
  },
  {
    "post_number": 821,
    "content": "Hello\nXi hadd jaf jghidli min hu l agent tal Astonish cleaning products pls? Grazzi"
  },
  {
    "post_number": 822,
    "content": "I need to replace the battery in a fine watch. Can anyone recommend a reliable company that offers this service, aside from the official distributor?"
  },
  {
    "post_number": 823,
    "content": "I have this mid-century lamp in need of restoration (stripping and powder coating), including the replacement of springs and wires. Does anyone know who does this kind of work, please?"
  },
  {
    "post_number": 824,
    "content": "Does anyone know from where this type of tiles can be bought? Thank you."
  },
  {
    "post_number": 825,
    "content": "I am looking for someone who would be able to do a wall to wall ''Frameless'' glass shower. Many shops offer this with a frame at the top and bottom however I would like it to be completely framless like this imgae.\nAny recommendations?"
  },
  {
    "post_number": 826,
    "content": "Good afternoon\nDoes anyone know of a good accounts private lesson teacher at first year university level please?"
  },
  {
    "post_number": 827,
    "content": "X'sibtu l ahjar global air tags ghal Samsung mobile?"
  },
  {
    "post_number": 828,
    "content": "Hi, can anyone recommend a microwave technician in the northern part of the island that is reliable?"
  },
  {
    "post_number": 829,
    "content": "Hawn min ibih statwi ta resin pls ?"
  },
  {
    "post_number": 830,
    "content": "Hi \n anyone know where i could find an under mattress elevator like the one in the picture please? (The one underneath the mattress). Thank you in advance "
  },
  {
    "post_number": 831,
    "content": "Good morning any good reviews from someone experienced a bedroom from Krea..cos I'm really concerned about all the bed reviews..thanks in Advance good day.."
  },
  {
    "post_number": 832,
    "content": "Hi min fejn nista insib ilma bhal dan ? Apparti lagent Grazzi"
  },
  {
    "post_number": 833,
    "content": "Bongu semmuli kumpaniji li jbieghu fireplaces ta l ethanol pls\nTia"
  },
  {
    "post_number": 834,
    "content": "Hi who do you recommend for bathrooms please ? And bedrooms ?"
  },
  {
    "post_number": 835,
    "content": "We recently visited \noniVino\n in Birżebbuġa, and it was a fantastic experience! The platters were delicious, and the drinks complemented them perfectly. \nWhat really stood out was the exceptional value for money – everything was very reasonably priced. Highly recommend this spot for anyone looking for great food and drinks in a cozy setting!"
  },
  {
    "post_number": 836,
    "content": "Bzonn ta motherboard tahdem ta washing machine bosch classixx 5."
  },
  {
    "post_number": 837,
    "content": "Hello, i need to buy several submeters, either with coins or card, any suggestions ? Thanks"
  },
  {
    "post_number": 838,
    "content": "Looking for toe in/wheel balancing in Gozo."
  },
  {
    "post_number": 839,
    "content": "Fuq madum terrazzo jkun jista jehel madum iehor (ikbar) stile parquet? jew jkun irid jinqala l-ewwel?"
  },
  {
    "post_number": 840,
    "content": "Would anyone be able to share their experiences or reviews of purchasing domestic appliances from Uniplu in Malta, please?"
  },
  {
    "post_number": 841,
    "content": "Looking for paving ideas for the front of the house and garage ramp. resin concrete maybe?\nAny advice?"
  },
  {
    "post_number": 842,
    "content": "On the 30 August 2024 a diverse feast was being held in Pjazza kappilan mifsud in Hamrun. My car was parked in triq l fatati. No signs of restriction were affixed anywhere near my car. Yet my car was towed while all others in front of me  were left parked and also while my car was towed another car parked were mine was. 2 signs further up the road indicated restriction in Pjazza kapillan Mifsud. Had to pay 200 to get my car back. Send them an e mail .This week got their response my request for refund is refused as their was a notice in the government Gazette. Who buys and reads the government Gazette to check parking restrictions. Anyone else had the same experience.?"
  },
  {
    "post_number": 843,
    "content": "Im looking for someone who can widen the top of a pair of boots to accommodate wider calves. Any ideas?"
  },
  {
    "post_number": 844,
    "content": "Who take preorders for the new nvidia rtx 9070 when available thanks"
  },
  {
    "post_number": 845,
    "content": "I need to fix a broken wicker chair. Any ideas who can do this job?"
  },
  {
    "post_number": 846,
    "content": "Can y please recommend a very deep cleaning car wash/ portable car wash.\nThank you"
  },
  {
    "post_number": 847,
    "content": "Hello - hawn xi hadd jaf min jgib din d ditta ta appliances - Moulinex - Malta please jew min hu l-agent tal parts ? Frank Borda / Gala ghalqu minn mindu xtrajt l-appliance li ghandi. thanks !"
  },
  {
    "post_number": 848,
    "content": "Hi, anyone knows where they sell woolen baby clothes? Preferably the brand joha.\nThanks"
  },
  {
    "post_number": 849,
    "content": "Any recommendations on air purifiers - thanks !"
  },
  {
    "post_number": 850,
    "content": "yesterday morning i went to the post office in san gwann and i was really impressed by the kindness, helpfulness and professionalism of the lady who works there! i don't know her name but she has light eyes! compliments for the way she does her job."
  },
  {
    "post_number": 851,
    "content": "Can you please recommend and peadiatricians in the south area please\nThank you"
  },
  {
    "post_number": 852,
    "content": "Bzonn ta motherboard tahdem ta bosch classixx 5."
  },
  {
    "post_number": 853,
    "content": "Nixtieq nghid proset u grazzi lil voluntiera ta l ordni ta Malta u volserv li jigu l isptarijiet Samoc u Mater dei u jqassmu te u l kafe lil pazjenti u qraba. U jaghtu kelma ta kuragg.\nAvolja haga zghira imma dak il hin tara dinja \n GRAZZI "
  },
  {
    "post_number": 854,
    "content": "Update - Was contacted by Mr Joseph Aloisio - the recently appointed Chief Security at Mercury - who listened to me, took responsibility and apologised on behalf of his employees - he also kept me updated throughout the day on the measures he will be taking with regards to the security team - Thank you for your extremely professional approach. On behalf of Mercury, he also offered a voucher for the inconvenience caused. Although the intent of this post was not to gain something for free, the gesture is highly appreciated. \nNOT SERVED - MERCURY TOWERS - advertising free parking when spending 50 euro or more - Apparently this no longer applies but the advertisements are still there"
  },
  {
    "post_number": 855,
    "content": "Where can I buy this locally in Malta please?\nEdited: I appreciate you trying to help but if you saw it at Lidl or Eurospin or PM hobby, I've already been told by quite a few. I would like to hear about other shops please\nI need a unit to store a washing machine and a tumble dryer in a bathroom, either side by side or stacked on top of each other, but the unit should include some cupboards and shelves to store laundry detergents and toiletries. \nI have space for a wide unit and am not looking for a simple unit which is only intended to stack the washing machine and tumble dryer only.\nThe washing machine and tumble dryer should not be visible (cupboard must have doors)\nThe cupboards should have ventilation at the back and material should be good to use in bathrooms.\nHeight could be slightly less than the one in the pics \nIn case there's something available like this picture, I also consider buying 2 units\nThank you"
  },
  {
    "post_number": 856,
    "content": "After a water leak, I now need to sand down some areas of my solid wood parquet flooring to smoothen the floor again. Installer not being reliable at all so need to look for someone else. Any recommendations please ? Thanks."
  },
  {
    "post_number": 857,
    "content": "Lil min sibtu lahhjar biex nohrog mutur gdid eletric ??\nBiex nihu liskema tal gvern ukoll."
  },
  {
    "post_number": 858,
    "content": "Does anyone know where I can purchase shoes like these?"
  },
  {
    "post_number": 859,
    "content": "Good afternoon. Anyone knows where I can purchase gypsum boards to affix on a wall similar the ones in these photos please? \n TIA"
  },
  {
    "post_number": 860,
    "content": "Ghandi gwardarobba bil bibien sliding, ghandi bzonn lil xi hadd jigi jirrangahomli ghax mwahhlin fin nofs, u qed nibza li jinqalghu"
  },
  {
    "post_number": 861,
    "content": "Hello, does anyone know who does kids wall names locally? Something similar to the pics."
  },
  {
    "post_number": 862,
    "content": "Tafu b'xi hadd li jibdel tarf ta' HDMI cable fuq il-post ghaliex il-cable qieghed imdahhal fil-gypsum? Grazzi"
  },
  {
    "post_number": 863,
    "content": "FOUND FOUND!!!! Thanks to all"
  },
  {
    "post_number": 864,
    "content": "Bħala riċerkatur tal-Malti nħossni obbligat nistinka biex ikollna aktar prodotti bil-Malti. Dis-sena għent lill-artiġjani ta' GEEK&Co. u www.geek.mt biex joħorġu l-ewwel djarju bil-Malti. Xi ġmiel ta' djarju għamiltu u nħossni kburi li l-Malti tiegħu ħadt ħsiebu kollu jien. Ibqgħu sejrin hekk!"
  },
  {
    "post_number": 865,
    "content": "Hi, does anyone know where I can find the like below tile please? Thanks in advance "
  },
  {
    "post_number": 866,
    "content": "Tafu lil xihadd jiftah mercedes 190 u jaghmel cavetta gdida? Tlifna c-cwievet. Grazzi Hafna"
  },
  {
    "post_number": 867,
    "content": "Very impressed with Digital Zone for the supply and installation of my induction hob. Special mention to Norbert Farrugia the installer. He was very polite and pleasant."
  },
  {
    "post_number": 868,
    "content": "Looking for motorcyle mechanics near Fgura/Tarxien area"
  },
  {
    "post_number": 869,
    "content": "Qed infittex persuna biex jigi inaddaf, inehhi u jiehu boroz tal- gier, bicciet tal- maghdum, laned taz-zeghba u hmieg iehor kif qed jidher f'dan ir ritratt. Dawn l-affarijiet qeghdin go parapett bla tarag. Grazzi."
  },
  {
    "post_number": 870,
    "content": "Hi, I’m looking for a tutor who is familiar and patient with dyslexic children, someone who takes on small groups or possibly one on ones for school revision of English and Maths, secondary school (form 2) Also has to be centrally located. If anyone has any contacts, it would be greatly appreciated."
  },
  {
    "post_number": 871,
    "content": "Looking for a person or buisiness to add two internal pockets to a jacket  and repair a pockets on a second jacket . Any reccomendations ?"
  },
  {
    "post_number": 872,
    "content": "Good morning from where can I buy sweets by the grams in the South of Malta like gummies and such please. Thanks in advance"
  },
  {
    "post_number": 873,
    "content": "Super well served by the Mater Dei Hospital imaging department.\nVery friendly efficient and accommodating . All staff were helpful at guiding through the process on my MRI in the very early hours of the morning . \nExcellent workmanship , we cannot take for granted how amazing their dedication to helping others is not just at the imaging dept but all in medical industry. "
  },
  {
    "post_number": 874,
    "content": "Looking for interior deep clean for car, mosta area"
  },
  {
    "post_number": 875,
    "content": "Bongu. Has anyone found a kitchen mixer in antique brass finish with Riverse osmosis included in the tap itself?   \nAll I am finding in Malta is a yellow gold finish which is not what I am after."
  },
  {
    "post_number": 876,
    "content": "His looking for custom floor parquet/tile T profiles anyone knows someone please. Thanks"
  },
  {
    "post_number": 877,
    "content": "Good morning. Can someone tell me where can I buy this please?"
  },
  {
    "post_number": 878,
    "content": "Morning. Looking for someone to respring and upholster chairs. Any recommendations please ? Thank you!"
  },
  {
    "post_number": 879,
    "content": "Which is the best paint for concrete garage floor"
  },
  {
    "post_number": 880,
    "content": "I had the plasma pen treatment on my face for the first time. Thank you very much to Laser Aesthetician Tim and I am very happy with the results. My skin is tightened especially around my eyes. I no longer have sagging eyelids. My wrinkles between my eyebrows are visibly reduced. I am very happy and motivated. my skin is recovering well. The creams you recommended are very good and my skin remained hydrated the whole time and after two months we will repeat this treatment. Thank you from the bottom of my heart "
  },
  {
    "post_number": 881,
    "content": "Do you know of anyone who can refurbish an old stereo"
  },
  {
    "post_number": 882,
    "content": "Writing on behalf of someone else …. Looking for an individual or a company who can help with blocked Facebook account.  Page is important as this is used for work .  Thank you"
  },
  {
    "post_number": 883,
    "content": "Any reliable condominium administrator who is based in the south and is ready to take care of a large complex of apartment including surrounding garden and pool?\nYour recommendations is highly appreciated"
  },
  {
    "post_number": 884,
    "content": "very well served by my psotman today in Naxxar. i was not home this morning, he very kindly bought my package this afternoon. excellent customer care"
  },
  {
    "post_number": 885,
    "content": "Hi can not sure if its ok to post this here, if not admin please remove. I need 3+ star hotel  recommendation with at least 25 rooms available for end of march or april. Can someone recommend or if there is a someone here from a hotel please get in touch. Not looking for anything super luxurious and expensive. Need resonable prices. Thanks and have a great day!!"
  },
  {
    "post_number": 886,
    "content": "Best suppliers for fruit and veg delivery, ideally close to Naxxar."
  },
  {
    "post_number": 887,
    "content": "Xi sena ilu xtrajt capetta ta deheb 18karet minghwnd sterling jewelry pavi qormi .wara xarejn inqatat u mort bija irangawa hallast 15 e .u biex ma intawalx baqat tinqata 5 xhur shah gej u sejjer jirangaw fiha ax l manegment ma tridtx jibdila nahseb b bzoeq bdew jirangawa u tks god dejjem inqatat d dar ax kiku nitlifa pero ma tantx jider jinteresahom.wara hafna argumenti u adit fuq sena talbitni Jew receipt Jew certivikat li kiku talbitomli lewwel darba Jew tieni li mort kont intijomla bla problemi imma wara da zmien kollu mandomx ghandi .u bqajt bija imkisra .tal misthija araw kif tamlu mortu ixyru min em Al ghezis takom succes tamlu grazzi."
  },
  {
    "post_number": 888,
    "content": "Hello, could anyone please recommend someone to fix or service a sewing machine. Thanks"
  },
  {
    "post_number": 889,
    "content": "Ftit jiem ilu rajt li kien hawn min qed ifittex djarju bil-Malti. Jien nuża d-djarju tal-Knisja f'Malta, li hu bil-Malti, fih id-dati tal-festi kollha, paġna sħiħa għal kull jum (apparti s-Sibt u l-Ħadd), il-qaddis, il-qari tal-ġurnata u ħsibijiet oħra, u telephone numbers utli.\nId-djarju hu magħmul 100% f'Malta, anke bħala disinn. Ir-ritratt tal-faċċata dejjem ikun marbut ma' Malta, eżempju ta' din is-sena hu ta' Miġra l-Ferħa.  \nMeta qed tixtrih tkun qed tagħmel ukoll karità għax id-dħul kollu jmur għall-persuni fil-bżonn.  \nMin jixtieq jakkwistah jista' jibgħat messaġġ lil \nArchdiocese of Malta\n jew fuq https://knisja.mt/djarju-2025/"
  },
  {
    "post_number": 890,
    "content": "Looking for a family doctor for a house visit in Mosta."
  },
  {
    "post_number": 891,
    "content": "Looking for recommendations for escape rooms for a group of 12-13 year olds. I have been informed that the ones in Ta Qali are not currently catering for this age group. Any recommendations please?"
  },
  {
    "post_number": 892,
    "content": "Owner found\nFound a mobile phone at Shoreline Mall  toilets  just now.  Will be here for some more time. Then will try to leave it at a police station"
  },
  {
    "post_number": 893,
    "content": "Any GP who could do home visits this afternoon central area?"
  },
  {
    "post_number": 894,
    "content": "Is there anyone who can repair Apple macbook, or at least have tools to open it. Water got into my laptop i need urgently to open the laptop so i can dry it. Please if you know someone let me know."
  },
  {
    "post_number": 895,
    "content": "Hi looking for a tech wizard kid to unlock a password protected laptop. South if possible.  Thank you"
  },
  {
    "post_number": 896,
    "content": "I wish to thank \nMvintage\n for their excellent after sales service and excellent service too. I had bought this halo charm on the 29-11-2024 and lasrt Sunday a rhinestone fell out.  I send a dm and their reply was to visit one of their outlets so that they can replace this pendant for meand apologies for the inconvenience caused.  And today I did and have.  Well done \nMvintage\n  highly recommend"
  },
  {
    "post_number": 897,
    "content": "Hi any hair salons in Ibrag or Swieqi area that sell Redken hair products? Thank you"
  },
  {
    "post_number": 898,
    "content": "Xi hadt andu xi drive Shaft ta Avensis ta l 2007\n*magna 20 ( mhux 22)"
  },
  {
    "post_number": 899,
    "content": "Good Morning, Recommendations for a technician to check a treadmill error? Preferably someone that comes to the house to check it. Thank you"
  },
  {
    "post_number": 900,
    "content": "Does anybody know where I can have a cuckoo clock repaired please.  There is a problem with maintaining the correct time after setting it (it's slow)"
  },
  {
    "post_number": 901,
    "content": "Hello, looking an AC (Mercury) technician asap that is available this week.\nThanks in advance"
  },
  {
    "post_number": 902,
    "content": "Anyone that makes custom teddy bears with patches? police, army etc?\nTIA."
  },
  {
    "post_number": 903,
    "content": "Mistoqsija: problema b’katusa qadima li meta giet imqabda ma katusa gdida waqt li saret it-triq mill-gdid, il-connection ma saretx sewwa. Dan qed iwassal biex gieli inixxi l-ilma ghal go propjeta ohra. Nahseb irid jithaffer fejn hemm il-connection u jitranga x-xoghol. Hawn xi hadd li jaghmel dan it-tip ta’ xoghol?"
  },
  {
    "post_number": 904,
    "content": "Can anyone recommend a good honest driving school for an English speaking foreigner please. Someone that will not rip him off, Thank you."
  },
  {
    "post_number": 905,
    "content": "I am looking for stainless steel counter tops like the catering ones - does anyone know who does it in Malta?"
  },
  {
    "post_number": 906,
    "content": "I have to say that I was very well served by Mr Omar Psaila (Mobile Clinic Gzira ) I had an issue with my mobile which is not imp to delve into ...he obviously solved it as usual !! !! But not only this ...i have to say that this gentleman ,apart from being  without a doubt  v.  professional in his work ... he is also  & V  importantly  nowadays ....super polite & nice ... & also very reachable which is v imp in these times as regards w mobile fone prob ...Prosit Omar...Keep up the good work & God Bless xx"
  },
  {
    "post_number": 907,
    "content": "The only ORIGINAL Are you being served by francesca and moira have now reached 124k members... we want to thank you all who have followed us throughout this 13 year journey.....  they say imitation is the sincerest form of flattery that mediocrity can pay to greatness.... so yes there are rubs platforms spreading regularly but we only are accountable for this one..... Thank you to all who have embraced and supported us on this journey...Happy new year"
  },
  {
    "post_number": 908,
    "content": "Can't thank Dr. William Grech,\nWilliam's Vet Surgery\nenough for being there for our cat outside of clinic hours. His work and dedication is what makes us trust him with the care of our precious little furry friends. Thank you William and Nenu for always taking my calls and always helping us in the hour of need.\nWe appreciate your work, your expertise and knowledge, and integrity in our little community in Gozo"
  },
  {
    "post_number": 909,
    "content": "Recommendations for customised hair accessories?"
  },
  {
    "post_number": 910,
    "content": "Hi! I need to reupholster a sofa, can I have some recommendations, tried and tested please? Thank you!"
  },
  {
    "post_number": 911,
    "content": "Ghandi dan il gas heater u sal bierah it tlieta kienu jixghelu imma x hin ergajt mort niprova, issa wahda biss qed tahdem. Xi hadd jaf min isewwihom jew x ghandu hazin. Grazzi."
  },
  {
    "post_number": 912,
    "content": "Anyone knows where I can purchase a solid wood (including legs) oval dining table?"
  },
  {
    "post_number": 913,
    "content": "I would like something machine embroidered on a sweat shirt . Does any one know of someone they can recommend preferably South Malta?"
  },
  {
    "post_number": 914,
    "content": "Hello! Looking for a metal structure for gypsum that will be suitable for a flush sliding door. Any contacts that would have in stock?"
  },
  {
    "post_number": 915,
    "content": "I need to get in touch with Go customer care. My son lives abroad and can't get in touch with them. Any help would be greatly appreciated as he just did a 1 year contract but has soooo many problems!!!"
  },
  {
    "post_number": 916,
    "content": "Hi! Can anyone share honest reviews on kitchen top brand okite please? Is it very durable and stain resistant please? thank you!"
  },
  {
    "post_number": 917,
    "content": "Epic Home Internet\nWe are considering Epic for home internet anyone using it and has any feedback please"
  },
  {
    "post_number": 918,
    "content": "Hello,\nAny recommendation for ballet dance classes for kids, please\nThank you!"
  },
  {
    "post_number": 919,
    "content": "Enhance your kitchen with a Bosch oven, designed to complement any style while delivering exceptional performance.\nMany Series 4 ovens feature advanced heating methods like 3D HotAir, Air Fry, top and bottom heating, HotAir Grilling, and HotAir Steam.\nDiscover more on our website \n https://bit.ly/oh-boschovens\n#OxfordHouse #Malta"
  },
  {
    "post_number": 920,
    "content": "Just wanted to thank  Crosscraft's sales manager (shopfloor) re. a misunderstanding about a part which needed to be replaced under guarantee. That is what after sales service is all about. 10/10 "
  },
  {
    "post_number": 921,
    "content": "Need recommendations for a good Tailor, Central region. Thanks."
  },
  {
    "post_number": 922,
    "content": "Ghandhi bzonn electration urgenty tafu xi wiehedGhandhi bzonn electration urgenty tafu xi wiehed"
  },
  {
    "post_number": 923,
    "content": "Can anyone recommend a carpenter to make an interior door asap"
  },
  {
    "post_number": 924,
    "content": "Does anyone have the book Qwiel u Qaddisin please ?"
  },
  {
    "post_number": 925,
    "content": "Tafu bxi technician tal\nFridge Freezers\ntajjeb pls."
  },
  {
    "post_number": 926,
    "content": "Hi, I just lost my ING Dutch bank card at Mater Dei hospital.  If by any chance someone will find it can you plse contact me me on +3161708185 / 99869707 Thank you so much in advance."
  },
  {
    "post_number": 927,
    "content": "I would like to purchase some nice dining chairs. Any recommendations please?"
  },
  {
    "post_number": 928,
    "content": "I enjoy positive posts and recommendations, especially the genuine ones.  So I will start off with the positive observation.   I love the way the Manoel theater was renovated.  Was very pleased to see the toilets upgraded and easy access with the installation of a lift catering for anyone who finds difficulty using stairs....  my only disappointment was finding out the bar coffee shop which was part of the theater  experience closed.  With Valletta inundated with so many catering establishments, it is amazing how nobody tendered to take it over.... what a big pity and disappointment...  just saying"
  },
  {
    "post_number": 929,
    "content": "Good afternoon,\nCan anyone recommend someone who services treadmills please . \nThanks"
  },
  {
    "post_number": 930,
    "content": "My friend is looking for Keffir Starter? Anybody has some to spare?thanks in advance."
  },
  {
    "post_number": 931,
    "content": "Hello! Does anyone know a reliable postal courier service from Malta to Libya? Alternatively, is there someone traveling to Libya this month who could assist? Thanks in advance!"
  },
  {
    "post_number": 932,
    "content": "Do you know of any shop or outlet that sells these bulb retaining clips? ... i only need one because i lost it but if they come in small packs it is also ok"
  },
  {
    "post_number": 933,
    "content": "LOOKING FOR a company that works with installation of VENTILATION.\nAny recommendations please, URGENT! thank you"
  },
  {
    "post_number": 934,
    "content": "From where can I purchase Isuzu D Max break pads today ?"
  },
  {
    "post_number": 935,
    "content": "any hotels/restaurants that offer buffet lunch on a saturday please?"
  },
  {
    "post_number": 936,
    "content": "I want to share my recent positive experience with \nColoristic \n painters. So incredibly happy with the amazing job Coloristic did painting my apartment! The paint job is smooth, even, and looks absolutely stunning. The owner was very responsive, he took care of all of the details, and he left everything spotless clean. Highly recommend "
  },
  {
    "post_number": 937,
    "content": "Anyone know where I can buy a One Plus mobile using some One4All vouchers please?"
  },
  {
    "post_number": 938,
    "content": "How does one go about finding a grave of a long lost relative at Addolorata Cemetery ? I only have a name and surname but no other information."
  },
  {
    "post_number": 939,
    "content": "Xi hadd ghandu motherboard tajba tal bosch classixx 5 washing machine?"
  },
  {
    "post_number": 940,
    "content": "I flew in from the states via  Heathrow to Malta last Friday with \nKM Malta Airlines\n however my luggage remains in Heathrow, no responsibility is being taken by the airline and I’m told to contact Heathrow myself or the baggage handling service company https://aviationservicesgroup.it obviously they are of zero help, it has been 2 and a half full days and no one can tell us anything about our luggage, is there anyone who can help tag someone who may help ? Also to say that there are 2 flights daily from Heathrow to Malta it’s extremely bad service or incompetence that no one can take responsibility and keeps sending us to different people"
  },
  {
    "post_number": 941,
    "content": "Any dentist on call? It’s an emergency, not even Mater Dei can cater"
  },
  {
    "post_number": 942,
    "content": "Goof morning, does anyone know of any reliable companies that have hatch doors done please? Im open to different types of materials/ options"
  },
  {
    "post_number": 943,
    "content": "I would like to commend Elia Caterers for exceeding my expectations yesterday! I wanted to order some cakes through Wolt. I called them to check if they had other cakes available apart from the ones listed since I wanted a choc one which would not be very messy apart from another almond cake. The girl answering the phone call explained that they can send a simpler chocolate one - I just need to leave a note on the Wolt order. She took my name to make sure that they send the right cake when the order comes in. The cake available on Wolt was a bit more costly which I did not mind paying for since ordering through Wolt saved me the trip to Hamrun. When the cakes were delivered, I was quite surprised that they sent a separate envelope with cash for the difference in price. Thank you Elia - cakes were lovely - all the guests enjoyed them especially the Almond Cherry Frangipan! Will surely order again, always served well by Elia! Exceptional customer service! \n    "
  },
  {
    "post_number": 944,
    "content": "Hi, does anyone know where I might find this kitten food; Ontario shrimp and chicken for kittens please"
  },
  {
    "post_number": 945,
    "content": "Guys be aware."
  },
  {
    "post_number": 946,
    "content": "Where can I get large mirrors?"
  },
  {
    "post_number": 947,
    "content": "Another very enjoyable Pantomime...today Rapunzel...very talented singers and the stage props excellent. Must say I recommend going to watch all these hard working teams, who are producing very entertaining shows of a very high standard..... we need to support them and appreciate ...."
  },
  {
    "post_number": 948,
    "content": "Virtual Reality headset għal qies ta' Samsung Galaxy A54 jekk jogħġbok?"
  },
  {
    "post_number": 949,
    "content": "Can anyone recommend a Pilates studio in central or north areas?"
  },
  {
    "post_number": 950,
    "content": "Looking for Men's suit cleaning and ironing services south area"
  },
  {
    "post_number": 951,
    "content": "Tafu lil xi hadd li jamel services fuq bieb ta garaxx ta remote please?"
  },
  {
    "post_number": 952,
    "content": "Looking for someone who can pressure wash a 65 sq meter terrace."
  },
  {
    "post_number": 953,
    "content": "Is there a lifter available to lift a washing machine up 2 storeys. The problem is that lifter has to enter an alley about 1.5m wide"
  },
  {
    "post_number": 954,
    "content": "Any advice on what to look for when buying a Tumble dryer?\nThanks in advance!"
  },
  {
    "post_number": 955,
    "content": "Anyone selling this Thickener planer pls? New or used. Thanks"
  },
  {
    "post_number": 956,
    "content": "Is there someone helpful who makes logo stickers for glass doors please ?\nTIA"
  },
  {
    "post_number": 957,
    "content": "Tafu minn fejn insib dawn it ti tip ta' mwejjed?"
  },
  {
    "post_number": 958,
    "content": "Hi anyone know of a good washing machine technician (Beko) who could possibly help me by tomorrow pls?"
  },
  {
    "post_number": 959,
    "content": "Does anyone know who sells Murphy beds locally please? TIA"
  },
  {
    "post_number": 960,
    "content": "Hi. I am looking for a venue (It can be an event hall, restaurant, hotel venue, etc.) for an engagement gathering for around 40 persons. Any recommendations are highly appreciated. Thank you "
  },
  {
    "post_number": 961,
    "content": "Bongu ghandi bzonn min dan il plastic li jghatti t tubu fis suffett, xi hadd jaf min ghandu south area pls? Grazzi"
  },
  {
    "post_number": 962,
    "content": "Hi ghandna bzonn haddied, tistghu tirrakomandawli xi hadd tajjeb please? Grazzi"
  },
  {
    "post_number": 963,
    "content": "I am looking for thick 2cm tiles to be used as kitchen top. Where can I find?"
  },
  {
    "post_number": 964,
    "content": "What are your opinions about tables and chairs from Ratatan.? They look nice from their page but since they have no showroom I would like some opinions"
  },
  {
    "post_number": 965,
    "content": "Any recommendations for a white goods retailer who has a decent after sales service"
  },
  {
    "post_number": 966,
    "content": "Good morning everyone. Looking for recommendations for a mopping robot that does not spin on semi gloss tiles. Tried unsuccessfully two Xiaomi ones which did not deliver as they needed some kind of modification to the wheels. We do not have pets, so I just need it to vacuum normal human hair, everyday debris, and mop WITHOUT spinning as in a dragster.."
  },
  {
    "post_number": 967,
    "content": "MaltaPost\n could you explain please why my delivery keeps being rescheduled with no notice, contact or explanation please?"
  },
  {
    "post_number": 968,
    "content": "Has anyone came across a better price than 149 euro for an electric ice cube make.... the best i came across is this from Top choice .... no cheesy comments please - i know i can use a tray but i would like a quick electric one....thanks\nDomo Ice Cube Maker\n.€149.00"
  },
  {
    "post_number": 969,
    "content": "Do you know someone who can print photos in good quality on a glass coaster pls?"
  },
  {
    "post_number": 970,
    "content": "Has anyone used Stiferite RP 43 mm insulation boards from Best Insulation to insulate against humidity/cold/heat? Can you give your genuine feedback (not recommendations from relatives/owners/employees) and whether you found it was effective?"
  },
  {
    "post_number": 971,
    "content": "Hi good morning any recommendations on a car electrician who specialises on Peugeot."
  },
  {
    "post_number": 972,
    "content": "Had a bit of a problem in Naxxar this morning and I’d like to publicly thank the two very kind LESA officers who helped me, 873 and 969. Thank you! "
  },
  {
    "post_number": 973,
    "content": "Looking for a company to supply and refit an existing shower room? I want to create a walk-in shower (instead of a shower tray) with an anti-slip floor, and new wall tiles and sanitary fittings. Preferably someone you have used yourself. \nIf you know of any company that gave you bad service, feel free to PM me. I’m not looking to create bad publicity in a group with so many members"
  },
  {
    "post_number": 974,
    "content": "Can  suggestions where I can get the car for the number plate to be  fixed back in place please?"
  },
  {
    "post_number": 975,
    "content": "Looking for a skilled 3D product developer who can create a 3D drawing in STP format using Fusion360 or any other software."
  },
  {
    "post_number": 976,
    "content": "From where we can buy a hoverboard charger pls ?"
  },
  {
    "post_number": 977,
    "content": "Anyone knows where i can BUY a bouncing castle with blower . ?\n3mx3m"
  },
  {
    "post_number": 978,
    "content": "Does anyone know who stocks Sol de Janiero products please? Or anyone who offers shipping?\nThank you"
  },
  {
    "post_number": 979,
    "content": "Does anyone know of any good car boot sales, ideally in the central area? TIA"
  },
  {
    "post_number": 980,
    "content": "Anyone knows from where I can find the below locally please?"
  },
  {
    "post_number": 981,
    "content": "Any recommendations for Dermatologists please? Thanks and have a good weekend"
  },
  {
    "post_number": 982,
    "content": "Attn: Ruben Galea \n I’ve received a parcel addressed to Ruben Galea twice, but it has my address on it, likely due to a mistake. The parcel contains a small item, possibly a car part. If you know a Ruben Galea, please tag him here! The right Ruben can send me a message identifying the part so I can hand it over. Let’s get this to the right person!"
  },
  {
    "post_number": 983,
    "content": "Does anyone know from where I can do a internal french door like the below please? Tia "
  },
  {
    "post_number": 984,
    "content": "Hello good evening. Im after opinions on water softener systems. Are there many types? Anyone who has one installed and willing to share their experience of it, prices and suppliers?"
  },
  {
    "post_number": 985,
    "content": "I have a \"date\" with my 12-year old. The plan was to go to Valletta for a stroll and brunch, then to the rides at Fairyland. My son is quite a foodie \n Can you suggest the best cafes/restaurants that serve breakfast/brunch pref with a sea view."
  },
  {
    "post_number": 986,
    "content": "SCAM ALERT\nA cruel scam by people who must be completely devoid of the Christmas spirit.\nThere’s clearly a demand for MADC’s Panto “Ebenezer Scrooge” now playing at Teatru Salesjan, and crooks see the value - but there is a correct way to procure or return tickets.\nwww.madc.com.mt.\nhttps://timesofmalta.com/article/panto-fans-warned-fake-ticket-scams.1103242"
  },
  {
    "post_number": 987,
    "content": "Any SMA inverter installer to setup the software with an installer code?"
  },
  {
    "post_number": 988,
    "content": "I would like to share my experience with Elmo Insurance following a car accident where my vehicle was unfortunately totalled. Having been a long-time customer of Elmo, I was directed to Ms. Michelle Cassar, the Motor Claims Senior Supervisor, and I couldn’t have asked for better support. Ms. Cassar’s professionalism and dedication truly stood out as she efficiently handled my case and ensured everything went smoothly. Thanks to her, the claim was settled with Atlas, and I got a new car in just over two weeks. I’m grateful for the excellent service provided by both Elmo and Atlas, who worked seamlessly together to make a potentially stressful situation much easier. Thanks"
  },
  {
    "post_number": 989,
    "content": "Any printers available tomorrow or Saturday please?"
  },
  {
    "post_number": 990,
    "content": "Is it safe to buy from Alibaba a rather big and expensive object please? Any advice is very much appreciated. Thanks!"
  },
  {
    "post_number": 991,
    "content": "Looking for someone to remove clutter from my garage. Thanks."
  },
  {
    "post_number": 992,
    "content": "Any pet groomers in San gwann area?"
  },
  {
    "post_number": 993,
    "content": "I have a semi basement garage which has water seeping from the floor. Is there someone who can come and check it out?\nThe water looks dirty and may potentially be drainage."
  },
  {
    "post_number": 994,
    "content": "Where can I find detergent which is suitable for Silk pillowcases and sheets please?"
  },
  {
    "post_number": 995,
    "content": "Nearly a month ago i had to go for an emergency operation due to a retina detachment. My praise goes to all staff at Opthalmic Ward and outpatient section. My greatest thanks goes to Mr David Cauchi - Consultant  and Dr Matthew Ellul .... you both  do miracles !! No words to thank you enough with. Thank you also to staff who were on duty on 6th December and to yesterday's staff after having to go for an emergency check up.\nGod bless you all..."
  },
  {
    "post_number": 996,
    "content": "Qandi bzonn electrician biex biex namel led strip indicators fuq side mirrors"
  },
  {
    "post_number": 997,
    "content": "Any recommendations for microwave (built-in) repairs? Thanks"
  },
  {
    "post_number": 998,
    "content": "Fejn nista niehu c cavetta tal karozza biex ibidluli l cover taghha ? Il buttuni biex tinfetah u tissakkar il karozza, nkissru. Grazzi."
  },
  {
    "post_number": 999,
    "content": "Għandna tapit u nixtiequ nqassruh. Tafu b’xi ħadd, jekk jogħġobkom, li jagħmel dan ix-xogħol u jieħu ħsieb li l-finishing fejn ikun maqtugħ ikun tajjeb?"
  },
  {
    "post_number": 1000,
    "content": "Please xi hadd jaf minn fejn insib minn dan is cereals xtrajtu mill lidl imma bhal issa ma ghandux"
  },
  {
    "post_number": 1001,
    "content": "Hawn xi hadd ibigh dal-prodott hawn Malta ?"
  },
  {
    "post_number": 1002,
    "content": "I would like to show my appreciation to all the staff at Paola Health Centre for their excellent approach and patient's care. \nWell done and keep up your good work."
  },
  {
    "post_number": 1003,
    "content": ". Ghandi sigra laringa bakkaljaw a u Kieku xtaqt inlaqqama ghal wahda BAHRIJA (taghmel  laring helu, kbir, minn gewwa roza. )\nTafu tghiduli bxi hadd li jista jaqdini please"
  },
  {
    "post_number": 1004,
    "content": "Happy New Year everyone! Would anyone know where I can buy the below in Malta please?"
  },
  {
    "post_number": 1005,
    "content": "A big shout out to all the staff who were on duty yesterday at MDH emergency department especially Dr Brooke Falzon for all the care and attention in helping my mum. These guys do miracles  "
  },
  {
    "post_number": 1006,
    "content": "Attn. To All the Firm of Martina Sciberras (Medical)\nFor over 3 weeks my uncle Charles Cassar was admitted in Hospital \nMater Dei Hospital\n in Surgical Ward 2, where he was being taken care of my Martina Sciberras's Firm of Doctors. \nMy Auntie, Barbara Cassar would like to take the opportunity to send her heartfelt Thanks and Gratitude, for their endless time and effort they took to help her brother Charles Cassar get better, and be able to be discharged home. \nAmong the many doctors who treated him, Barbara Cassar would like to especially thank, the Consultant herself Martina Sciberras and her doctors, Luigi Dimech, Julia Darmanin and Lara Miruzzi. You were all there from the very start, you made sure that her brother was getting the very best care,  and any new issues that arose throughout his admission, you all made sure to tackle it fast, efficiently and in the most caring way. \nWe will always be in your debt for your compassion and expertise during his treatments. Your Care and patiences made a difficult time much easier to bare, and you managed to bring Charles Cassar back to health, for us to have him back home for Christmas and Start the New Year fresh.\nFrom all the Family but Especially from Barbara Cassar, Thank you\nIn addition to all the help from the doctors, he was being taken care of by round the clock help and monitoring from all the 5 star Nurses at S2...Thank you\nThank you Again and May you all have A Prosperous New Year!"
  },
  {
    "post_number": 1007,
    "content": "Happy New Year \n Looking for a supplier for exposed Aggregate tiles - any references would be greatly appreciated. Thank you"
  },
  {
    "post_number": 1008,
    "content": "Hello. Do you know any drum teachers central area preferably in  Mosta. Thank you and wishing you all a happy new year."
  },
  {
    "post_number": 1009,
    "content": "Which is the best Chinese take out (bolt/wolt) that delivers to south areas? Thank you"
  },
  {
    "post_number": 1010,
    "content": "Virtual Reality headset għal qies ta' Samsung Galaxy A54 jekk jogħġbok?"
  },
  {
    "post_number": 1011,
    "content": "good morning trying my luck maybe someone knows were to buy this i tried some asian shop nut they said its out of stock"
  },
  {
    "post_number": 1012,
    "content": "Does anyone know where I can find muslin; whether for cooking or not? TIA"
  },
  {
    "post_number": 1013,
    "content": "Like visiting St. Julians? Feeling peckish or downright hungry? A fan of Turkish food? Then look no further than \nAlem Turkish\n. A newly-opened, family-run business which serves, hand on heart, the best turkish food I ever tried. Everything is made fresh daily (including the bread!) by the owners themselves! The mixed grill (for 2) was enormous yet disappeared very quickly thanks to yours truly. The pide (boat-shaped pizza) was also gargantuan and delicious according to my 9-year old little big champ. We also sampled baklava which was utterly delicious, devoid of excessive honey and not too sweet; with the right balance of filo and pistachios. I must also stress that prices are very competitive and far from typical of such an elite area. Highly recommended!"
  },
  {
    "post_number": 1014,
    "content": "Need an MCB as per photo urgently by tomorrow morning since there is a short circuit and we have no electricity. Thanks in advance"
  },
  {
    "post_number": 1015,
    "content": "Hi everyone,\nLooking for a restaurant in the south area that can accommodate 2 adults and a pushchair for a quick dinner tonight. Any recommendations? Preferably somewhere with space for the pushchair. Thanks in advance!"
  },
  {
    "post_number": 1016,
    "content": "We often complain about the lack of customer service, but rarely praise or acknowledge the ones that go above and beyond.\nFor the last couple of months, I’ve been shopping on the OK Fashion website and everything has been great. \nCouple of days ago, I encountered an issue while trying to place an order and I emailed their customer care.\nNot only my email was attended to in less than an hour, but Ms. Vella had managed to sort the situation in less than 90 minutes.\nIn the past, I had a question for customer service and the representative was also very courteous, accommodating and professional.\nOK Fashion\n, please keep up the good work and thank you for the excellent service.\nHappy New Year to all!"
  },
  {
    "post_number": 1017,
    "content": "Anybody local that sells Ohuhu alcohol markers please ?"
  },
  {
    "post_number": 1018,
    "content": "Normally I am not a person who likes to write here but just wanted to thank the Transport Malta customer agents at Lija and Paola offices as when we thought we are all alone trying to understand the procedure to register an e-kick scooter and apply for the government grant, the person in Lija, wearing a grey top (yesterday) guided us on the exact procedure while earlier this morning the person wearing a red dress in Paola, helped us register and complete the necessary forms.  Thanks and well done both of you!"
  },
  {
    "post_number": 1019,
    "content": "Good morning, I'm after a wireless vacuum cleaner - what's the recommended model at the moment ...and from where please? Thanks x"
  },
  {
    "post_number": 1020,
    "content": "In need of an AC installer asap please, just to place the already installed AC a bit higher than it is, preferebly this week if possible, thanks"
  },
  {
    "post_number": 1021,
    "content": "Very well served by Maria from GO.She helped me and guided me on phone and solved my problem."
  },
  {
    "post_number": 1022,
    "content": "Is the Christmas market open in fairyland?"
  },
  {
    "post_number": 1023,
    "content": "Happy endings to all..."
  },
  {
    "post_number": 1024,
    "content": "Unfortunately I had to return a gift at accessorize sliema and I received IMPECCABLE treatment from Kylie! Whoever is in charge should give her a promotion and a raise. Her manners, demeanor, customer service and product knowledge were exemplary. She went the extra mile helping me out with a particular issue I was experiencing when she didn't have to and I will be going back to purchase just because the service was THAT good. Thanks again Kylie! ♡"
  },
  {
    "post_number": 1025,
    "content": "Does anyone know where Mr. Mark Portelli (orthopedic surgeon) sees patients besides St.James hospital please? Thank you\nUpdate: Thank you, appointment sorted out."
  },
  {
    "post_number": 1026,
    "content": "Any decent restaurant availability for a table x 2 tomorrow evening? Please don’t ask why I left it so late…"
  },
  {
    "post_number": 1027,
    "content": "Hey! I need to buy firewood for a fireplace, anyone knows where I can find this in Sliema/St Julian’s please?"
  },
  {
    "post_number": 1028,
    "content": "Any recommendations for pvc/aluminum doors in sicily please?"
  },
  {
    "post_number": 1029,
    "content": "Posting on behalf of my Mum who was at Smart Complex with my Dad this morning.\nThere are angels around \nMy Dad had a hypoglycemic attack as he was in the lift leaving Matalan, and he passed out. \nA huge thank you to Mary Rose and Robert Gauci, Mark Ciantar (of Smart Supermarket) and many others who immediately helped. They were caring, and rushed to help Mum, who knows what to do when this happens. \nThank you all so much \nMany hours later, Dad is fine "
  },
  {
    "post_number": 1030,
    "content": "Please jekk xi hadd sab xi pouch id decathlon illum xi 6:30pm please jiritornah lura. Kien fih il kartira cwivet tal karozzi u afarijiet personali ohra . Grazzi"
  },
  {
    "post_number": 1031,
    "content": "Recently I was over charged by a Bolt driver who kept modifying the route to avoid traffic. I complained to Bolt but only automated response. \nNow they sent their new conditions of business. \nQuote \nDrivers provide transport services on an independent basis (either in person or via a company) as economic and professional service providers. Bolt is not responsible in any way for the fulfilment of the contract entered into between the passenger (you) and the driver. Disputes arising from consumer rights, legal obligations or from law applicable to the provision of transport services will be resolved between the passengers and drivers.\nhttps://bolt.eu/en-th/legal/tnc-passengers/..."
  },
  {
    "post_number": 1032,
    "content": "I would sincerely like to Thank the employee of the BNF BANK,  Fgura branch  Who helped us To do a transaction. by atm even though it wasn't yet opening. But I was going to miss an appointment so she stepped in. .. \nI would also like to tiank the whole staff of the call centre of this bank. They are very helpful and explain things in detail..\nThank you all so very much for the great service. "
  },
  {
    "post_number": 1033,
    "content": "Anyone can recommend the services of a driver with a van that can take an elderly person in a wheelchair from a care home in Paola to Fgura?\nIt's important that the person remains in her wheelchair for the duration of the trip.\nThanks in advance!"
  },
  {
    "post_number": 1034,
    "content": "I have to pick up the new identity card. Does anyone know if Identita is working tomorrow morning?"
  },
  {
    "post_number": 1035,
    "content": "Nixtiequ nirringrazzjaw lill-cabin crew ta’ flight FR7115/FR711, speċjalment lil Karl, li wara d-delay kollu li kellna għena ħafna biex jikkalma lil kulħadd u lit-tfal. Titjira sħiħa u ma waqfux sekonda jaraw x’għandna bżonn. \nGrazzi mill-qalb \nKylie Vella\n Edwin Chetcuti"
  },
  {
    "post_number": 1036,
    "content": "Any AC technicians available to service Gree ACs on 2nd Jan pls?"
  },
  {
    "post_number": 1037,
    "content": "Does anyone know where I can possibly buy a confidentiality pen or roller locally please? Photos for reference. (Standard Permanent marker or online is not an option)\nThank you "
  },
  {
    "post_number": 1038,
    "content": "Any efficient clothes and suitcase zip repair shops in the area of St Julian’s/Sliema/San Gwann/Swieqi?"
  },
  {
    "post_number": 1039,
    "content": "Looking for a reliable forwarder - weekly from Italy, timely pick-up and deliveries."
  },
  {
    "post_number": 1040,
    "content": "Heads up for whoever visits the circus in Bahar ic Caghaq.\nNot reviewing the actual show however be informed that part of the show consists of 3 motorcycles performing in a cage just before the intermission.\nWith no proper ventilation prepare to inhale extremely high levels of carbon monoxide throughout the second half of the show. Very beneficial for all our kids lungs. Enjoy !"
  },
  {
    "post_number": 1041,
    "content": "Highly recommend Matthew Abela \nTile Layer Tal-Madum\n  for any tile laying jobs you require. He is very efficient, keeps with agreed time frames and replies immediately when contacted. He is also open to discuss the needs of the client and always tries to give the best advice possible."
  },
  {
    "post_number": 1042,
    "content": "Please hawn xi hadd issewi tablet ta tifla, dahlet il charge hazin fil port ."
  },
  {
    "post_number": 1043,
    "content": "Gm\nWho stocks something similar ideally south area pls\nTia"
  },
  {
    "post_number": 1044,
    "content": "Nhar Is - Sibt 28 ta' Dicembru \nKeli bzonn Taxi service\nStaqsejt 12 u l - ahjar Prezz kien ta dan Taxi Driver! Hamdi Nemria \nBarra minhekk servizz kien \nPuntwali -  Tajjeb  fuq kollox Peesuna - Edukata u  Onest !\nProsit hafna ! \nJien Nissugerixxi hafna is servizz tieghu !"
  },
  {
    "post_number": 1045,
    "content": "Tafu min isewwi arloggi Tal idejn? Grazzi hafna"
  },
  {
    "post_number": 1046,
    "content": "Looking for a technician to repair an HP printer with an onsite visit in the Mosta area, please. Thank you!!"
  },
  {
    "post_number": 1047,
    "content": "Any idea where this type of clock pendulum can be bought?\nGhandkom idea minn fejn tista tixtri il pendlu ta dan it- tip ta arlogg?"
  },
  {
    "post_number": 1048,
    "content": "I have old aluminium apertures and steel structures to dispose of…. Does anyone know if there is anyone who would collect these to reuse or dispose of properly? Thank you"
  },
  {
    "post_number": 1049,
    "content": "Xihadd ghandu in stock pls?\n(Scan U Klikk mghandomx)"
  },
  {
    "post_number": 1050,
    "content": "Are there alternatives to showshappening ticket platform? Their 10% booking fee is ridiculously high when you compare it to other platforms in Europe. They do a lot of work with NnG and I feel like they have monopolized the market. When I lived in UK, the booking fees were usually 1% for concerts as large as Aerosmith, Maneskin, etc (in arenas such as the prestigious O2). Why do Maltese organizers always have to be greedy?"
  },
  {
    "post_number": 1051,
    "content": "Issues with \nEpic mt\n - disappointing service\nWe've been in a contract with epic for 10 days - within the last 2 days, we've lost broadband connection 4 times. On Sundays they only have chat support, which would be fine if it didn't keep disconnecting mid-conversation or simply while waiting to connect. Being a freelancer, this is not only inconvenient for entertainment, but also for work.\nEpic needs to do better - and fix their chat."
  },
  {
    "post_number": 1052,
    "content": "Is there an authority I can contact to remove a dead mouse from the street in St Julians (the Gardens)?"
  }
]